000_OrgFiles/EmacsConfig.org
# -*- ispell-local-dictionary: "british"; -*-
#+TITLE:        Personal Emacs Configuration
#+DATE:         [2024-01-06]
#+DESCRIPTION:  This configuration is organized into subdirectories, which makes it easier to enable or disable large parts of it
#+PROPERTY:     header-args:emacs-lisp :tangle ../C01_EmacsConfiguration/.emacs.d/init.el :mkdirp yes
#+STARTUP:      hideblocks show2levels
#+OPTIONS:      toc:2
#+auto_tangle:  t

* Table of Contents                                                     :toc:
- [[#introduction][Introduction]]
  - [[#starting-emacs-daemon][Starting Emacs Daemon]]
- [[#header][Header]]
- [[#package-system-setup][Package System Setup]]
  - [[#straight-package-manager][Straight Package Manager]]
  - [[#package-repositories][Package Repositories]]
  - [[#early-load-org-mode][Early Load Org Mode]]
  - [[#set-load-path-early][Set Load Path Early]]
- [[#initial-section][Initial Section]]
  - [[#loading-custom-lisp-files][Loading Custom Lisp Files]]
- [[#load-package-configurations][Load Package Configurations]]
- [[#keybinding-configuration][Keybinding Configuration]]
  - [[#evil-mode][Evil Mode]]
  - [[#general][General]]
  - [[#which-key][Which Key]]
- [[#file-management][File Management]]
  - [[#dired-extensions][Dired Extensions]]
  - [[#ranger][Ranger]]
  - [[#pdf-tools][PDF Tools]]
  - [[#openwith][Openwith]]
- [[#quality-of-live-extensions][Quality of Live Extensions]]
  - [[#collection-of-qol-extensions][Collection of QoL Extensions]]
  - [[#multiple-cursors][Multiple Cursors]]
  - [[#undo-tree][Undo-Tree]]
  - [[#projectile][Projectile]]
  - [[#yasnippets][YASnippets]]
- [[#graphical-user-interface-tweaks-and-extensions][Graphical User Interface Tweaks and Extensions]]
  - [[#all-the-icons][All The Icons]]
  - [[#modelines][Modelines]]
  - [[#themes][Themes]]
  - [[#perspective][Perspective]]
  - [[#dashboard][Dashboard]]
  - [[#ivy-with-counsel-and-prescient][Ivy with Counsel and Prescient]]
  - [[#helm][Helm]]
  - [[#hydra][Hydra]]
  - [[#treemacs-mode][Treemacs Mode]]
  - [[#neotree][Neotree]]
  - [[#beacon][Beacon]]
  - [[#gui-extensions][GUI Extensions]]
- [[#developement-tools][Developement Tools]]
  - [[#magit][Magit]]
  - [[#consult][Consult]]
  - [[#company-mode][Company Mode]]
  - [[#dev-tool-collection][Dev Tool Collection]]
  - [[#devdocs][DevDocs]]
  - [[#language-support][Language Support]]
- [[#terminal-modes][Terminal Modes]]
  - [[#vterm][Vterm]]
  - [[#eshell][Eshell]]
- [[#org-mode][Org Mode]]
  - [[#org-font-faces][Org Font Faces]]
  - [[#org-plus-contrib][Org Plus Contrib]]
  - [[#vanilla-org-config][Vanilla Org Config]]
  - [[#org-mode-latex-tweaks][Org Mode LaTeX Tweaks]]
  - [[#org-babel-languages][Org Babel Languages]]
  - [[#structure-templates][Structure Templates]]
  - [[#capture-templates][Capture Templates]]
  - [[#org-extensions][Org Extensions]]
- [[#legder-mode][Legder Mode]]
- [[#citeproc][Citeproc]]
- [[#mail][Mail]]
  - [[#mu4e][mu4e]]
- [[#password-management][Password Management]]
  - [[#password-store][Password Store]]
  - [[#emacs-totp][Emacs TOTP]]
- [[#contact-management][Contact Management]]
  - [[#ebdb][EBDB]]
- [[#erc][ERC]]
- [[#eradio][ERadio]]
- [[#elfeed---emacs-rss-feed][Elfeed - Emacs RSS Feed]]
  - [[#load-elfeed][Load Elfeed]]
  - [[#elfeed-score][Elfeed-Score]]
  - [[#elfeed-org][Elfeed-Org]]
  - [[#elfeed-dashboard][Elfeed-Dashboard]]
- [[#automatically-tangle-files][Automatically Tangle Files]]
  - [[#emacs][Emacs]]

* Introduction

This is my personal [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs Configuration]] and therefore its geared towards my needs.
It is not meant as a prime example or template nor is it aimed to be a general purpose setup.

Feel free to adopt parts that you find useful.
A big chunk of the Configuration was inspired by the ~Emacs From Scratch Youtube-Series~ from [[https://systemcrafters.net/emacs-from-scratch/][SystemCrafters.net]], which i highly recommend as a starting point to [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Configuring Emacs]]. I added and changed alot however since starting out.

Another good source is [[https://protesilaos.com/emacs/dotemacs][Protesilaos.com: Dotemacs]], which i took inspiration from for the [[*Capture Templates][Org Capture Templates]].

I also added parts of [[https://gitlab.com/dwt1/dotfiles/-/blob/master/.config/emacs/config.org][DT’s Emacs Config]], especially those that deal with [[*Evil Mode][Evil-Mode]].

For some of the developement tools like [[*DevDocs][DevDocs]] I took inspiration from [[https://github.com/gopar/.emacs.d][GitHub.com: Gopar - Emacs.d]]

** Starting Emacs Daemon

To get the best out of [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]], it's recommended to use the ~Daemon Capabilities~ it offers. This *might slow down your system Startup* time, but it definitely *significantly increases* [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] ~Startup Time~ if you connect to the server with the =emacsclient= [[id:bf9b9431-2e38-411a-904f-c5b0c913520d][command]].

If you want to *startup* the [[id:0e90f8b7-dd79-42fd-928f-c6b2ff4a63a2][Emacs Daemon]] automatically and your ~System~ makes use of [[id:c0a74747-b48a-49a4-ae88-a612f27a3b28][systemd]], simply create the file =emacs.service= under =~/.config/systemd/user/= with the following contents:
#+begin_src shell
  [Unit]
  Description=Emacs - The extensibles, customizable, self-documenting Editor
  Documentation=info:emacs man:emacs(1) https://gnu.org/software/emacs/

  [Service]
  Type=forking
  ExecStart=/usr/local/bin/emacs --daemon
  ExecStop=/usr/local/bin/emacsclient --eval "(kill-emacs)"
  Environment=SSH_AUTH_SOCK=%t/keyring/ssh
  Restart=on-failure

  [Install]
  WantedBy=default.target
#+end_src

After that run

#+begin_src shell
  systemctl enable --user emacs
#+end_src

so [[id:c0a74747-b48a-49a4-ae88-a612f27a3b28][systemd]] would copy the ~configuration file~ into central places and it would start ~Emacs~ service at boot time.

To run Emacs service right now, use

#+begin_src shell
  systemctl start --user emacs
#+end_src

* Header
#+begin_src emacs-lisp

  ;;   _____ __  __    _    ____ ____
  ;;  | ____|  \/  |  / \  / ___/ ___|
  ;;  |  _| | |\/| | / _ \| |   \___ \
  ;;  | |___| |  | |/ ___ \ |___ ___) |
  ;;  |_____|_|  |_/_/   \_\____|____/
  ;;

  ;; NOTE: init.el is generated from EmacsTestConfig.org.
  ;; Please change your settings in that file
  ;; using Emacs and init.el will be generated automatically!

#+end_src
* Package System Setup
** Straight Package Manager
Emacs has a built in package manager but it doesn't make it easy to automatically install packages on a new system the first time you pull down your configuration.  [[https://github.com/jwiegley/use-package][use-package]] is a really helpful package used in this configuration to make it a lot easier to automate the installation and configuration of everything else we use.

We also use ~straight.el~ to manage our packages instead of ~package.el~, because it allows for more detailed customization and enables more streamlined installation of packages from ~github~ or ~gitLab~, that are not yet part of *elpa* or *melpa*.
The *bootstrap* script is needed to install straight.el without the need for package.el. It should work cross platform without the need to update anytime soon. It's recommended by the authors to use. If straight.el is already installed, the script won't run again!
A guide from ~System Crafters~ to =straight.el= can be found [[https://systemcrafters.cc/advanced-package-management/using-straight-el/][here]].

If you set up ~straight.el~ with ~use-package~ (straight-use-package 'use-package) you have to replace =:ensure= with =:straight=

#+begin_src emacs-lisp
  ;; bootstrap script to install straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Use straight.el for use-package expressions
  (straight-use-package 'use-package)

  ;; Make sure to always install packages (pendant to use-package-always-ensure)
  (setq straight-use-package-by-default t)

#+end_src
** Package Repositories

#+begin_src emacs-lisp
  ;; This is set just to be able to lookup packages
  ;; It's not required since we use straight anyway
  (setq package-archives
        '(("melpa" . "https://melpa.org/packages/")
          ("melpa-stable" . "https://stable.melpa.org/packages/")
          ("org" . "https://orgmode.org/elpa/")
          ("elpa" . "https://elpa.gnu.org/packages/")))

#+end_src
** Early Load Org Mode
This is done to mitigate the ~Version Mismatch Error~, see ~NOTE~ below
#+begin_src emacs-lisp
    ;; Early load Org Mode
    (use-package org)

#+end_src
:NOTE:
Version mismatch is commonly encountered in the following situations:

1. Emacs is loaded using literate Org config and more recent Org
   version is loaded inside the file loaded by ‘org-babel-load-file’.
   ‘org-babel-load-file’ triggers the built-in Org version clashing
   the newer Org version attempt to be loaded later.

   It is recommended to move the Org loading code before the
   ‘org-babel-load-file’ call.

2. New Org version is loaded manually by setting ‘load-path’, but some
   other package depending on Org is loaded before the ‘load-path’ is
   configured.
   This "other package" is triggering built-in Org version, again
   causing the version mismatch.

   It is recommended to set ‘load-path’ as early in the config as
   possible.

3. New Org version is loaded using straight.el package manager and
   other package depending on Org is loaded before straight triggers
   loading of the newer Org version.

   It is recommended to put

    (straight-use-package 'org)

   early in the config.  Ideally, right after the straight.el
   bootstrap.  Moving ‘use-package’ :straight declaration may not be
   sufficient if the corresponding ‘use-package’ statement is
   deferring the loading.
:END:
** Set Load Path Early
#+begin_src emacs-lisp
  ;; Set mu4e directory path
  (if (file-directory-p "~/Projects/Programs/github-gitlab/mu/build/mu4e")
	  (setq pet/mu4e-load-path "~/Projects/Programs/github-gitlab/mu/build/mu4e")
	(if (file-directory-p "/usr/share/emacs/site-lisp/mu4e")
	(setq pet/mu4e-load-path "/usr/share/emacs/site-lisp/mu4e")
	  (if (file-directory-p "/usr/share/emacs/site-lisp/mu/mu4e")
	  (setq pet/mu4e-load-path "/usr/share/emacs/site-lisp/mu/mu4e")
	(if (file-directory-p "/usr/local/share/emacs/site-lisp/mu4e")
		(setq pet/mu4e-load-path "/usr/local/share/emacs/site-lisp/mu4e")
	  (if (file-directory-p "/usr/local/share/emacs/site-lisp/mu/mu4e")
		  (setq pet/mu4e-load-path "/usr/local/share/emacs/site-lisp/mu/mu4e")
		nil)))))

  ;; Add mu4e load path
  (if (boundp 'pet/mu4e-load-path)
	  (add-to-list 'load-path pet/mu4e-load-path)
	nil)

#+end_src
* Initial Section
** Loading Custom Lisp Files
#+begin_src emacs-lisp
  ;; Load Functions
  (when (file-exists-p "~/.dotfiles/C01_EmacsConfiguration/lisp/functions.el")
    (load "~/.dotfiles/C01_EmacsConfiguration/lisp/functions.el"))

  ;; Load Variables
  (pet/load-file "~/.dotfiles/C01_EmacsConfiguration/lisp/variables.el")

  ;; Load Basic UI
  (pet/load-file (concat pet/dotfiles-emacsconfig-dir "lisp/basic_ui.el"))

  ;; Load Basic QoL Adjustments
  (pet/load-file (concat pet/dotfiles-emacsconfig-dir "lisp/basic_qol.el"))

  ;; Load Basic QoL Adjustments
  (setq pet/ledger-categories '())  ;; incase the file can’t be loaded
  (pet/load-file "~/.dotfiles-private/Configurations/C2-Emacs/EmacsPrivateVariables.el")

#+end_src
