C01_EmacsConfiguration/.emacs.d/init.el
;;   _____ __  __    _    ____ ____  
;;  | ____|  \/  |  / \  / ___/ ___| 
;;  |  _| | |\/| | / _ \| |   \___ \ 
;;  | |___| |  | |/ ___ \ |___ ___) |
;;  |_____|_|  |_/_/   \_\____|____/ 
;;                                   

;; NOTE: init.el is generated from EmacsTestConfig.org.
;; Please change your settings in that file
;; using Emacs and init.el will be generated automatically!

;; bootstrap script to install straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Use straight.el for use-package expressions
(straight-use-package 'use-package)

;; Make sure to always install packages (pendant to use-package-always-ensure)
(setq straight-use-package-by-default t)

;; This is set just to be able to lookup packages
;; It's not required since we use straight anyway
(setq package-archives
      '(("melpa" . "https://melpa.org/packages/")
        ("melpa-stable" . "https://stable.melpa.org/packages/")
        ("org" . "https://orgmode.org/elpa/")
        ("elpa" . "https://elpa.gnu.org/packages/")))

;; Early load Org Mode
(use-package org)

;; Set mu4e directory path
(if (file-directory-p "~/Projects/Programs/github-gitlab/mu/build/mu4e")
	(setq pet/mu4e-load-path "~/Projects/Programs/github-gitlab/mu/build/mu4e")
      (if (file-directory-p "/usr/share/emacs/site-lisp/mu4e")
      (setq pet/mu4e-load-path "/usr/share/emacs/site-lisp/mu4e")
	(if (file-directory-p "/usr/share/emacs/site-lisp/mu/mu4e")
	(setq pet/mu4e-load-path "/usr/share/emacs/site-lisp/mu/mu4e")
      (if (file-directory-p "/usr/local/share/emacs/site-lisp/mu4e")
	      (setq pet/mu4e-load-path "/usr/local/share/emacs/site-lisp/mu4e")
	(if (file-directory-p "/usr/local/share/emacs/site-lisp/mu/mu4e")
		(setq pet/mu4e-load-path "/usr/local/share/emacs/site-lisp/mu/mu4e")
	      nil)))))

;; Add mu4e load path
(if (boundp 'pet/mu4e-load-path)
	(add-to-list 'load-path pet/mu4e-load-path)
      nil)

;; Load Functions
(when (file-exists-p "~/.dotfiles/C01_EmacsConfiguration/lisp/functions.el")
  (load "~/.dotfiles/C01_EmacsConfiguration/lisp/functions.el"))

;; Load Variables
(pet/load-file "~/.dotfiles/C01_EmacsConfiguration/lisp/variables.el")

;; Load Basic UI
(pet/load-file (concat pet/dotfiles-emacsconfig-dir "lisp/basic_ui.el"))

;; Load Basic QoL Adjustments
(pet/load-file (concat pet/dotfiles-emacsconfig-dir "lisp/basic_qol.el"))
