000_OrgFiles/EmacsConfig.org
* Load Package Configurations
#+begin_src emacs-lisp
  (cl-loop for config in
  		 ;; Load Evil Configuration
           '("package_configs/evil_config.el"

  		   ;; Load General Configuration adjusted for Evil
  		   "package_configs/general_evil_config.el"
  		   ;; Load General Leader Keys after General init
  		   "package_configs/general_leader_keys.el"

  		   ;; ;; Load General Configuration for standard Emacs
  		   ;; "package_configs/general_standard_config.el"
  		   ;; ;; Load General Leader Keys after General init
  		   ;; "package_configs/general_leader_keys.el"

  		   ;; Load Which Key Configuration
  		   "package_configs/which_key_config.el"

  		   ;; Load Dired Extensions Configuration
  		   "package_configs/dired_extensions_config.el"

  		   ;; ;; Load Ranger Configuration
  		   ;; "package_configs/ranger_config.el"

  		   ;; Load Openwith Configuration
  		   "package_configs/openwith_config.el"

  		   ;; Load PDF-Tools Configuration
  		   "package_configs/pdf_tools_config.el"

  		   ;; Load All The Icons Configuration
  		   "package_configs/all_the_icons_config.el"

  		   ;; Load Doom Modeline Configuration
  		   "package_configs/modeline_config.el"

  		   ;; Load Themes Configuration
  		   "package_configs/themes_config.el"

  		   ;; Load QoL Extensions Collection Configuration
  		   "package_configs/qol_collection_config.el"

  		   ;; Load Projectile Configuration
  		   "package_configs/projectile_config.el"

  		   ;; ;; Load Undo-Tree Configuration
  		   ;; "package_configs/undo_tree_config.el"

  		   ;; ;; Load Multiple Cursors Configuration
  		   ;; "package_configs/multiple_cursors_config.el"

  		   ;; Load Yasnippets Configuration
  		   "package_configs/yasnippets_config.el"

  		   ;; Load Dashboard Configuration
  		   "package_configs/dashboard_config.el"

  		   ;; ;; Load Beacon Configuration
  		   ;; "package_configs/beacon_config.el"

  		   ;; Load GUI Extensions Collection
  		   "package_configs/gui_extensions_config.el"

  		   ;; Load Ivy (and Counsel) Configuration
  		   "package_configs/ivy_config.el"

  		   ;; ;; Load Helm Configuration
  		   ;; "package_configs/helm_config.el"

  		   ;; Load Perspective Configuration
  		   "package_configs/perspective_config.el"

  		   ;; Load Treemacs Configuration
  		   "package_configs/treemacs_config.el"

  		   ;; ;; Load Neotree Configuration
  		   ;; "package_configs/neotree_config.el"

  		   ;; ;; Load Hydra Configuration
  		   ;; "package_configs/hydra_config.el"

  		   ;; Load Org Configuration
  		   "package_configs/org_config.el"

  		   ;; Load Ledger Mode Configuration
  		   "package_configs/ledger_mode_config.el"

  		   ;; Load Vterm Mode Configuration
  		   "package_configs/vterm_config.el"

  		   ;; Load EShell Mode Configuration
  		   "package_configs/eshell_config.el"

  		   ;; Load Magit Configuration
  		   "package_configs/magit_config.el"

  		   ;; Load Developement Tools Collection Configuration
  		   "package_configs/dev_tools_collection_config.el"

  		   ;; ;; Load Company Configuration
  		   ;; "package_configs/company_config.el"

  		   ;; ;; Load Consult Configuration
  		   ;; "package_configs/consult_config.el"

  		   ;; Load Traditional Language Modes
  		   "package_configs/language_modes_config.el"

  		   ;; Load Tree-Sitter Language Modes
  		   "package_configs/language_ts_modes_config.el"

  		   ;; ;; Load LSP Mode Configuration
  		   ;; "package_configs/lsp_mode_config.el"

  		   ;; Load Eglo Configuration
  		   "package_configs/eglot_config.el"

  		   ;; Load Eglo Configuration
  		   "package_configs/devdocs_config.el"

  		   ;; ;; Load Citeproc Configuration
  		   ;; "package_configs/citeproc_config.el"

  		   ;; Load mu4e Configuration
  		   "package_configs/mu4e_config.el"

  		   ;; ;; Load Password Store Configuration
  		   ;; "package_configs/password_store_config.el"

  		   ;; Load TOTP Configuration
  		   "package_configs/totp_config.el"

  		   ;; ;; Load EBDB Configuration
  		   ;; "package_configs/ebdb_config.el"

  		   ;; Load Elfeed Configuration
  		   "package_configs/elfeed_config.el"

  		   ;; Load ERC Configuration
  		   "package_configs/erc_config.el"

  		   ;; Load ERadio Configuration
             "package_configs/eradio_config.el")
           do
           (pet/load-file (concat user-emacs-directory config)))

#+end_src
* Keybinding Configuration
** Evil Mode
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/evil_config.el :mkdirp yes
:END:

Let's bring [[id:8212a283-520d-495c-86ee-fc47d1a00363][Vi]] to [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]
[[https://github.com/emacs-evil/evil][GitHub.com - Evil]]
#+begin_src emacs-lisp
  ;; Bring Vi to Emacs
  (use-package evil
    :init  ;; Tweak Evil before loading
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (setq evil-undo-system 'undo-redo)  ;; Adds vim-like C-r redo functionality
    (evil-mode))

  ;; Using RETURN to follow links in Org/Evil
  ;; Unmap keys in 'evil-maps if not done, (setq org-return-follows-link t) will not work
  (with-eval-after-load 'evil-maps
    (define-key evil-motion-state-map (kbd "SPC") nil)
    (define-key evil-motion-state-map (kbd "RET") nil)
    (define-key evil-motion-state-map (kbd "TAB") nil))
  ;; Setting RETURN key in org-mode to follow links
  (setq org-return-follows-link  t)

#+end_src
*** Evil Collection

[[https://github.com/emacs-evil/evil-collection][Evil-Collection]] adds ~Evil~ support for a bunch of package and modes that don't work well with ~Evil~ by default.
If you want to enable all default modes supported by ~Evil-Collection~, simply run =evil-collection-init=.
You can however specify a list of modes to enable first by modifying the =evil-collection-mode-list= Variable.
Look at the GitHub Source Repo for more info.
#+begin_src emacs-lisp
  ;; Enable Evil in more Modes
  (use-package evil-collection
    :after evil
    :config
    ;; Do not uncomment this unless you want to specify each and every mode
    ;; that evil-collection should works with.  The following line is here
    ;; for documentation purposes in case you need it.
    ;; (setq evil-collection-mode-list '(calendar dashboard dired ediff info magit ibuffer))
    (add-to-list 'evil-collection-mode-list 'help) ;; evilify help mode
    (evil-collection-init))

#+end_src
*** Evil Escape

[[https://github.com/syl20bnr/evil-escape][Evil-Escape]]
#+begin_src emacs-lisp :tangle no
  (use-package evil-escape
    :config
    (setq evil-escape-unordered-key-sequence t)
    (setq-default evil-escape-key-sequence "jk")
    ;; (add-to-list evil-escape-enable-only-for-major-mode 'prog-mode)
    ;; (add-to list evil-escape-excluded-major-modes 'erc-mode)
    (setq-default evil-escape-delay 0.2))

#+end_src
*** Evil Tutor

[[https://github.com/syl20bnr/evil-tutor][Evil-Tutor]] brings the famous ~VimTutor~ to [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] and adapts it for ~Evil~
#+begin_src emacs-lisp
  ;; Bring the classic vimtutor to Emacs
  (use-package evil-tutor)

#+end_src
** General
[[https://github.com/noctuid/general.el][general.el]] is used for easy keybinding configuration that integrates well with =which-key=.
*** Standard Emacs Version
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/general_standard_config.el :mkdirp yes
:END:
This version specifies =C-.= as ~leader key~
#+begin_src emacs-lisp
  ;; Setup general for easier key config
  (use-package general
    :config
    (general-create-definer pet/leader-keys
     :states '(normal insert visual emacs)
     :prefix "C-." ;; leader key
     :global-prefix "C-.") ;; access leader in insert mode
    )

#+end_src
*** Evil Version
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/general_evil_config.el :mkdirp yes
:END:

This version specifies =SPC= instead of =C-.= as ~leader key~
#+begin_src emacs-lisp
  ;; Setup general for easier key config
  (use-package general
    :config
    ;; Enable evil mode integration
    (general-evil-setup)

    (general-create-definer pet/leader-keys
      :states '(normal insert visual emacs)
      :prefix "SPC" ;; leader key
      :global-prefix "M-SPC") ;; access leader in insert mode

    ;; `kj` to get to normal mode
    (general-imap "k"
      (general-key-dispatch 'self-insert-command
        :timeout 0.25
        "j" 'evil-normal-state))
    ;; `jk` to get to normal mode
    (general-imap "j"
      (general-key-dispatch 'self-insert-command
        :timeout 0.25
        "k" 'evil-normal-state))

    (pet/leader-keys
      ;; Toggles - Modes
      "tmvi"   '(evil-mode :which-key "Evil Mode")))

#+end_src
