000_OrgFiles/EmacsConfig.org
*** Leader Keys
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/general_leader_keys.el :mkdirp yes
:END:

#+begin_src emacs-lisp
  ;; Set Leader Keys
  (pet/leader-keys

    ;; Layouts
    "l"     '(:ignore t :which-key "Layout")
    "lw"    '(winner-undo :which-key "Winner Undo")


    ;; Authentication
    "a"     '(:ignore t :which-key "Authentification")


    ;; Bookmarks
    "b"     '(:ignore t :which-key "Bookmarks")
    "bs"    '(bookmark-set :which-key "Set Bookmark")
    "bl"    '(bookmark-bmenu-list :which-key "Bookmark List")
    "bt"    '(pet/current-tab-name :which-key "Current Tab Name")
    "bw"    '(webjump :which-key "Webjump to bookmark")

    ;; Calculator
    "c"   '(calc :which-key "Calculator")

    ;; Editing Tools
    "e"     '(:ignore t :which-key "Editing Tools")
    "ea"    'add-file-local-variable-prop-line
    ;; Letters
    "el"    '(:ignore t :which-key "Letters")
    "elM-u" 'upcase-initials
    "elC-uM-u" 'upcase-initials-region
    ;; Tabs
    "et"    '(untabify
      		:which-key "Untabify")
    "er"    '(regexp-builder
      		:which-key "Regexp Builder")


    ;; Files
    "f"     '(:ignore t :which-key "Files")
    "fR"    'recentf-open-files


    ;; Org Mode related
    "o"     '(:ignore t :which-key "Org Mode")


    ;; Toggles
    "t"     '(:ignore t :which-key "Toggles")
    "tc"    'world-clock
    "tt"    '(counsel-load-theme
      		:which-key "Choose Theme")
    ;; Toggles - Highlighting
    "th"    '(:ignore t :which-key "Highlighting")
    ;; Toggles - Highlighting - Colors
    "thc"   '(:ignore t :which-key "Colors")
    "thcr"  '(pet/syntax-color-rgb
      		:which-key "RGB")
    "thch"  '(pet/syntax-color-hsv
      		:which-key "HSV")
    ;; Toggles - Language Server
    "tl"    '(:ignore t :which-key "LSP")
    "tls"   '(eglot :which-key "Start LSP with Eglot")
    ;; Toggles - Modes
    "tm"    '(:ignore t :which-key "Modes")
    "tmv"   '(:ignore t :which-key "Modes with v..")
    "tmvl"  '(visual-line-mode :which-key "Visual Line Mode")
    "tmh"   '(hl-line-mode :which-key "Highlight Line Mode")
    "tmw"   '(whitespace-mode :which-key "Whitspace Mode")
    "tmu"   '(undo-tree-mode :which-key "Undo-Tree Mode")
    "tmo"   '(org-mode :which-key "Org Mode")
    "tmf"   '(origami-mode :which-key "Origami Mode")
    "tmf"   '(follow-mode :which-key "Follow Mode")
    "tme"   '(emojify-mode :which-key "Emojify Mode")
    "tms"   '(scroll-all-mode :which-key "Scroll All Mode")

    ;; Tools
    "T"       '(:ignore t :which-key "Tools")

    ;; Tools - Dictionary
    "Td"      '(:ignore t :which-key "Dictionary")
    "Tdd"     '(dictionary :which-key "Open Dictionary")
    "Tdl"     '(dictionary-lookup-definition :which-key "Lookup Definition")
    "Tdm"     '(dictionary-match-words :which-key "Match Words")
    "Tds"     '(dictionary-search :which-key "Search Dictionary"))

#+end_src
*** Elisp Leader Keys
#+begin_src emacs-lisp
  (pet/leader-keys
	"E"   '(:ignore t :which-key "eval")
	"Eb"  '(eval-buffer :which-key "eval buffer"))

  (pet/leader-keys
	:keymaps '(visual)
	"Er" '(eval-region :which-key "eval region"))

#+end_src
** Which Key
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/which_key_config.el :mkdirp yes
:END:

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.
#+begin_src emacs-lisp
  ;; Load which-key
  ;; Loads a more helpful UI Completion buffer
  (use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1
        which-key-side-window-location 'bottom  ;; Bottom is default
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        ;; which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit t
        which-key-separator " →  "))

#+end_src
* File Management
** Dired Extensions
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/dired_extensions_config.el :mkdirp yes
:END:
*** Dired Open

=dired-open= is part of [[https://github.com/Fuco1/dired-hacks][Dired Hacks]]. Enables opening files with external apps directly.
#+begin_src emacs-lisp
  ;; Use dired-open to launch external apps
  (use-package dired-open)
  ;; open .png files in 'sxiv' and .mp4 files to open in 'mpv'
  ;; open .pdf in 'zahtura'
  (setq dired-open-extensions '(("gif" . "sxiv")
				("jpg" . "sxiv")
				("png" . "sxiv")
				("svg" . "sxiv")
				("mkv" . "mpv")
				("mp4" . "mpv")
				;; ("pdf" . "zathura") not needed with pdf-tools
				))

#+end_src
*** Dired Filter

=dired-filter= is part of [[https://github.com/Fuco1/dired-hacks][Dired Hacks]]. Add Filters to [[id:459e7903-23b0-4716-a08c-6a4b8f80f2db][Dired]] Buffer.
#+begin_src emacs-lisp
  ;; Add Filters by file extension to dired buffer
  (use-package dired-filter)

#+end_src
*** Dired Preview

[[https://github.com/protesilaos/dired-preview][Dired-Preview]] is a minor mode that adds a preview window to ~Dired~.
It overs the same functionality as [[https://github.com/asok/peep-dired][Peep-Dired]], which is now an archived Project.
#+begin_src emacs-lisp
  ;; Add a Preview Window to Dired
  (use-package dired-preview
    :after dired
    :hook (evil-normalize-keymaps . dired-preview-hook)
    :config
    ;; Enable `dired-preview-mode' in globally:
    (dired-preview-global-mode 1)
    (setq dired-preview-delay 0.8)
    (setq dired-preview-max-size (expt 2 20))
    (setq dired-preview-ignored-extensions-regexp  ;; Show no preview for certain file types
          (concat "\\."
                  "\\(mkv\\|webm\\|mp4\\|mp3\\|ogg\\|m4a"
                  "\\|gz\\|zst\\|tar\\|xz\\|rar\\|zip"
                  "\\|iso\\|epub\\|pdf\\)"))
    (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
    (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
    )

#+end_src
** Ranger
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/ranger_config.el :mkdirp yes
:END:

[[https://github.com/ralesi/ranger.el][Ranger]] is a feature rich substitution for dired.
It is inspired by the the VIM plugin ranger.
#+begin_src emacs-lisp
  ;; Add Ranger Directory Explorer
  (use-package ranger
    :config
    ;; I don't want ranger to be the default
    (setq ranger-override-dired-mode nil)
    ;; Enable Image preview
    (setq ranger-show-literal nil)
    ;; Set Max Preview Size to 50MB
    ;; !!careful, this can really slow down your machine!!
    (setq ranger-max-preview-size 50)
    ;; Don't preview video/audio files
    (setq ranger-excluded-extensions ' ("mkv" "iso" "mp4" "mp3"))
    (pet/leader-keys
      "tmr"  '(ranger-mode :which-key "Ranger Mode")))

#+end_src
