C01_EmacsConfiguration/.emacs.d/init.el
      "E"   '(:ignore t :which-key "eval")
      "Eb"  '(eval-buffer :which-key "eval buffer"))

(pet/leader-keys
      :keymaps '(visual)
      "Er" '(eval-region :which-key "eval region"))
