000_OrgFiles/EmacsConfig.org
** PDF Tools
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/pdf_tools_config.el :mkdirp yes
:END:

Added [[https://github.com/vedang/pdf-tools][PDF Tools]] to replace ~DocView~.
There's also a [[https://pdftools.wiki/][wiki]] for it.
#+begin_src emacs-lisp
  ;; Load PDF Tools to replace DocView
  (use-package pdf-tools
    :straight nil  ;; loaded with guix package manage
    :defer t
    :commands (pdf-loader-install)
    :mode "\\.pdf\\'"
    :bind (:map pdf-view-mode-map
                ("j" . pdf-view-next-line-or-next-page)
                ("k" . pdf-view-previous-line-or-previous-page))
    :init
    ;; Install PDF Tools in all buffers
    (pdf-loader-install)
    :config (add-to-list 'revert-without-query ".pdf")

    ;; Disable linum mode in PDF Tools
    (add-hook 'pdf-view-mode-hook #'(lambda () (interactive) (display-line-numbers-mode -1)))
    (pet/leader-keys
      ;; Toggles - Modes
      "tmp"   '(pdf-view-mode :which-key "PDF View Mode")))

  ;; Enable bookmarking in pdf-view buffers
  (use-package saveplace-pdf-view
    :after pdf-tools
    :config
    (save-place-mode 1))

#+end_src
** Openwith
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/openwith_config.el :mkdirp yes
:END:

[[https://www.metalevel.at/misc/openwith.el][Openwith]] is a small package that opens ~external programs~ based on file extensions
#+begin_src emacs-lisp
  ;; Add Openwidth to use more sensible programs for certain file
  (use-package openwith
    :config
    (setq openwith-associations
          (list
           (list (openwith-make-extension-regexp
                  '("mpg" "mpeg" "mp3" "mp4"
                    "avi" "wmv" "wav" "mov" "flv"
                    "ogm" "ogg" "mkv"))
                 "mpv"
                 '(file))

           (list (openwith-make-extension-regexp
                  '("doc" "xls" "ppt" "odt" "ods" "odg" "odp"))
                 "libreoffice"
                 '(file))

           '("\\.lyx" "lyx" (file))

           '("\\.chm" "kchmviewer" (file))

           (list (openwith-make-extension-regexp
                  '("ps" "ps.gz" "dvi"))
                 "okular"
                 '(file))

           (list (openwith-make-extension-regexp
                  '("kdenlive"))
                 "kdenlive-accel"
                 '(file))

           (list (openwith-make-extension-regexp
                  '("kra"))
                 "krita"
                 '(file))

           (list (openwith-make-extension-regexp
                  '("blend" "blend1"))
                 "blender"
                 '(file))

           (list (openwith-make-extension-regexp
                  '("helio"))
                 "helio"
                 '(file))

           (list (openwith-make-extension-regexp
                  '("svg"))
                 "inkscape"
                 '(file))

           (list (openwith-make-extension-regexp
                  '("flp"))
                 "~/.local/bin/flstudio"
                 '(file))
           ))
    (setq openwith-confirm-invocation t)  ;; Avoid starting other processes by accident
    ;; Activate openwidth mode
    (openwith-mode 1))

#+end_src
* Quality of Live Extensions
** Collection of QoL Extensions
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/qol_collection_config.el :mkdirp yes
:END:
*** Executable Path Setup
~Exec Path from Shell~ is an [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] [[id:1c44cf3c-6549-4e70-a3fd-491df7996dd5][Package]] that reads [[id:eb3164fe-2397-446a-8953-22356f3408db][Environment Variables]] from ~Bash~ or ~ZSH~.
Information can be found here: [[https://github.com/purcell/exec-path-from-shell][GitHub.com: Purcell - Exec Path from Shell]]
#+begin_src emacs-lisp
  ;; Package to setup Path Variable (and more) in Emacs
  (use-package exec-path-from-shell
    :config
    ;; Load binary directories like =.cargo/bin/= and =.local/bin= on Linux and OS X
    (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

  ;; ;; Read Path from Shell Setup when Emacs Server is launched through SystemD
  ;; (when (daemonp)
  ;;   (exec-path-from-shell-initialize))

  ;; Copy values of other Environment Variables
  ;; (dolist (var '("SSH_AUTH_SOCK" "SSH_AGENT_PID" "GPG_AGENT_INFO" "LANG" "LC_CTYPE" "NIX_SSL_CERT_FILE" "NIX_PATH"))
  ;;   (add-to-list 'exec-path-from-shell-variables var))

#+end_src
*** Easier Commenting

If you want to make ~commenting~ easier, the following package is very helpful. Despite the name, it is not only restricted to =evil-mode=
#+begin_src emacs-lisp
  ;; Easier Commenting, not just for evil-mode
  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))

#+end_src
*** Short Man Pages

The [[https://github.com/tldr-pages/tldr][tldr-pages]] project is a collection of community-maintained help pages for command-line tools, that aims to be a simpler, more approachable complement to traditional ~man pages~.
[[https://github.com/kuanyui/tldr.el][TLDR.el]] is a package that adds these packages to [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]
#+begin_src emacs-lisp
  ;; Add TLDR Version of Man Pageship
  (use-package tldr)

#+end_src
*** Helpful Help Commands

[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful (get it?) information to Emacs' =describe-= command buffers.  For example, if you use =describe-function=, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] configuration. It is very useful for figuring out how things work in [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]].
#+begin_src emacs-lisp
  ;; Use Helpful to get a better help buffer
  (use-package helpful
    :custom
    (counsel-describe-function-function
     #'helpful-callable)
    (counsel-describe-variable-function
     #'helpful-variable)
    :bind
    ([remap describe-function] . helpful-function)
    ([remap describe-symbol] . helpful-symbol)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-key] . helpful-key))

#+end_src
*** Drag Stuff

[[https://github.com/rejeep/drag-stuff.el][Drag Stuff]] is a ~minor mode~ for [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] that makes it possible to drag stuff (words, region, lines) around in Emacs.  When ‘drag-stuff-define-keys’ is enabled, then the following keybindings are set: =M-up=, =M-down=, =M-left=, and =M-right=.
#+begin_src emacs-lisp
  ;; Add Drag Stuff Mode
  (use-package drag-stuff
    :init
    ;(drag-stuff-global-mode 1)  ;; deactivated global variant since it gets a bit annoying in org mode
    (drag-stuff-define-keys)
    (evil-define-key 'visual drag-stuff-mode-map (kbd "K") 'drag-stuff-up)
    (evil-define-key 'visual drag-stuff-mode-map (kbd "J") 'drag-stuff-down)
    (evil-define-key 'visual drag-stuff-mode-map (kbd "H") 'drag-stuff-left)
    (evil-define-key 'visual drag-stuff-mode-map (kbd "L") 'drag-stuff-right)

    (pet/leader-keys
  	"tmd" '(drag-stuff-mode :wk "Drag Stuff Mode")))

#+end_src
*** Sudo-Edit

[[https://github.com/nflath/sudo-edit][sudo-edit]] gives us the ability to open files with sudo privileges or switch over to editing with sudo privileges if we initially opened the file without such privileges.
#+begin_src emacs-lisp :tangle no
  ;; Easily go into sudo mode
  (use-package sudo-edit)

#+end_src
** Multiple Cursors
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/multiple_cursors_config.el :mkdirp yes
:END:

~Multiple Cursors~ are a part of most *modern editors*.
Obviously [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] has a package for that too:
#+begin_src emacs-lisp
  ;; Multiple cusors are a must. Make <return> insert a newline; multiple-cursors-mode can still be disabled with C-g.
  (use-package multiple-cursors
    :config
    (setq mc/always-run-for-all 1)
    (global-set-key (kbd "C-S-c C-S-c")
                    'mc/edit-lines)
    (global-set-key (kbd "C-<")
                    'mc/mark-previous-like-this)
    (global-set-key (kbd "C->")
                    'mc/mark-next-like-this)
    (global-set-key (kbd "C-c M-<")
                    'mc/mark-all-like-this)
    (global-set-key (kbd "s-D")
                    'mc/mark-all-dwim)
    (define-key mc/keymap (kbd
                           "<return>") nil))

#+end_src
** Undo-Tree
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/undo_tree_config.el :mkdirp yes
:END:

[[https://gitlab.com/tsc25/undo-tree][Undo-Tree]] is a minor mode that massively enhances the handling of undo/redo in [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]
#+begin_src emacs-lisp
  ;; Level up Emacs Undo/Redo
  (use-package undo-tree
    :config
    (global-undo-tree-mode)
    (setq undo-tree-history-directory-alist `(("." . ,(concat pet/dotfiles-emacsconfig-dir "undo-tree/")))))

#+end_src
