000_OrgFiles/EmacsConfig.org
** Projectile
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/projectile_config.el :mkdirp yes
:END:
[[https://projectile.mx/][Projectile]] is a project management library for [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] which makes it a lot easier to navigate around code projects for various languages.
Many packages integrate with Projectile so it's a good idea to have it installed even if you don't use its commands directly.
It should be noted that many projectile commands seem to not work if you have set =“fish”= as the =“shell-file-name”= for [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]].

#+begin_src emacs-lisp
  ;; Use Projectile for project management
  (use-package projectile
    :diminish projectile-mode
    :demand t
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/Projects/Programming")
      (setq projectile-project-search-path
            '("~/Projects/Programming")))
    (setq projectile-switch-project-action
          #'projectile-dired)

    ;; Activate Projectile
    (projectile-mode)
    ;; Setup default keybinding for projectile
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :config
    ;; Specify a list of directories and files to ignore by projectile grep
    ;; Can interpret regular expressions
    (cl-loop for file in
             '()
             do
             (add-to-list 'projectile-globally-ignored-files file))
    (cl-loop for directory in
             '("backup")
             do
             (add-to-list 'projectile-globally-ignored-directories directory))

    ;; Add Projectile Functions to User Leader Keys
    (pet/leader-keys
      "p"  '(:ignore t :which-key "projects")
      ;; "pF"  'consult-ripgrep
      "pc"  'projectile-compile-project
      "pd"  'projectile-dired))

#+end_src
** YASnippets
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/yasnippets_config.el :mkdirp yes
:END:
*** Load Yasnippets

Load ~package~ =yasnippets= (should already come preinstalled, invocation is just to do the configuration).
[[id:296fc3bb-8f64-4615-a8ad-fadb207ee770][Yasnippets]] are an ~extension/improvement~ over the basic [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] ~Skeletons~
Documentation can be found here: [[https://github.com/joaotavora/yasnippet][GitHub.com: Yasnippet]]
#+begin_src emacs-lisp
  ;; Yasnippets
  (use-package yasnippet
    :init
    ;; save Yasnippet dir
    (setq pet/yasnippet-dir
          (concat pet/dotfiles-emacsconfig-dir
                  "snippets"))

    :config
    ;; Set Yasnippet dir
    (setq yas-snippet-dirs '(pet/yasnippet-dir))

    ;; Activate Yasnippets globally
    (yas-global-mode 1)

    ;; Allow Stacked Expansion (Expansion within Expansion)
    ;; (setq yas-triggers-in-field t)

    ;; Enable snippets being shared between modes
    (add-hook 'yas-minor-mode-hook
              (lambda ()
                (yas-activate-extra-mode
                 'fundamental-mode))))

#+end_src
*** Yasnippet Snippets
#+begin_src emacs-lisp
  ;; Add some predefined snippets
  (use-package yasnippet-snippets
    :defer)

#+end_src
* Graphical User Interface Tweaks and Extensions
** All The Icons
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/all_the_icons_config.el :mkdirp yes
:END:

[[https://github.com/domtronn/all-the-icons.el][All-The-Icons]]
:NOTE:
The *first time* you load your configuration on a *new machine*, you'll need to run =M-x all-the-icons-install-font= so that mode line icons display correctly.
:END:
#+begin_src emacs-lisp
  ;; Use all-the-icons
  ;; required for doom modeline
  (use-package all-the-icons
    :if (display-graphic-p))

  ;; Adds icons to files and directories in dired
  (use-package all-the-icons-dired
    :hook
    (dired-mode . all-the-icons-dired-mode))

#+end_src
** Modelines
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/modeline_config.el :mkdirp yes
:END:
*** Doom Modeline

[[https://github.com/seagle0128/doom-modeline][doom-modeline]] is a very attractive and rich (yet still minimal) mode line configuration for [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]].  The default configuration is quite good but you can check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

#+begin_src emacs-lisp
  ;; Load doom modeline
  (use-package doom-modeline
    :after (all-the-icons)
    ;; Activate Doom Modeline
    :init (doom-modeline-mode 1)
    :config
    (setq doom-modeline-height 35                   ;; sets modeline height
          doom-modeline-bar-width 5                 ;; sets right bar width
          doom-modeline-persp-name t                ;; adds perspective name to modeline
          doom-modeline-window-width-limit nil
          doom-modeline-buffer-file-name-style 'truncate-with-project
          doom-modeline-minor-modes nil             ;; don’t try to display minor mode names
          doom-modeline-enable-word-count t         ;; display word count
          doom-modeline-buffer-encoding t           ;; show encoding for current buffer
          doom-modeline-buffer-modification-icon t  ;; indicate modification
          doom-modeline-env-python-executable "python"
          ;; needs display-time-mode to be one
          doom-modeline-time t
          doom-modeline-vcs-max-length 12           ;; length of VCS branch name displayed - default 12
          doom-modeline-persp-icon t))              ;; adds folder icon next to persp name

#+end_src
*** Telephone-Line

[[https://github.com/dbordak/telephone-line][Telephone-Line]] is an alternative Modeline inspired by ~Powerline~
#+begin_src emacs-lisp :tangle no
  ;; Load Telephone-Line
  (use-package telephone-line
    :init (telephone-line-mode 1))

#+end_src
** Themes
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/themes_config.el :mkdirp yes
:END:
*** Doom Themes

[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] is a great set of themes with a lot of variety and support for many different Emacs modes.  Taking a look at the [[https://github.com/hlissner/emacs-doom-themes/tree/screenshots][screenshots]] might help you decide which one you like best.  You can also run =M-x counsel-load-theme= to choose between them easily.
#+begin_src emacs-lisp
    ;; Load Doom Themes
    (use-package doom-themes
    	:init (load-theme 'doom-dracula t)
    	:config
    	(setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
    		  doom-themes-enable-italic t) ; if nil, italics is universally disabled
    	;; Enable custom neotree theme (all-the-icons must be installed!)
    	(doom-themes-neotree-config)
    	;; Corrects (and improves) org-mode's native fontification.
    	(doom-themes-org-config)
  	(doom-themes-visual-bell-config))

#+end_src
** Perspective
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/perspective_config.el :mkdirp yes
:END:

[[https://github.com/nex3/perspective-el][Perspective]] allows you to safe a specific window layout even across sessions
#+begin_src emacs-lisp
  ;; Add Perspective to use sets of
  (use-package perspective
    :demand t
    ;; Setup Keybindings
    ;; :bind (("C-M-k" . persp-switch)
    ;; 	   ("C-M-n" . persp-next)
    ;; 	   ("C-x k" . persp-kill-buffer*))
    :init
    (persp-mode)
    :custom
    ;; Start Perspective Mode
    (persp-mode-prefix-key (kbd "C-c M-p"))
    (persp-initial-frame-name "Main")
    ;; Set default file for states
    (persp-state-default-file
     (concat pet/dotfiles-emacsconfig-dir
               "perspective/default-state"))
    :config
    ;; Running `persp-mode' multiple times resets the perspective list...
    (unless (equal persp-mode t)
        (persp-mode))

    ;; Automatically save perspective states to file when Emacs exits.
    (add-hook 'kill-emacs-hook #'persp-state-save)


    ;; Add Perspective Functions to User Leader Keys
    (pet/leader-keys
    	"P"  '(:ignore t :which-key "Perspectives")
    	"Pn"  'persp-next
    	"Ps"  'persp-switch-to-buffer*
    	"Pk"  'persp-kill-buffer*))

#+end_src
** Dashboard
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/dashboard_config.el :mkdirp yes
:END:
*** Helper Functions

These functions were taken from:
[[https://github.com/gopar/.emacs.d][GitHub.com: Gopar - Emacs.d]]
The [[id:8fb7b917-debe-4d37-a726-4b45f93b913c][Ledger Catgories]] are specified [[file:~/.dotfiles-private/000_OrgFiles/EmacsPrivateVariables.org::*Ledger Variables][here]].
#+begin_src emacs-lisp
  ;; Function to insert vocabulary
  (defun pet/dashboard-insert-vocabulary (list-size)
    (dashboard-insert-heading "Word of the Day:"
  							nil
  							(all-the-icons-faicon "newspaper-o"
  												  :height 1.2
  												  :v-adjust 0.0
  												  :face 'dashboard-heading))
    (insert "\n")
    (let ((random-line nil)
  		(lines nil))
  	(with-temp-buffer
  	  (insert-file-contents (concat user-emacs-directory "words"))
  	  (goto-char (point-min))
  	  (setq lines (split-string (buffer-string) "\n" t))
  	  (setq random-line (nth (random (length lines)) lines))
  	  (setq random-line (string-join (split-string random-line) " ")))
  	(insert "    " random-line)))

  ;; Function to insert ledger bal
  (defun pet/dashboard-ledger-monthly-balances (list-size)
    "Return the monthly balance by using ledger"
    (interactive)
    (dashboard-insert-heading "Monthly Balance:"
  							nil
  							(all-the-icons-faicon "money"
  												  :height 1.2
  												  :v-adjust 0.0
  												  :face 'dashboard-heading))
    (insert "\n")
    (let* ((current-month (format-time-string "%Y/%m"))
  		 (cmd (format "ledger bal --flat --monthly --period %s %s "
  					  current-month
  					  (mapconcat 'identity pet/ledger-categories " "))))
  	(insert (shell-command-to-string cmd))))

#+end_src
