C01_EmacsConfiguration/.emacs.d/package_configs/dashboard_config.el
;; Function to insert vocabulary
(defun pet/dashboard-insert-vocabulary (list-size)
  (dashboard-insert-heading "Word of the Day:"
  						      nil
  						      (all-the-icons-faicon "newspaper-o"
  												:height 1.2
  												:v-adjust 0.0
  												:face 'dashboard-heading))
  (insert "\n")
  (let ((random-line nil)
  	      (lines nil))
      (with-temp-buffer
  	(insert-file-contents (concat user-emacs-directory "words"))
  	(goto-char (point-min))
  	(setq lines (split-string (buffer-string) "\n" t))
  	(setq random-line (nth (random (length lines)) lines))
  	(setq random-line (string-join (split-string random-line) " ")))
      (insert "    " random-line)))

;; Function to insert ledger bal
(defun pet/dashboard-ledger-monthly-balances (list-size)
  "Return the monthly balance by using ledger"
  (interactive)
  (dashboard-insert-heading "Monthly Balance:"
  						      nil
  						      (all-the-icons-faicon "money"
  												:height 1.2
  												:v-adjust 0.0
  												:face 'dashboard-heading))
  (insert "\n")
  (let* ((current-month (format-time-string "%Y/%m"))
  	       (cmd (format "ledger bal --flat --monthly --period %s %s "
  					current-month
  					(mapconcat 'identity pet/ledger-categories " "))))
      (insert (shell-command-to-string cmd))))
