000_OrgFiles/EmacsConfig.org
*** Load Dashboard

[[https://github.com/emacs-dashboard/emacs-dashboard][Emacs Dashboard]] adds a start up screen to [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Index Emacs]]
#+begin_src emacs-lisp
  ;; Add Dashboard to Emacs
  (use-package dashboard
    :after (all-the-icons)
    :init      ;; tweak dashboard config before loading it
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-navigator t)
    (setq dashboard-week-agenda nil)
    (setq dashboard-set-file-icons t)
    (setq dashboard-icon-type 'all-the-icons)  ;; Default is nerd-icons
    (setq dashboard-banner-logo-title "Surveillance creates a prison in the mind")
    ;; use standard emacs logo as banner
    (setq dashboard-startup-banner 'logo)
    ;; Set custom banner
    ;; (setq dashboard-startup-banner "~/.emacs.d/emacs-dash.png")
    (setq dashboard-center-content t) ;; set to 'nil' for uncentered content
    (setq dashboard-show-shortcuts t)  ;; show shortcuts
    (setq dashboard-projects-backend 'projectile)  ;; default ’projectile’
    ;; (dashboard-agenda-sort-strategy '(priority-down))
    (setq dashboard-items '((recents . 5)
                            (agenda . 5 )
                            (bookmarks . 3)
                            (projects . 3)
  						  (registers . 3)
  						  ;; (vocabulary)  ;; Needs vocabulary file
  						  (monthly-balance)))
    (setq dashboard-item-generators '((monthly-balance . pet/dashboard-ledger-monthly-balances)
  									(vocabulary . pet/dashboard-insert-vocabulary)
  									(recents . dashboard-insert-recents)
  									(bookmarks . dashboard-insert-bookmarks)
  									(projects . dashboard-insert-projects)
  									(agenda . dashboard-insert-agenda)
  									(registers . dashboard-insert-registers)))
    :config
    (dashboard-setup-startup-hook)
    (dashboard-modify-heading-icons '((recents . "file-text")
                                      (bookmarks . "book")))
    ;; Make Emacsclient start up into dashboard
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*"))))

#+end_src
** Ivy with Counsel and Prescient
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/ivy_config.el :mkdirp yes
:END:
*** Description
[[https://oremacs.com/swiper/][Ivy]] is an excellent completion framework for Emacs.  It provides a minimal yet powerful selection menu that appears when you open files, switch buffers, and for many other tasks in Emacs.

~Counsel~ is a customized set of commands to replace =find-file= with =counsel-find-file=, etc which provide useful commands for each of the default completion commands.

[[https://github.com/Yevgnen/ivy-rich][ivy-rich]] adds extra columns to a few of the Counsel commands to provide more information about each item.
*** Ivy
#+begin_src emacs-lisp
  ;; Load Ivy Completion Framework
  (use-package ivy
    :diminish
    :custom
    (setq ivy-use-virtual-buffers t)
    (setq ivy-count-format "(%d/%d) ")
    (setq enable-recursive-minibuffers t)
    :bind (("C-s" . swiper)
             ("C-r" . swiper)
             :map ivy-minibuffer-map
             ("TAB" . ivy-alt-done)
             ("C-l" . ivy-alt-done)
             ("C-j" . ivy-next-line)
             ("C-k" . ivy-previous-line)
             ("C-RET" . ivy-immediate-done)
             :map ivy-switch-buffer-map
             ("C-k" . ivy-previous-line)
             ("C-l" . ivy-done)
             ("C-d" . ivy-switch-buffer-kill)
             :map ivy-reverse-i-search-map
             ("C-k" . ivy-previous-line)
             ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

#+end_src
*** Counsel
#+begin_src emacs-lisp
  ;; Add Counsel for customized find files etc..
  (use-package counsel
    :after ivy
    :diminish
    :bind (("C-M-j" . 'counsel-switch-buffer)
             :map minibuffer-local-map
             ("C-r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode 1)
    (setq ivy-initial-inputs-alist nil) ;; removes starting ^ regex in M-x

    ;; Add Counsel function to leader key space
    (pet/leader-keys
    	"r"   '(ivy-resume :which-key "ivy resume")

    	"ff"  '(counsel-find-file :which-key "open file")
    	"C-f" 'counsel-find-file
    	"fr"  '(counsel-recentf :which-key "recent files")
    	"fR"  '(revert-buffer :which-key "revert file")
    	"fj"  '(counsel-file-jump :which-key "jump to file")
    	"pf"  'counsel-projectile-find-file
    	"ps"  'counsel-projectile-switch-project
    	"pF"  'counsel-projectile-rg
    	"pp"  'counsel-projectile
    	"pd"  'projectile-dired))

#+end_src
*** Prescient

[[https://github.com/raxod502/prescient.el][Prescient]] makes [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] store your recent history when accessing menus (like =C-h= or =M-x=)
#+begin_src emacs-lisp
  ;; Add Prescient for spooky Emacs Memory (history)
  (use-package prescient
	:after counsel
	:config
	(prescient-persist-mode 1))

  ;; Enable Prescient in Ivy
  (use-package ivy-prescient
	:after prescient
	:config
	(ivy-prescient-mode 1))

#+end_src
*** Extensions
**** Ivy-Rich
#+begin_src emacs-lisp
  ;; Ivy-Rich: Add Descriptions alongside M-x commands
  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1)
    :custom
    (ivy-virtual-abbreviate 'full
                          ivy-rich-switch-buffer-align-virtual-buffer t
                          ivy-rich-path-style 'abbrev)
    :config
    (ivy-set-display-transformer 'ivy-switch-buffer
                                 'ivy-rich-switch-buffer-transformer))

#+end_src
**** All-The-Icons-Ivy-Rich
#+begin_src emacs-lisp
  ;; Add All-The-Icons to Ivy-Rich
  (use-package all-the-icons-ivy-rich
    :init (all-the-icons-ivy-rich-mode 1))

#+end_src
**** Counsel-Projectile
#+begin_src emacs-lisp
  ;; Projectile Counsel Integration
  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))

#+end_src
*** Ivy BibTex
Add ~Bibtex~ support to [[https://oremacs.com/swiper/][Ivy]] via [[https://github.com/tmalsburg/helm-bibtex][Ivy-BibTex]]
#+begin_src emacs-lisp
  ;; Add BibTex completion support to Ivy
  (use-package ivy-bibtex
  	:config
  	;; Set Bibtex Bibliography Files
  	(setq bibtex-completion-bibliography
  		  (list
  		   pet/main-bib
  		   ))

  	;; Set Bibtex Completion Library Path
  	(setq bibtex-completion-library-path
  		  (list
  		   pet/bibliography-dir
  		   ))

  	;; Set Bibtex Completion Notes Path
  	(setq bibtex-completion-notes-path
  		  "Projects/bibliography/notes/")

  	;; Add Keywords Field to Completion Serach
  	(setq bibtex-completion-additional-search-fields '(keywords))

  	;; ;; Bibtex Notes Completion Template
  	;; (setq bibtex-completion-notes-template-multiple-files
  	;; "* ${author-or-editor}, ${title}, ${journal}, (${year})  :${=type=}:  \n\nSee   [[cite\:${=key=}]]  \n")

  	;; Display Format for Completions
  	;; (setq bibtex-completion-display-formats
  	;;	  '((article       . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${journal:40}")
  	;;		(inbook        . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
  	;;		(incollection  . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
  	;;		(inproceedings . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
  	;;		(t             . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}")))

  	;;; Adjust automatic generation of bibtex key
  	;;(setq bibtex-autokey-year-length 4
  	;;	  bibtex-autokey-name-year-separator "-"
  	;;	  bibtex-autokey-year-title-separator "-"
  	;;	  bibtex-autokey-titleword-separator "-"
  	;;	  bibtex-autokey-titlewords 2
  	;;	  bibtex-autokey-titlewords-stretch 1
  	;;	  bibtex-autokey-titleword-length 5)

  	;; (setq bibtex-completion-pdf-open-function
  	;; 	  (lambda (fpath)
  	;; 		(call-process "open" nil 0 nil fpath))))

  	)

#+end_src
** Helm
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/helm_config.el :mkdirp yes
:END:
*** Load Helm

[[https://github.com/emacs-helm/helm/wiki][Helm]] is an alternative completion framework that is very modular and offers a bunch of extensions
#+begin_src emacs-lisp
  ;; Load Helm Completion
  (use-package helm
    :init
    (helm-mode 1))

#+end_src
*** Helm Extensions
**** Helm-mu

[[https://github.com/emacs-helm/helm-mu][Helm-Mu]] adds a ~Helm~ Frontend to ~Mu4e~
#+begin_src emacs-lisp
  ;; Add mu4e support to helm
  (use-package helm-mu)

#+end_src
** Hydra
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/hydra_config.el :mkdirp yes
:END:
*** Description

~Hydra~ is an [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] [[id:1c44cf3c-6549-4e70-a3fd-491df7996dd5][Package]] that helps with ~keybindings~ by enabling you to create *virtual namespaces* for *repeated commands*.

For example, imagine that you have bound =C-c j= and =C-c k= in your config and you want to call them in some (arbitrary) sequence. ~Hydra~ allows you to bind your functions in a way that pressing =C-c jjkk3j5k= is *equivalent to* pressing =C-c j C-c j C-c k C-c k M-3 C-c j M-5 C-c k=. *Any key other* than =j= or =k= *exits this state*.

- ~Colors~ have a special meaning with ~hydras~ (=:color= ~option~). See the list below:

  |----------+----------------------------|
  | Color    | Toggle                     |
  |----------+----------------------------|
  | red      |                            |
  | blue     | :exit t                    |
  | amaranth | :foreign-keys warn         |
  | teal     | :foreign-keys warn :exit t |
  | pink     | :foreign-keys run          |
  |----------+----------------------------|

- ~Hints~ are displayed next to the keys. If you add a ~Docstring~ you might want to disable that. Use =:hint nil= for that.

~Documentation~ can be found here: [[https://github.com/abo-abo/hydra][GitHub.com: Hydra]]
*** Loading Hydra Package
#+begin_src emacs-lisp
  ;; Load Hydra Package
  (use-package hydra
  	:config
  	;; Add leader key Menu
  	(pet/leader-keys
  	  "h" '(:ignore t :which-key "Hydras")))

#+end_src
