C01_EmacsConfiguration/.emacs.d/package_configs/hydra_config.el
;; Load Hydra Package
(use-package hydra
      :config
      ;; Add leader key Menu
      (pet/leader-keys
  	"h" '(:ignore t :which-key "Hydras")))
