000_OrgFiles/EmacsConfig.org
*** Hydra Definitions
**** Text Scale Hydra
#+begin_src emacs-lisp
  ;; Define Text Scale Hydra
  (defhydra hydra-text-scale (:timeout 4)
    "Scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("q" nil "finished" :exit t))

  (pet/leader-keys
    "hs" '(hydra-text-scale/body :which-key "Scale text"))

#+end_src
**** Buffer Menu Hydra
#+begin_src emacs-lisp
  ;; Hydra for Buffer Menu functions
  (defhydra hydra-buffer-menu (
                               :hint nil
                               :timeout 10
                               ;; :color pink
                               )
    "
  ^Mark^             ^Unmark^           ^Actions^          ^Search
  ^^^^^^^^-----------------------------------------------------------------
  _m_: mark          _u_: unmark        _x_: execute       _R_: re-isearch
  _s_: save          _U_: unmark up     _b_: bury          _I_: isearch
  _d_: delete        ^ ^                _g_: refresh       _O_: multi-occur
  _D_: delete up     ^ ^                _T_: files only: % -28`Buffer-menu-files-only
  _~_: modified
  "
    ("m" Buffer-menu-mark)
    ("u" Buffer-menu-unmark)
    ("U" Buffer-menu-backup-unmark)
    ("d" Buffer-menu-delete)
    ("D" Buffer-menu-delete-backwards)
    ("s" Buffer-menu-save)
    ("~" Buffer-menu-not-modified)
    ("x" Buffer-menu-execute)
    ("b" Buffer-menu-bury)
    ("g" revert-buffer)
    ("T" Buffer-menu-toggle-files-only)
    ("O" Buffer-menu-multi-occur :color blue)
    ("I" Buffer-menu-isearch-buffers :color blue)
    ("R" Buffer-menu-isearch-buffers-regexp :color blue)
    ("c" nil "cancel")
    ("v" Buffer-menu-select "select" :color blue)
    ("o" Buffer-menu-other-window "other-window" :color blue)
    ("q" quit-window "quit" :color blue))

  ;; Access Hydra in Buffer Menu with '.'
  (define-key Buffer-menu-mode-map "." 'hydra-buffer-menu/body)

#+end_src
**** Bookmark Menu Hydra
#+begin_src emacs-lisp
  ;; Bookmark Menu
  (defhydra hydra-bookmark-menu (
								 :color pink
										:hint nil
										:timeout 10)
	"

		^^^Mark^             ^Actions^            ^Search^            ^Annotations^         ^Open Bookmark
		^^^^^^^^-----------------------------------------------------------------------------------------------------
		_m_: mark         _x_: execute          _/_: isearch             _a_: show         _o_   on other window
		_u_: unmark       _r_: rename           _l_: locate              _A_: show all     _C-o_ switch other window
		_U_: unmark up    _R_: relocate bmk     _S_: show filenames      _e_: edit         _1_   on full window
		_d_: delete       _w_: write bmk list   _T_: hide filenames      ^ ^               _2_   on split vertical
		_D_: delete up    _i_: import bmk list  _t_: toggle filenames    ^ ^               _5_   on other frame
		"
	("m" bookmark-bmenu-mark)
	("u" bookmark-bmenu-unmark)
	("U" bookmark-bmenu-backup-unmark)
	("d" bookmark-bmenu-delete)
	("D" bookmark-bmenu-delete-backwards)
	("x" bookmark-bmenu-execute-deletions)
	("r" bookmark-bmenu-rename)
	("R" bookmark-bmenu-relocate)
	("w" bookmark-bmenu-save)                   ;; 'write' bookmark list
	("i" bookmark-bmenu-load)                   ;; 'import' bookmark list
	("/" bookmark-bmenu-search)
	("l" bookmark-bmenu-locate)
	("S" bookmark-bmenu-show-filenames)
	("T" bookmark-bmenu-hide-filenames)
	("t" bookmark-bmenu-toggle-filenames)
	("a" bookmark-bmenu-show-annotation)
	("A" bookmark-bmenu-show-all-annotations)
	("e" bookmark-bmenu-edit-annotation)
	("c" nil "cancel" :exit t)
	("s" bookmark-bmenu-select "select" :color blue)
	("o" bookmark-bmenu-other-window :color blue)
	("C-o" bookmark-bmenu-switch-window :color blue)
	("1" bookmark-bmenu-1-window :color blue)
	("2" bookmark-bmenu-2-window :color blue)
	("5" bookmark-bmenu-other-frame :color blue)
	("q" quit-window "quit bm list" :color blue))

  ;; Access Menu through '.' in Bookmark List
  (with-eval-after-load "bookmark"
	(define-key bookmark-bmenu-mode-map
				"." 'hydra-bookmark-menu/body))

#+end_src
**** Apropos Hydra
#+begin_src emacs-lisp
  ;; Apropos Hydra
  (defhydra hydra-apropos (
                           ;; :color blue
                           :hint nil)
    "
  ^Apropos
  ^^^^^^^^-----------------------
  _a_propos        _c_ommand
  _d_ocumentation  _l_ibrary
  _v_ariable       _u_ser-option
  ^ ^          valu_e_
  "
    ("a" apropos)
    ("d" apropos-documentation)
    ("v" apropos-variable)
    ("c" apropos-command)
    ("l" apropos-library)
    ("u" apropos-user-option)
    ("e" apropos-value))
  ;; Recommended binding:
  ;; (global-set-key (kbd "C-c h") 'hydra-apropos/body)

  ;; Add to Leader keys
  (pet/leader-keys
    "ha" '(hydra-apropos/body :which-key "Apropos"))

#+end_src
**** Window Management Hydra
***** Helper Functions
#+begin_src emacs-lisp
  ;; Window Management Helpers
  (require 'windmove)

  ;; Move Splitter left
  (defun pet/move-splitter-left (arg)
	"Move window splitter left."
	(interactive "p")
	(if (let ((windmove-wrap-around))
		  (windmove-find-other-window 'right))
		(shrink-window-horizontally arg)
	  (enlarge-window-horizontally arg)))

  ;; Move Splitter left
  (defun pet/move-splitter-right (arg)
	  "Move window splitter right."
	  (interactive "p")
	  (if (let ((windmove-wrap-around))
			(windmove-find-other-window 'right))
		  (enlarge-window-horizontally arg)
		(shrink-window-horizontally arg)))

   ;; Move Splitter Up
  (defun pet/move-splitter-up (arg)
	"Move window splitter up."
	(interactive "p")
	(if (let ((windmove-wrap-around))
		  (windmove-find-other-window 'up))
		(enlarge-window arg)
	  (shrink-window arg)))

  ;; Move Splitter Down
  (defun pet/move-splitter-down (arg)
	"Move window splitter down."
	(interactive "p")
	(if (let ((windmove-wrap-around))
		  (windmove-find-other-window 'up))
		(shrink-window arg)
	  (enlarge-window arg)))

#+end_src
***** Hydra Definition
#+begin_src emacs-lisp
  ;; Define Window Management Hydra
  (defhydra hydra-window (:hint nil)
	"
	  Movement^^        ^Split^         ^Switch^		^Resize^
	  ----------------------------------------------------------------
	  _M-<left>_  ←	_v_ertical    	_b_uffer		_<left>_  X←
	  _M-<down>_  ↓   	_x_ horizontal	_f_ind files	_<down>_  X↓
	  _M-<up>_    ↑   	_z_ undo      	_a_ce 1	    	_<up>_    X↑
	  _M-<right>_ →   	_Z_ reset      	_s_wap	     	_<right>_ X→
	  _F_ollow Mode    	_D_lt Other   	_S_ave	     max_i_mize
	  _SPC_ cancel	    _o_nly this   	_d_elete
	  "
	;; Movement
	("M-<left>"  windmove-left)
	("M-<down>"  windmove-down)
	("M-<up>"    windmove-up)
	("M-<right>" windmove-right)

	;; Resize
	("<left>"  pet/move-splitter-left)
	("<down>"  pet/move-splitter-down)
	("<right>" pet/move-splitter-right)
	("<up>"    pet/move-splitter-up)

	("b" list-buffers)
	("f" find-files)
	("F" follow-mode)
	("a" (lambda ()
		   (interactive)
		   (ace-window 1)
			   (add-hook 'ace-window-end-once-hook
						 'hydra-window/body))
	 )
	("v" (lambda ()
		   (interactive)
		   (split-window-right)
		   (windmove-right))
	 )
	("x" (lambda ()
		   (interactive)
		   (split-window-below)
		   (windmove-down))
	 )
	("s" (lambda ()
		   (interactive)
		   (ace-window 4)
		   (add-hook 'ace-window-end-once-hook
					 'hydra-window/body)))
	("S" save-buffer)
	("d" delete-window)
	("D" (lambda ()
		   (interactive)
		   (ace-window 16)
		   (add-hook 'ace-window-end-once-hook
					 'hydra-window/body))
	 )
	("o" delete-other-windows)
	("i" ace-maximize-window)
	("z" (progn
		   (winner-undo)
		   (setq this-command 'winner-undo))
	 )
	("Z" winner-redo)
	("SPC" nil)
	)

  ;; Add to Leader keys
  (pet/leader-keys
	"hw" '(hydra-window/body :which-key "Window Management")
	)

#+end_src
