000_OrgFiles/EmacsConfig.org
**** Multiple Cursors Hydra
#+begin_src emacs-lisp
  ;; hydra multiple cursors
  (defhydra hydra-multiple-cursors (:hint nil)
    "
       ^Up^            ^Down^             ^Other^
  --------------------------------------------------------
  [_p_]   Previous    [_n_]   Next    [_l_] Edit lines
  [_P_]   Skip        [_N_]   Skip    [_a_] Mark all
  [_M-p_] Unmark      [_M-n_] Unmark  [_r_] Mark by regexp
  ^ ^                 ^ ^             [_d_] Mark all defun
  ^ ^                 ^ ^             [_q_] Quit
  "
    ("l" mc/edit-lines :exit t)
    ("a" mc/mark-all-like-this :exit t)
    ("n" mc/mark-next-like-this)
    ("N" mc/skip-to-next-like-this)
    ("M-n" mc/unmark-next-like-this)
    ("p" mc/mark-previous-like-this)
    ("P" mc/skip-to-previous-like-this)
    ("M-p" mc/unmark-previous-like-this)
    ("r" mc/mark-all-in-region-regexp :exit t)
    ("d" mc/mark-all-like-this-in-defun :exit t)
    ("q" nil))

  ;; Add to Leader keys
  (pet/leader-keys
    "hm" '(hydra-multiple-cursors/body :which-key "Multiple Cursors"))

#+end_src
**** Editing Toggles Hydra
#+begin_src emacs-lisp
  ;; Editing Toggles
  (defhydra hydra-editing-visuals (
						  :color pink
								 :hint nil
								 )
	"
  ^Editing Visuals
  ^^^^^^-------------------------------------------------------------------------
  _a_ abbrev-mode:                         %`abbrev-mode
  _C_ display-fill-column-indicator-mode:  %`display-fill-column-indicator-mode
  _d_ debug-on-error:                      %`debug-on-error
  _f_ auto-fill-mode:                      %`auto-fill-function
  _F_ variable-pitch-mode
  _i_ toggle-input-method
  _n_ display-line-numbers-mode:           %`display-line-numbers-mode
  _M_ doom-modeline-mode:                  %`doom-modeline-mode
  _R_ read-only-mode
  _t_ truncate-lines:                      %`truncate-lines
  _T_ counsel-load-theme
  _v_ visual-line-mode:                    %`visual-line-mode
  _w_ whitespace-mode:                     %`whitespace-mode
  "
	("a" abbrev-mode)
	("C" display-fill-column-indicator-mode)
	("d" toggle-debug-on-error)
	("f" auto-fill-mode)
	("F" variable-pitch-mode)
	("i" toggle-input-method)
	("t" toggle-truncate-lines)
	("T" counsel-load-theme)
	("v" visual-line-mode)
	("n" display-line-numbers-mode)
	("M" doom-modeline-mode)
	("w" whitespace-mode)
	("R" read-only-mode)
	("q" nil "quit" :exit 1))

  ;; (global-set-key (kbd "C-c C-v") 'hydra-editing-toggles/body)

  ;; Add to Key Space
  (pet/leader-keys
	"eh" '(hydra-editing-visuals/body :which-key "Editing Visuals")
	"T"  '(hydra-editing-visuals/body :which-key "Toggle Hydra")
	"ht" '(hydra-editing-visuals/body :which-key "Editing Visuals"))

#+end_src
**** Global Org Mode Hydra
#+begin_src emacs-lisp :tangle no
  ;; Global Org Mode Functionaliy via Hydra
  (defhydra hydra-global-org-menu (
								   :hint nil
										 :color pink
										 :timeout 10
										 )
	"
		^Org Utilities

		^Timer^                ^Clock^              ^Capture
		^^^^^^-------------------------------------------------------------------------
		 _t_: Start         _w_: Clock-In          _c_: Capture
		 _s_: Stop          _o_: Clock-Out         _l_: Last Capture
		 _r_: Set           _j_: Clock-Goto        ^ ^
		 _p_: Print

		 _q_: Quit
		 "

	  ("t" org-timer-start)
	  ("s" org-timer-stop)
	  ;; This one requires you be in an orgmode doc, as it sets the timer for the header
	  ("r" org-timer-set-timer)
	  ;; output timer value to buffer
	  ("p" org-timer)
	  ;; used with (org-clock-persistence-insinuate) (setq org-clock-persist t)
	  ("w" (org-clock-in '(4)))
	  ;; you might also want (setq org-log-note-clock-out t)
	  ("o" org-clock-out)
	  ;; global visit the clocked task
	  ("j" org-clock-goto)
	  ;; Don't forget to define the captures you want http://orgmode.org/manual/Capture.html
	  ("c" org-capture)
	  ("l" org-capture-goto-last-stored)
	  ("q" nil)
	  )

  (pet/leader-keys
	"ou" '(hydra-global-org-menu/body :which-key "Org Global Utilities")
	"ho" '(hydra-global-org-menu/body :which-key "Org Global Hydra"))

#+end_src
**** EBDB Mode Hydra

DISABLED FOR NOW
#+begin_src emacs-lisp :tangle no
  ;; Hydra for Contact Management
  (defhydra hydra-ebdb-menu (
							 :hint nil
								   :color pink
								   )
	"
		^EBDB Utilities

		^Records^                ^Fields^              ^Capture
		^^^^^^-------------------------------------------------------------------------
		_c_  Create
		_C_  Ext Create
  "
	("c" ebdb-create-record)
	("C" ebdb-create-record-extended)
	(";" ebdb-edit-foo "Notes")
	("m" ebdb-mail "Mail")
	("M" ebdb-mail-each "Mail Each")
	("h" ebdb-info "Info Menu")
	("?" ebdb-help "Help")
	("e" ebdb-edit-field "Edit Field")
	("TAB" ebdb-next-field "Next Field")
	("^" ebdb-search-pop "Search Pop")
	("P" ebdb-prev-field "Prev Field")
	("s" ebdb-save-ebdb "Save Databases")
	("+-t" ebdb-search-tags "Search Tags")
	("+-m" ebdb-search-mail "Search Mail")
	("p" ebdb-prev-record "Prev Record")
	("n" ebdb-next-record "Next Record")
	("+-p" ebdb-search-phone "Search Phone")
	("d-c" ebdb-copy-records "Copy Records")
	("o" ebdb-omit-records "Omit Records")
	("d-m" ebdb-move-records "Move Records")
	("A" ebdb-mail-aliases "Mail Aliases")
	("b-c" ebdb-clone-buffer "Clone Buffer")
	("i" ebdb-insert-field "Insert Field")
	("RET" ebdb-record-action "Record Action")
	("b-r" ebdb-rename-buffer "Rename Buffer")
	("+-a" ebdb-search-address "Search Address")
	("!" ebdb-search-invert "Search Invert")
	("+-c" ebdb-search-modified "Search Modified")
	("d-r" ebdb-reload-database "Reload Database")
	("r" ebdb-reformat-records "Reformat Records")
	("I" ebdb-cite-records-ebdb "Cite Records")
	("d-d" ebdb-disable-database "Disable Database")
	("+-d" ebdb-search-duplicates "Search Duplicates")
	("w-m" ebdb-copy-mail-as-kill "Copy Mail as Kill")
	("#" ebdb-record-mark "Mark Record")
	("d-e" ebdb-customize-database "Customize Database")
	("C-#" ebdb-unmark-all-records "Unmark all Records")
	("+-x" ebdb-search-user-fields "Search User Fields")
	("+-C" ebdb-search-record-class "Search Record Class")
	("w-f" ebdb-copy-fields-as-kill "Copy Fields as Kill")
	("C-x n w" ebdb-display-all-records "Display all Records")
	("+ o" ebdb-search-organization "Search Organization")
	("E" ebdb-edit-field-customize "Edit Field Customize")
	("F" ebdb-format-these-records "Format These Records")
	("f" ebdb-format-to-tmp-buff "Format to Tmp Buffer")
	("/ 1" ebdb-search-single-record "Searc Single Record")
	("w r" ebdb-copy-records-as-kill "Copy Records as Kill")
	("t" ebdb-toggle-records-format "Toggle Records Format")
	("R" ebdb-create-record-and-role "Create Record and Role")
	("C-k" ebdb-delete-field-or-record "Delete Field or Record")
	("C-x n d" ebdb-display-current-record "Display Current Record")
	("M-#" ebdb-toggle-all-record-marks "Toggle all Record Marks")
	("c" ebdb-toggle-all-records-format "Toggle All Records Format")
	("q" "Quit Database")
	("SPC" "Exit" :exit t))

#+end_src
**** Mu4e Hydra
#+begin_src emacs-lisp
  ;; Mu4e Hydra
  (defhydra hydra-mu4e-headers (
								:color blue
									   :hint nil
									   )
	"
   ^General^   | ^Search^           | _!_: read    | _#_: deferred  | ^Switches^
  -^^----------+-^^-----------------| _?_: unread  | _%_: pattern   |-^^------------------
  _n_: next    | _s_: search        | _r_: refile  | _&_: custom    | _O_: sorting
  _p_: prev    | _S_: edit prev qry | _u_: unmk    | _+_: flag      | _P_: threading
  _]_: n unred | _/_: narrow search | _U_: unmk *  | _-_: unflag    | _Q_: full-search
  _[_: p unred | _b_: search bkmk   | _d_: trash   | _T_: thr       | _V_: skip dups
  _y_: sw view | _B_: edit bkmk     | _D_: delete  | _t_: subthr    | _W_: include-related
  _R_: reply   | _{_: previous qry  | _m_: move    |-^^-------------+-^^------------------
  _C_: compose | _}_: next query    | _a_: action  | _|_: to shell  | _´_: update, reindex
  _F_: forward | _C-+_: show more   | _A_: mk4actn | _H_: help      | _;_: context-switch
  _h_: ?mode   | _C--_: show less   | _*_: *thing  | _q_: quit hdrs | _j_: jump2maildir "

	;; general
	("n" mu4e-headers-next)
	("p" mu4e-headers-previous)
	("[" mu4e-select-next-unread)
	("]" mu4e-select-previous-unread)
	("y" mu4e-select-other-view)
	("R" mu4e-compose-reply)
	("C" mu4e-compose-new)
	("F" mu4e-compose-forward)

	;; search
	("s" mu4e-headers-search)
	("S" mu4e-headers-search-edit)
	("/" mu4e-headers-search-narrow)
	("b" mu4e-headers-search-bookmark)
	("B" mu4e-headers-search-bookmark-edit)
	("{" mu4e-headers-search-prev :color pink)      ; differs from built-in - make sure to add them later
	("}" mu4e-headers-search-next :color pink)      ; differs from built-in - make sure to add them later
	("C-+" mu4e-headers-split-view-grow)
	("C--" mu4e-headers-split-view-shrink)

	;; mark stuff
	("!" mu4e-headers-mark-for-read)
	("?" mu4e-headers-mark-for-unread)
	("r" mu4e-headers-mark-for-refile)
	("u" mu4e-headers-mark-for-unmark)
	("U" mu4e-mark-unmark-all)
	("d" mu4e-headers-mark-for-trash)
	("D" mu4e-headers-mark-for-delete)
	("m" mu4e-headers-mark-for-move)
	("a" mu4e-headers-action)                  ; not really a mark per-se
	("A" mu4e-headers-mark-for-action)
	("*" mu4e-headers-mark-for-something)


	("#" mu4e-mark-resolve-deferred-marks)
	("%" mu4e-headers-mark-pattern)
	("&" mu4e-headers-mark-custom)
	("+" mu4e-headers-mark-for-flag)
	("-" mu4e-headers-mark-for-unflag)
	("t" mu4e-headers-mark-subthread)
	("T" mu4e-headers-mark-thread)

	;; miscellany
	("q" mu4e~headers-quit-buffer)
	("H" mu4e-display-manual)
	("h" describe-mode)
	("|" mu4e-view-pipe)                       ; does not seem built-in any longer

	;; switches
	("O" mu4e-headers-change-sorting)
	("P" mu4e-headers-toggle-threading)
	("Q" mu4e-headers-toggle-full-search)
	("V" mu4e-headers-toggle-skip-duplicates)
	("W" mu4e-headers-toggle-include-related)

	;; more miscellany
	("´" mu4e-update-mail-and-index)           ; differs from built-in
	(";" mu4e-context-switch)
	("j" mu4e~headers-jump-to-maildir)

	("." nil))

#+end_src
*** Hydra Exensions
