C01_EmacsConfiguration/.emacs.d/package_configs/hydra_config.el

;; hydra multiple cursors
(defhydra hydra-multiple-cursors (:hint nil)
  "
     ^Up^            ^Down^             ^Other^
--------------------------------------------------------
[_p_]   Previous    [_n_]   Next    [_l_] Edit lines
[_P_]   Skip        [_N_]   Skip    [_a_] Mark all
[_M-p_] Unmark      [_M-n_] Unmark  [_r_] Mark by regexp
^ ^                 ^ ^             [_d_] Mark all defun
^ ^                 ^ ^             [_q_] Quit
"
  ("l" mc/edit-lines :exit t)
  ("a" mc/mark-all-like-this :exit t)
  ("n" mc/mark-next-like-this)
  ("N" mc/skip-to-next-like-this)
  ("M-n" mc/unmark-next-like-this)
  ("p" mc/mark-previous-like-this)
  ("P" mc/skip-to-previous-like-this)
  ("M-p" mc/unmark-previous-like-this)
  ("r" mc/mark-all-in-region-regexp :exit t)
  ("d" mc/mark-all-like-this-in-defun :exit t)
  ("q" nil))

;; Add to Leader keys
(pet/leader-keys
  "hm" '(hydra-multiple-cursors/body :which-key "Multiple Cursors"))

;; Editing Toggles
(defhydra hydra-editing-visuals (
						:color pink
							       :hint nil
							       )
      "
^Editing Visuals
^^^^^^-------------------------------------------------------------------------
_a_ abbrev-mode:                         %`abbrev-mode
_C_ display-fill-column-indicator-mode:  %`display-fill-column-indicator-mode
_d_ debug-on-error:                      %`debug-on-error
_f_ auto-fill-mode:                      %`auto-fill-function
_F_ variable-pitch-mode                 
_i_ toggle-input-method                 
_n_ display-line-numbers-mode:           %`display-line-numbers-mode
_M_ doom-modeline-mode:                  %`doom-modeline-mode
_R_ read-only-mode                      
_t_ truncate-lines:                      %`truncate-lines
_T_ counsel-load-theme                  
_v_ visual-line-mode:                    %`visual-line-mode
_w_ whitespace-mode:                     %`whitespace-mode
"
      ("a" abbrev-mode)
      ("C" display-fill-column-indicator-mode)
      ("d" toggle-debug-on-error)
      ("f" auto-fill-mode)
      ("F" variable-pitch-mode)
      ("i" toggle-input-method)
      ("t" toggle-truncate-lines)
      ("T" counsel-load-theme)
      ("v" visual-line-mode)
      ("n" display-line-numbers-mode)
      ("M" doom-modeline-mode)
      ("w" whitespace-mode)
      ("R" read-only-mode)
      ("q" nil "quit" :exit 1))

;; (global-set-key (kbd "C-c C-v") 'hydra-editing-toggles/body)

;; Add to Key Space
(pet/leader-keys
      "eh" '(hydra-editing-visuals/body :which-key "Editing Visuals")
      "T"  '(hydra-editing-visuals/body :which-key "Toggle Hydra")
      "ht" '(hydra-editing-visuals/body :which-key "Editing Visuals"))

;; Mu4e Hydra
(defhydra hydra-mu4e-headers (
							      :color blue
									 :hint nil
									 )
      "
 ^General^   | ^Search^           | _!_: read    | _#_: deferred  | ^Switches^
-^^----------+-^^-----------------| _?_: unread  | _%_: pattern   |-^^------------------
_n_: next    | _s_: search        | _r_: refile  | _&_: custom    | _O_: sorting
_p_: prev    | _S_: edit prev qry | _u_: unmk    | _+_: flag      | _P_: threading
_]_: n unred | _/_: narrow search | _U_: unmk *  | _-_: unflag    | _Q_: full-search
_[_: p unred | _b_: search bkmk   | _d_: trash   | _T_: thr       | _V_: skip dups 
_y_: sw view | _B_: edit bkmk     | _D_: delete  | _t_: subthr    | _W_: include-related
_R_: reply   | _{_: previous qry  | _m_: move    |-^^-------------+-^^------------------ 
_C_: compose | _}_: next query    | _a_: action  | _|_: to shell  | _´_: update, reindex
_F_: forward | _C-+_: show more   | _A_: mk4actn | _H_: help      | _;_: context-switch
_h_: ?mode   | _C--_: show less   | _*_: *thing  | _q_: quit hdrs | _j_: jump2maildir "

      ;; general
      ("n" mu4e-headers-next)
      ("p" mu4e-headers-previous)
      ("[" mu4e-select-next-unread)
      ("]" mu4e-select-previous-unread)
      ("y" mu4e-select-other-view)
      ("R" mu4e-compose-reply)
      ("C" mu4e-compose-new)
      ("F" mu4e-compose-forward)

      ;; search
      ("s" mu4e-headers-search)
      ("S" mu4e-headers-search-edit)
      ("/" mu4e-headers-search-narrow)
      ("b" mu4e-headers-search-bookmark)
      ("B" mu4e-headers-search-bookmark-edit)
      ("{" mu4e-headers-search-prev :color pink)      ; differs from built-in - make sure to add them later
      ("}" mu4e-headers-search-next :color pink)      ; differs from built-in - make sure to add them later
      ("C-+" mu4e-headers-split-view-grow)
      ("C--" mu4e-headers-split-view-shrink)

      ;; mark stuff 
      ("!" mu4e-headers-mark-for-read)
      ("?" mu4e-headers-mark-for-unread)
      ("r" mu4e-headers-mark-for-refile)
      ("u" mu4e-headers-mark-for-unmark)
      ("U" mu4e-mark-unmark-all)
      ("d" mu4e-headers-mark-for-trash)
      ("D" mu4e-headers-mark-for-delete)
      ("m" mu4e-headers-mark-for-move)
      ("a" mu4e-headers-action)                  ; not really a mark per-se
      ("A" mu4e-headers-mark-for-action)
      ("*" mu4e-headers-mark-for-something)


      ("#" mu4e-mark-resolve-deferred-marks)
      ("%" mu4e-headers-mark-pattern)
      ("&" mu4e-headers-mark-custom)
      ("+" mu4e-headers-mark-for-flag)
      ("-" mu4e-headers-mark-for-unflag)
      ("t" mu4e-headers-mark-subthread)
      ("T" mu4e-headers-mark-thread)

      ;; miscellany
      ("q" mu4e~headers-quit-buffer)
      ("H" mu4e-display-manual)
      ("h" describe-mode)
      ("|" mu4e-view-pipe)                       ; does not seem built-in any longer

      ;; switches
      ("O" mu4e-headers-change-sorting)
      ("P" mu4e-headers-toggle-threading)
      ("Q" mu4e-headers-toggle-full-search)
      ("V" mu4e-headers-toggle-skip-duplicates)
      ("W" mu4e-headers-toggle-include-related)

      ;; more miscellany
      ("´" mu4e-update-mail-and-index)           ; differs from built-in
      (";" mu4e-context-switch)  
      ("j" mu4e~headers-jump-to-maildir)

      ("." nil))
