000_OrgFiles/EmacsConfig.org
**** Ident Tools
[[https://gitlab.com/emacs-stuff/indent-tools/][Ident-Tools]] adds a [[*Hydra][hydra]] to manage indentations - helpful for [[id:8b26358a-672f-43c1-8507-1b388b3a31cd][languages]] like [[id:d76cab21-70db-4332-9b40-cb6b6af6643f][Python]] or [[id:cf227bfa-d401-4f12-b0ad-2fd1a233f206][YAML]].
#+begin_src emacs-lisp
  ;; Add Indent Tools for languages with identation based structures
  (use-package indent-tools
	:hook
	(python-mode .  (lambda () (define-key python-mode-map (kbd "C-c >") 'indent-tools-hydra/body)))
	(yaml-mode .  (lambda () (define-key yaml-mode-map (kbd "C-c >") 'indent-tools-hydra/body))))

#+end_src
** Treemacs Mode
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/treemacs_config.el :mkdirp yes
:END:
*** Load Treemacs

[[https://github.com/Alexander-Miller/treemacs][Treemacs]] is a handy tree-style *file directory viewer* that's very similar to what you are used from commercial IDEs.
It's got good integration with =Projectile=
#+begin_src emacs-lisp
  (use-package treemacs
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :config
    (progn
      (setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
            treemacs-deferred-git-apply-delay        0.5
            treemacs-directory-name-transformer      #'identity
            treemacs-display-in-side-window          t
            treemacs-eldoc-display                   'simple
            treemacs-file-event-delay                2000
            treemacs-file-extension-regex            treemacs-last-period-regex-value
            treemacs-file-follow-delay               0.2
            treemacs-file-name-transformer           #'identity
            treemacs-follow-after-init               t
            treemacs-expand-after-init               t
            treemacs-find-workspace-method           'find-for-file-or-pick-first
            treemacs-git-command-pipe                ""
            treemacs-goto-tag-strategy               'refetch-index
            treemacs-header-scroll-indicators        '(nil . "^^^^^^")
            treemacs-hide-dot-git-directory          t
            treemacs-indentation                     2
            treemacs-indentation-string              " "
  		  ;; ensure treemacs is never othher window when switching buffers
            treemacs-is-never-other-window           t
            treemacs-max-git-entries                 5000
            treemacs-missing-project-action          'ask
            treemacs-move-forward-on-expand          nil
            treemacs-no-png-images                   nil
            treemacs-no-delete-other-windows         t
            treemacs-project-follow-cleanup          nil
            treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
            treemacs-position                        'left
            treemacs-read-string-input               'from-child-frame
            treemacs-recenter-distance               0.1
            treemacs-recenter-after-file-follow      nil
            treemacs-recenter-after-tag-follow       nil
            treemacs-recenter-after-project-jump     'always
            treemacs-recenter-after-project-expand   'on-distance
            treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
            treemacs-project-follow-into-home        nil
            treemacs-show-cursor                     nil
            treemacs-show-hidden-files               t
            treemacs-silent-filewatch                nil
            treemacs-silent-refresh                  nil
            treemacs-sorting                         'alphabetic-asc
            treemacs-select-when-already-in-treemacs 'move-back
            treemacs-space-between-root-nodes        t
            treemacs-tag-follow-cleanup              t
            treemacs-tag-follow-delay                1.5
            treemacs-text-scale                      nil
            treemacs-user-mode-line-format           nil
            treemacs-user-header-line-format         nil
            treemacs-wide-toggle-width               70
            treemacs-width                           35
            treemacs-width-increment                 1
            treemacs-width-is-initially-locked       t
            treemacs-workspace-switch-cleanup        nil)

      ;; The default width and height of the icons is 22 pixels. If you are
      ;; using a Hi-DPI display, uncomment this to double the icon size.
      ;;(treemacs-resize-icons 44)

      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode 'always)
      (when treemacs-python-executable
        (treemacs-git-commit-diff-mode t))

      (pcase (cons (not (null (executable-find "git")))
                   (not (null treemacs-python-executable)))
        (`(t . t)
         (treemacs-git-mode 'deferred))
        (`(t . _)
         (treemacs-git-mode 'simple)))

      (treemacs-hide-gitignored-files-mode nil))
    :bind
    (:map global-map
          ("M-0"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("C-x t t"   . treemacs)
          ("C-x t d"   . treemacs-select-directory)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag)
  	    ([f8] . treemacs)
  		("C-<f8>" . treemacs-select-window)))

#+end_src
*** Treemacs-Evil
#+begin_src emacs-lisp
  ;; Enable Evil in Treemacs
  (use-package treemacs-evil
    :after (treemacs evil))

#+end_src
*** Treemacs-Magit
#+begin_src emacs-lisp
  ;; Enable Magit in Treemacs
  (use-package treemacs-magit
    :after (treemacs magit))

#+end_src
*** Treemacs-Projectile
#+begin_src emacs-lisp
  ;; Add Projectile Projects to Treemacs
  (use-package treemacs-projectile
    :after (treemacs projectile))

#+end_src
*** Treemacs-Tab-Bar
#+begin_src emacs-lisp
  ;; Unique Treemacs Buffers in Tab Bar Views
  (use-package treemacs-tab-bar
    :after (treemacs)
    :config (treemacs-set-scope-type 'Tabs))

#+end_src
*** Treemacs-Perspective
#+begin_src emacs-lisp
  ;; Unique Treemacs Buffers in Perspective Views
  (use-package treemacs-perspective
    :after (treemacs perspective)
    :config (treemacs-set-scope-type 'Perspectives))

#+end_src
*** Treemacs-Persp
#+begin_src emacs-lisp :tangle no
  ;; Unique Treemacs Buffers in Perspective Views
  (use-package treemacs-persp ;; if you use persp-mode vs. perspective.el
    :after (treemacs persp-mode) ;;vs perspective
    :config (treemacs-set-scope-type 'Perspectives))

#+end_src
*** Treemacs Icons in Dired Buffers
#+begin_src emacs-lisp :tangle no
  ;; Add Treemacs icons to Dired
  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once))

#+end_src
*** All the Icons in Treemacs
#+begin_src emacs-lisp :tangle no
  ;; Add All The Icons to Treemacs
  (use-package treemacs-all-the-icons
    :after (treemacs all-the-icons))

#+end_src
*** Treemacs Leader Keys
#+begin_src emacs-lisp
    ;; Add shortcut for treemacs to
    ;; personal keyspace
    (pet/leader-keys
     "lt"  '(:ignore t :which-key "treemacs")
     "ltt" 'treemacs
     "ltw" 'treemacs-select-window)

#+end_src
** Neotree
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/neotree_config.el :mkdirp yes
:END:

[[https://github.com/jaypei/emacs-neotree][Neotree]] is a file tree viewer.
When you open neotree, it jumps to the current file thanks to =neo-smart-open=.
The =neo-window-fixed-size= setting makes the ~neotree~ width be adjustable.

~NeoTree~ provides following themes:

+ =classic=
+ =ascii=
+ =arrow=
+ =icons=
+ =nerd=

Theme can be configured by setting “two” themes for =neo-theme=: one for the ~GUI~ and one for the ~terminal~.

|----------------+---------------------------+------------|
| COMMAND        | DESCRIPTION               | KEYBINDING |
|----------------+---------------------------+------------|
| neotree-toggle | Toggle neotree            | SPC t n    |
| neotree- dir   | Open directory in neotree | SPC d n    |
|----------------+---------------------------+------------|

#+begin_src emacs-lisp :tangle no
  (use-package neotree
    :config
    (setq neo-smart-open t
          neo-show-hidden-files t
          neo-window-width 55
          neo-window-fixed-size nil
          inhibit-compacting-font-caches t
          projectile-switch-project-action 'neotree-projectile-action)
    ;; truncate long file names in neotree
    (add-hook 'neo-after-create-hook
  			#'(lambda (_)
  				(with-current-buffer (get-buffer neo-buffer-name)
                    (setq truncate-lines t)
                    (setq word-wrap nil)
                    (make-local-variable 'auto-hscroll-mode)
                    (setq auto-hscroll-mode nil))))

    ;; Add shortcut for treemacs to
    ;; personal keyspace
    (pet/leader-keys
  	"t n" '(neotree-toggle :wk "Toggle neotree file viewer")
  	"d n" '(neotree-dir :wk "Open directory in neotree"))

#+end_src
** Beacon
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/beacon_config.el :mkdirp yes
:END:
Documentation can be found here: [[https://github.com/Malabarba/beacon][GitHub.com: beacon]]
#+begin_src emacs-lisp
  ;; applies beacon effect to the highlighted line on page scrolls
  (use-package beacon
     :config
     ;(setq beacon-color 0.4)
     (beacon-mode 1))

#+end_src
** GUI Extensions
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/gui_extensions_config.el :mkdirp yes
:END:
*** Command Log Mode

[[https://github.com/lewang/command-log-mode][command-log-mode]] is useful for displaying a panel showing each key binding you use in a panel on the right side of the frame.  Great for live streams and screencasts!
#+begin_src emacs-lisp
  ;; Enable Command Log Mode
  (use-package command-log-mode)

#+end_src
*** Visual Fill Column
Add [[https://codeberg.org/joostkremers/visual-fill-column][Visual Fill Column Mode]] to make centering text in buffers better
#+begin_src emacs-lisp
  ;; Visual Fill Column to center text
  (use-package visual-fill-column
  	:config
  	;; Load fill column when visual line mode
  	(add-hook 'visual-line-mode-hook #'visual-fill-column-mode)
  	;; Give more space to content, default uses value of fill-column variable
  	(setq-default visual-fill-column-width 130)
  	;; Automatically center text in visual fill column
  	(setq-default visual-fill-column-center-text t)

  	;; Add functionality to leader keys
  	(pet/leader-keys
  	  "tmV"   '(visual-fill-column-mode :which-key "Visual Fill Column")))

#+end_src
*** Writeroom
[[https://github.com/joostkremers/writeroom-mode][Writeroom]] adds a special mode for 'distraction-free writing'.
It is built on top of the [[*Visual Fill Column][Visual Fill Colum Mode]] above.
#+begin_src emacs-lisp
  ;; Add Writeroom Mode
  (use-package writeroom-mode
	:config
		(pet/leader-keys
	  "tmW"   '(writeroom :which-key "Writeroom Mode")))

#+end_src
*** Visual Regular Expressions

[[https://github.com/benma/visual-regexp.el][Visual-Regexp]] is a third party package that builds on emacs lisp [[id:26419d86-c777-4765-9dd1-9353f17a0716][regular expression]] functionality.
It enables highlighting of ~Regexp Groups~ to better understand the [[id:26419d86-c777-4765-9dd1-9353f17a0716][expressions]] during ~build-up~
#+begin_src emacs-lisp
  ;; Visually Mark Regexp
  (use-package visual-regexp)

#+end_src
*** Highlight Indentation
[[https://github.com/antonj/Highlight-Indentation-for-Emacs][Highlight-Indentation]] adds a useful visual hint to show indentations in source code - helpful for [[id:8b26358a-672f-43c1-8507-1b388b3a31cd][languages]] like [[id:d76cab21-70db-4332-9b40-cb6b6af6643f][Python]] or [[id:cf227bfa-d401-4f12-b0ad-2fd1a233f206][YAML]].
#+begin_src emacs-lisp
  ;; Add Indentation Guideline - usefull for languages like python or yaml
  (use-package highlight-indentation
	:hook
	;; Activate Guideline for programming modes
	(prog-mode . highlight-indentation-mode))
	;; :config
	;; (set-face-background 'highlight-indentation-face "#e3e3d3")
	;; (set-face-background 'highlight-indentation-current-column-face "#c3b3b3"))

#+end_src
*** Rainbow Mode

[[https://github.com/emacsmirror/rainbow-mode][Rainbow-Mode]] displays the ~actual color~ as a ~background~ for any [[id:b414f8b5-42d6-4856-bdb3-fab5423317a0][hex color value]] (ex. =#ffffff=).
The code block enables ~rainbow-mode~ in all ~programming modes~ (~prog-mode~) as well as ~org-mode~.
#+begin_src emacs-lisp
  ;; Highlight Hex Strings with matching Colors
  (use-package rainbow-mode
    :diminish
    :hook org-mode prog-mode)

#+end_src
*** Rainbow Delimiters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.
#+begin_src emacs-lisp
  ;; Add rainbow delimiters for better readability
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src
*** Matching Parenthesis

[[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] highlights matching parenthesis by default.
This Setting is meant to make that highlighting stand out more
#+begin_src emacs-lisp :tangle no
  ;; Customize highlighting of matching parenthesis
  (use-package paren
    :config
    (set-face-attribute
     'show-paren-match-expression nil :background "#363e4a")
    (show-paren-mode 1))

#+end_src
*** Terminal 256Color Support
#+begin_src emacs-lisp
  ;; add 256 color support
  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

#+end_src
