C01_EmacsConfiguration/.emacs.d/package_configs/hydra_config.el

;; Add Indent Tools for languages with identation based structures
(use-package indent-tools
      :hook
      (python-mode .  (lambda () (define-key python-mode-map (kbd "C-c >") 'indent-tools-hydra/body)))
      (yaml-mode .  (lambda () (define-key yaml-mode-map (kbd "C-c >") 'indent-tools-hydra/body))))
