000_OrgFiles/EmacsConfig.org
*** Display Emojis
[[https://github.com/iqbalansari/emacs-emojify][Emojify]] is an [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] extension to display ~emojis. It can display github style emojis like :smile: or plain ascii ones like :).
[[id:40f3f142-cf2a-44f0-a9fb-da5f5bf448cc][Unicode Emojis]] können auch ohne dieses Paket schon angezeigt werden
#+begin_src emacs-lisp
  ;; Extend Emacs Emoji capability (apart from Unicode)
  (use-package emojify
    ;; if you want to enable emojis globally:
    :hook (after-init . global-emojify-mode))

#+end_src
*** Minimap Mode

[[https://github.com/dengste/minimap][Minimap]] adds a minimap sidebar to [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]
#+begin_src emacs-lisp
  ;; Add Minimap to Emacs
  (use-package minimap
    :config
    ;; Set minimap to show on the right
    (setq minimap-window-location 'right)

    ;; Make Minimap available in most text modes
    (add-to-list 'minimap-major-modes 'text-mode)

    ;; Add Minimap to Keyspace for Toggles - Modes
    (pet/leader-keys
  	"tmm"   '(minimap-mode :which-key "Minimap Mode")))

#+end_src
*** Solaire Mode
#+begin_src emacs-lisp
    ;; Load Solaire - Distinguish file buffers with background
    (use-package solaire-mode
      :hook (after-init . solaire-global-mode)
      :config
      (push '(treemacs-window-background-face . solaire-default-face) solaire-mode-remap-alist)
      (push '(treemacs-hl-line-face . solair-hl-line-face) solaire-mode-remap-alist))

#+end_src
*** Padding

[[https://github.com/protesilaos/spacious-padding][Spacious-Padding]] adds padding to Emacs Windows and Frames. Makes it look a lot nicer.
#+begin_src emacs-lisp
  ;; Add Padding to make the GUI pop
  (use-package spacious-padding
    :hook
    (after-init . spacious-padding-mode))

#+end_src
*** Golden-Ratio

[[https://github.com/roman/golden-ratio.el][Golden-Ratio]] helps on this issue by resizing automatically the windows you are working on to the size specified in the ~"Golden Ratio"~.
The behaviour can be adjusted by a couple of variables like =golden-ratio-max-width=.
#+begin_src emacs-lisp
  ;; Automatically adjusts the focused window
  (use-package golden-ratio
    :hook (after-init . golden-ratio-mode)
    :custom
    (golden-ratio-exclude-modes '(occur-mode)))

#+end_src
*** Fireplace

Make your editor a little cozier with [[https://github.com/johanvts/emacs-fireplace][Emacs-Fireplace]]
#+begin_src emacs-lisp
  ;; Totally useless but i love it
  (use-package fireplace)

#+end_src
* Developement Tools
** Magit
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/magit_config.el :mkdirp yes
:END:

[[https://magit.vc/][Magit]] is one of the best Git interfaces. Common Git operations are easy to execute quickly using Magit's command panel system.
#+begin_src emacs-lisp
  (use-package magit
    :bind ("C-x g" . magit-status)
    :commands (magit-status magit-get-current-branch)
    :init
    ;; (add-to-list 'display-buffer-alist
    ;;              '("magit-diff*"
    ;;                display-buffer-in-side-window
    ;;                (side . right)
    ;;                (slot . 3)
    ;;                (window-parameters . ((no-delete-other-windows . t)))
    ;;                (dedicated . t)))

    (add-to-list 'display-buffer-alist
              `(,(make-display-buffer-matcher-function '(magit-mode))
                (display-buffer-reuse-mode-window
                 display-buffer-in-direction)
                (mode magit-mode)
                (window . root)
                (window-width . 0.15)
                (direction . left)))
    :config
    ;; Adjust display buffer setting
    ;; (setq magit-display-buffer-function
  	;; 	#'magit-display-buffer-same-window-except-diff-v1)
    (setq magit-display-buffer-function #'display-buffer)

    ;; Add Magit Commands to Leader Key Space
    (pet/leader-keys
  	"g"   '(:ignore t :which-key "git")
  	"gs"  'magit-status
  	"gd"  'magit-diff-unstaged
  	"gc"  'magit-branch-or-checkout
  	"gl"   '(:ignore t :which-key "log")
  	"glc" 'magit-log-current
  	"glf" 'magit-log-buffer-file
  	"gb"  'magit-branch
  	"gP"  'magit-push-current
  	"gp"  'magit-pull-branch
  	"gf"  'magit-fetch
  	"gF"  'magit-fetch-all
  	"gr"  'magit-rebase))

#+end_src
** Consult
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/consult_config.el :mkdirp yes
:END:
[[https://github.com/minad/consult][Consult]] is a Completion Engine that's fully compatible with [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] Buitlin Completion Engine
#+begin_src emacs-lisp
  ;; Load Consult
  (use-package consult)

#+end_src
** Company Mode
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/company_config.el :mkdirp yes
:END:
*** Load Company Mode

[[https://company-mode.github.io/][Company Mode]] is one of the *most useful* [[id:127b78f9-ac8e-4ce0-a316-0850559c44e4][Modes]] that *enhances* [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] ~Autocompletion Capabilities~
#+begin_src emacs-lisp
  ;; Helper Functions (for hooks mostly)
  (defun pet/company-text-mode ()
    "Sets 'company-mode' for 'text-mode'"
    ;; Activate completion after 3 letters in text mode
    (setq company-minimum-prefix-length 3))

  ;; Load Company Mode for Auto Completion
  (use-package company
    :defer 2
    :diminish
    :init
    (setq company-begin-commands '(self-insert-command))
    (setq company-minimum-prefix-length 2)
    (setq company-show-numbers t)   ;; Show numbers in tooltip
    (global-company-mode 1)         ;; activate company mode
    (company-tng-mode 1)            ;; make company perform completions with tab

    ;; Disable Company Mode in Strings or Comment
    (setq company-idle-delay
      (lambda () (if (company-in-string-or-comment) nil 0.3)))

    ;; Set hooks
    (add-hook 'text-mode-hook 'pet/company-text-mode)

    ;; Enable Cycling Options back to the Beginning
    (setq company-selection-wrap-around t)

    ;; Align Annotations (paramenters, arguments, etc..) right of tooltip
    (setq company-tooltip-align-annotations t)

    ;; Allow Prefix Length to be change per buffer
    (make-variable-buffer-local 'company-minimum-prefix-length)

    ;; Add Company Mode to Leader Keys
    (pet/leader-keys
      "tmc"  '(global-company-mode :which-key "Global Company Mode")))

#+end_src
*** Company Additions
**** Backends
***** Shell/Bash
****** Company Shell
~Documentation~ can be found here: [[https://github.com/Alexander-Miller/company-shell][GitHub.com: Company Shell]]
#+begin_src emacs-lisp
  ;; Add Company Extension for Bash and Shell
  (use-package company-shell
    :config
    (add-to-list 'company-backends '(company-shell company-shell-env)))

#+end_src
***** LaTeX
****** Company Math
This is an extension for [[id:62eadd2d-023b-4d03-8eb0-527528f6e224][LaTeX]]. ~Documentation~ can be found here: [[https://github.com/vspinu/company-math][GitHub.com: Company-Math]]
#+begin_src emacs-lisp
  ;; local configuration for TeX modes
  (defun pet/company-latex-mode ()
    "Sets 'company-mode' for 'text-mode'"
    ;; Add Backands
    (setq-local company-backends
                (append '((company-math-symbols-latex company-latex-commands))
                        company-backends)))

  ;; Add Company Extension for LaTeX Math
  (use-package company-math
    :config
    ;; Add hooks to Modes
    ;; Tex Mode
    (add-hook 'tex-mode-hook 'pet/company-latex-mode)
    ;; Org Mode
    (add-hook 'org-mode-hook 'pet/company-latex-mode)

    ;; global activation of the unicode symbol completion
    (add-to-list 'company-backends 'company-math-symbols-unicode))

#+end_src
***** C/C++/C#
****** Company C-Headers
This is an ~Extension~ for [[id:ba074e3c-58a2-4d3a-b1ec-4475993eaa99][C/C++/C#]] for ~Company Mode~.
~Documentation~ can be found here: [[https://github.com/randomphrase/company-c-headers][GitHub.com: Company-C-Headers]]
#+begin_src emacs-lisp :tangle no
  ;; Add Company Extension for C/C++
  (use-package company-c-headers)

#+end_src
***** Python
****** Company Jedi

This is an ~Extension~ for [[id:d76cab21-70db-4332-9b40-cb6b6af6643f][Python]] for ~Company Mode~.
~Documentation~ can be found here: [[https://github.com/emacsorphanage/company-jedi][GitHub.com: Company Jedi]]
#+begin_src emacs-lisp
  ;; local configuration for Python modes
  (defun pet/company-python-mode ()
    "Sets 'company-mode' for 'text-mode'"
    ;; Activate completion after 1 letters in python mode
    (setq company-minimum-prefix-length 1)
    ;; Add Jedi to Company Backends
    (add-to-list 'company-backends 'company-jedi))

  ;; Add Company Extension for Python
  (use-package company-jedi
    :config
    (add-hook 'python-mode-hook 'pet/company-python-mode))

#+end_src
***** Lua
This is an ~Extension~ for Lua for ~Company Mode~. ~Documentation~ can be found here: [[https://github.com/ptrv/company-lua][GitHub.com: Company-Lua]]
#+begin_src emacs-lisp
  ;; local configuration for Python modes
  (defun pet/company-lua-mode ()
    "Sets 'company-mode' for 'text-mode'"
    ;; Activate completion after 1 letters in python mode
    (setq company-minimum-prefix-length 1)
    ;; Add Lua to Company Backends
    (setq-local company-backends '((company-lua
                                    company-etags
                                    company-dabbrev-code
                                    company-yasnippet))))


    ;; Add Company Extension for Lua
    (use-package company-lua
      :config
      (add-hook 'lua-mode-hook 'pet/company-lua-mode))

#+end_src

**** Frontends
***** Company Box

~Company Box~ is an *alternative* ~Frontend~ that enables options like *different colors* for *different backends* and more.
Information can be found here: [[https://github.com/sebastiencs/company-box][GitHub.com: Company-Box]]
#+begin_src emacs-lisp
  ;; Add Alternative Frontend
  (use-package company-box
    :after company
    :diminish        ;; Don’t show mode in minibuffer
    :hook (company-mode . company-box-mode))

#+end_src
