C01_EmacsConfiguration/.emacs.d/package_configs/gui_extensions_config.el

;; Extend Emacs Emoji capability (apart from Unicode)
(use-package emojify
  ;; if you want to enable emojis globally:
  :hook (after-init . global-emojify-mode))

;; Add Minimap to Emacs
(use-package minimap
  :config
  ;; Set minimap to show on the right
  (setq minimap-window-location 'right)

  ;; Make Minimap available in most text modes
  (add-to-list 'minimap-major-modes 'text-mode)

  ;; Add Minimap to Keyspace for Toggles - Modes
  (pet/leader-keys
      "tmm"   '(minimap-mode :which-key "Minimap Mode")))

;; Load Solaire - Distinguish file buffers with background
(use-package solaire-mode
  :hook (after-init . solaire-global-mode)
  :config
  (push '(treemacs-window-background-face . solaire-default-face) solaire-mode-remap-alist)
  (push '(treemacs-hl-line-face . solair-hl-line-face) solaire-mode-remap-alist))

;; Add Padding to make the GUI pop
(use-package spacious-padding
  :hook
  (after-init . spacious-padding-mode))

;; Automatically adjusts the focused window
(use-package golden-ratio
  :hook (after-init . golden-ratio-mode)
  :custom
  (golden-ratio-exclude-modes '(occur-mode)))
