000_OrgFiles/EmacsConfig.org
** Dev Tool Collection
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/dev_tools_collection_config.el :mkdirp yes
:END:
*** Flycheck

[[https://www.flycheck.org/en/latest/user/quickstart.html][Flycheck]] adds syntax checking capagilities.
It needs should be loaded together with =lsp-mode= or =eglot=.
You could also load it globally.
#+begin_src emacs-lisp :tangle no
  ;; Enable Flycheck for syntax checking.
  ;; Defer loading until used with lsp-mode
  (use-package flycheck
    :defer t
    :diminish
    :init (global-flycheck-mode))
    ;; :hook (lsp-mode . flycheck-mode)
    ;; (emacs-lisp-mode . flycheck-mode))

#+end_src
*** Git Time Machine

[[https://codeberg.org/pidu/git-timemachine][git-timemachine]] is a program that allows you to move backwards and forwards through a file’s commits.
=‘SPC g t’= will open the ~time machine~ on a file if it is in a git repo.
Then, while in ~normal mode~, you can use =‘CTRL-j’= and =‘CTRL-k’= to move backwards and forwards through the commits.
#+begin_src emacs-lisp
  ;;  Add Git Timemachine
  (use-package git-timemachine
    :after (git-timemachine evil)
    :hook (evil-normalize-keymaps . git-timemachine-hook)
    :config
      (evil-define-key 'normal git-timemachine-mode-map (kbd "C-j") 'git-timemachine-show-previous-revision)
      (evil-define-key 'normal git-timemachine-mode-map (kbd "C-k") 'git-timemachine-show-next-revision)

  	(pet/leader-keys
  	  "g t" '(git-timemachine :wk "Git time machine")))

#+end_src
*** Highlight Todo

[[https://github.com/tarsius/hl-todo][Hl-Todo]] highlights a specified set of keywords in comments and strings
#+begin_src emacs-lisp
  (use-package hl-todo
    :hook (;; (org-mode . hl-todo-mode)  ;; Not needed with Org Modern
           (prog-mode . hl-todo-mode))
    :config
    (setq hl-todo-highlight-punctuation ":"
          hl-todo-keyword-faces
          `(("TODO"       warning bold)
            ("FIXME"      error bold)
            ("HACK"       font-lock-constant-face bold)
            ("REVIEW"     font-lock-keyword-face bold)
            ("NOTE"       success bold)
            ("DEPRECATED" font-lock-doc-face bold))))

#+end_src
*** Origami Mode

[[https://github.com/gregsexton/origami.el][Origami]] is a text folding minor mode for [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]].
With this minor mode enabled, you can collapse and expand regions of text.
Seems to be *deprecated*
#+begin_src emacs-lisp :tangle no
  ;; Add Origami Mode for Folding
  (use-package origami
	:hook (yaml-mode . origami-mode)
	      (yaml-mode . highlight-indentation-mode)
	:bind (:map origami-mode-map
				("<tab>" . origami-recursively-toggle-node)
				("S-<tab>" . origami-toggle-all-nodes)
				("C-c C-n" . origami-next-fold)
				("C-c C-p" . origami-previous-fold)
				("C-c C-S-_" . origami-undo)
				("C-c C-S-M-_" . origami-redo)))

#+end_src
*** Citar
**** Load Citar

[[https://github.com/emacs-citar/citar][Citar]] provides a completing-read front-end to browse and act on ~BibTeX~, ~BibLaTeX~, and ~CSL~ [[id:460f9462-9a7b-4172-af3b-fb424b6e85b6][JSON]] ~bibliographic data~, and [[id:62eadd2d-023b-4d03-8eb0-527528f6e224][LaTeX]], markdown, and =org-cite= editing support.
:NOTE:
This section is partially inspired by: [[https://kristofferbalintona.me/posts/202206141852][KristofferBalintona.me: Org-Cite]]
:END:
#+begin_src emacs-lisp
  ;; Add Citar completion buffer for citations
  (use-package citar
    ;; The `:straight' keyword is not necessary. However, I do this to set a value
    ;; for the `:includes' keyword. This keyword tells use-package that those
    ;; package(s) are provided by this package, and not to search for them on
    ;; Melpa for download. Alternatively, you can set the `:straight' keyword to
    ;; nil in those package(s) use-package declaration.
    :straight (citar :type git :host github :repo "emacs-citar/citar" :includes (citar-org))
    :custom
    ;; A list of bib files. A good idea would be having its value be identical to
    ;; that of `org-cite-global-bibliography'. For me, I have all my bib file(s)
    ;; as a list of strings in `kb/bib-files'.
    (citar-bibliography pet/main-bib)

    ;; List of directories for reference nodes
    (citar-notes-paths (list pet/org-dir))

    (citar-open-note-function 'orb-citar-edit-note) ; Open notes in `org-roam'
    ;; (citar-at-point-function 'embark-act)           ; If use `embark'

    ;; Add Keybindings
    :general
    (:keymaps 'org-mode-map
  			:prefix "C-c b"
  			"b" '(citar-insert-citation :wk "Insert citation")
  			"r" '(citar-insert-reference :wk "Insert reference")
  			"o" '(citar-open-notes :wk "Open note")))

#+end_src
**** Citar Org Integration
#+begin_src emacs-lisp
  ;; Use `citar' with `org-cite'
  (use-package citar-org
  	:after oc
  	:custom
  	(org-cite-insert-processor 'citar)
  	(org-cite-follow-processor 'citar)
  	(org-cite-activate-processor 'citar))

#+end_src
*** Apheleia
[[https://github.com/radian-software/apheleia][Apheleia]] formats code automatically according to rules set by [[https://github.com/psf/black][Black]], [[https://prettier.io/][Prettier]] or [[https://pkg.go.dev/cmd/gofmt][GoFMT]] and so on.

:NOTE:
You need to have the underlying ~Code Formatters~ like [[https://github.com/psf/black][Black]], [[https://prettier.io/][Prettier]] or [[https://pkg.go.dev/cmd/gofmt][GoFMT]] installed, to use them with this [[id:1c44cf3c-6549-4e70-a3fd-491df7996dd5][Package]]
:END:
#+begin_src emacs-lisp :tangle no
  ;; Add Apheleia Code Formatter
  (use-package apheleia
	:config (apheleia-global-mode 1))

#+end_src
** DevDocs
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/devdocs_config.el :mkdirp yes
:END:

[[https://github.com/astoff/devdocs.el][DevDocs]] is a documentation viewer for [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] similar to the built-in Info browser, but geared towards ~documentation~ distributed by the [[https://devdocs.io/][DevDocs]] website.
The custom function was taken from [[https://github.com/gopar/.emacs.d][GitHub.com: Gopar - Emacs.d]]
#+begin_src emacs-lisp
  (use-package devdocs
    :defer
    :bind ("C-c M-d" . pet/devdocs-lookup)
    :init
    (add-to-list 'display-buffer-alist
                 '("\\*devdocs\\*"
                   display-buffer-in-side-window
                   (side . right)
                   (slot . 3)
                   (window-parameters . ((no-delete-other-windows . t)))
                   (dedicated . t)))

    ;; Specify the directory to install devdocs to -- default is ’~/.emacs.d/devdocs’
    (setq devdocs-data-dir (concat pet/dotfiles-emacsconfig-dir "devdocs"))

    (defun pet/devdocs-lookup (&optional ask-docs)
      "Light wrapper around `devdocs-lookup` which pre-populates the function input with thing at point"
      (interactive "P")
      (let ((query (thing-at-point 'symbol t)))
        (devdocs-lookup ask-docs query)))

    ;; Narrow down the options by setting up hooks for language modes
    :hook ((python-mode . (lambda () (setq-local devdocs-current-docs
                                        '("django~4.2" "django_rest_framework" "python~3.12" "postgresql~16" "sqlite"))))
           (web-mode . (lambda () (setq-local devdocs-current-docs '("vue~3"
                                                                     "vue_router~4"
                                                                     "javascript"
                                                                     "typescript"
                                                                     "vitest"
                                                                     "moment"
                                                                     "tailwindcss"
                                                                     "html"
                                                                     "css"))))
           (typescript-mode . (lambda () (setq-local devdocs-current-docs '("vue~3"
                                                                            "vue_router~4"
                                                                            "javascript"
                                                                            "typescript"
                                                                            "vitest"
                                                                            "moment"))))))

#+end_src
** Language Support
*** Highlighting and Formatting
**** Traditional Language Modes
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/language_modes_config.el :mkdirp yes
:END:
***** Octave/Matlab

Just a short config adjusting the =auto-mode-alist=
#+begin_src emacs-lisp
  ;; Load Octave Mode automatically for specified files
  (setq auto-mode-alist
	(cons '("\\.m$" . octave-mode) auto-mode-alist))
  (setq auto-mode-alist
	(cons '("\\.sci$" . octave-mode) auto-mode-alist))

  ;; Setup Octave Mode
  (add-hook 'octave-mode-hook
		(lambda ()
		  (abbrev-mode 1)
		  (auto-fill-mode 1)
		  (if (eq window-system 'x)
		  (font-lock-mode 1))))

  ;; Use Infodocs within Emacs
  (autoload 'octave-help "octave-hlp" nil t)

#+end_src
