C01_EmacsConfiguration/.emacs.d/package_configs/language_modes_config.el
;; Load Octave Mode automatically for specified files
(setq auto-mode-alist
      (cons '("\\.m$" . octave-mode) auto-mode-alist))
(setq auto-mode-alist
      (cons '("\\.sci$" . octave-mode) auto-mode-alist))

;; Setup Octave Mode
(add-hook 'octave-mode-hook
	      (lambda ()
		(abbrev-mode 1)
		(auto-fill-mode 1)
		(if (eq window-system 'x)
		(font-lock-mode 1))))

;; Use Infodocs within Emacs
(autoload 'octave-help "octave-hlp" nil t)
