000_OrgFiles/EmacsConfig.org
***** LaTeX

Improve [[id:62eadd2d-023b-4d03-8eb0-527528f6e224][LaTeX]] support for [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]
Lsp for latex should not be needed since its part of [[https://www.gnu.org/software/auctex/documentation.html][AUCTex]]
#+begin_src  emacs-lisp
  ;; Integrated environment for TeX
  (use-package tex-site
	:straight auctex
	:config
	;; Add Reftex Support to AUCTeX
	(setq reftex-plug-into-AUCTeX t)
	(setq reftex-default-bibliography
		  (list
		   pet/main-bib))
	;; Automatically insert math environment with '$'
	(setq TeX-electric-math t)
	;; Autocomplete command on '\'
	(setq TeX-electric-escape t)
	;; Autoinsert braces after '^' and '_' in math mode
	(setq TeX-electric-sub-and-superscript t))

  ;; Specify viewer programs
  (setq TeX-view-program-selection
		'(((output-dvi has-no-display-manager) "dvi2tty")
		  ((output-dvi style-pstricks) "dvips and gv")
		  (output-dvi "xdvi")
		  (output-pdf "Okular")
		  (output-pdf "PDF Tools")
		  ;; (output-pdf "Evince")
		  (output-html "xdg-open")))


  ;; Specify Viewer Calls
  (setq TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view)))

  ;; Activate TeX source correlate Mode
  (setq TeX-source-correlate-mode t)
  ;; Starts server for inverse search
  (setq TeX-source-correlate-start-server t)

  ;; Hook to automatically refresh output buffer
  (add-hook 'TeX-after-compilation-finished-functions
			#'TeX-revert-document-buffer)

  ;; enable auto saving tex files
  (setq TeX-auto-save t)
  ;; enable completion and multifile structure (include/input)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil)

  ;; set $ to insert math environment
  ;; ... for plain TeX
  (add-hook 'plain-TeX-mode-hook
			(lambda () (set (make-local-variable 'TeX-electric-math)
							(cons "$" "$"))))
  ;; ... for LaTeX
  (add-hook 'LaTeX-mode-hook
			(lambda () (set (make-local-variable 'TeX-electric-math)
							(cons "\\(" "\\)"))))

  ;; Activate source correlate mode
  (add-hook 'plain-TeX-mode-hook
			(lambda () (setq TeX-source-correlate-mode t)))

  ;; Load RefTeX...
  ;; ... with AUCTeX LaTeX mode
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  ;; ... with with Emacs latex mode
  (add-hook 'latex-mode-hook 'turn-on-reftex)

  ;; Enable auto completion of right braces (")}]\)\]\}")
  ;; Use 'C-u 1' or 'C-q' before to disable
  (setq LaTeX-electric-left-right-brace t)

  ;; LatexMK support for AUCTeX
  ;; (use-package auctex-latexmk)

  ;; Useful features for LaTeX-mode
  ;;(use-package latex-extra)

  ;; Fast input methods for LaTeX environments and math
  (use-package cdlatex
	:bind
	(:map LaTeX-mode-map
		  ("C-#" . cdlatex-mode))
	:config
	;; Maybe add hook to autoload cdlatex
	;; (add-hook 'LaTeX-mode-hook #'turn-on-cdlatex)
	;; (add-hook 'org-mode-hook #'turn-on-org-cdlatex)

	;; Added personal keybinding
	(pet/leader-keys
		  "tmc" '(cdlatex-mode
				  :which-key "CDLaTeX Minor Mode")))

#+end_src
***** Python
Improve [[id:d76cab21-70db-4332-9b40-cb6b6af6643f][Python]] functionality of [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]

The commented lines are for distributions like Ubuntu, where =python= referes to python 2 and python 3 need to be called by =python3=

=Pyrigth= is a ~language server~ written in C# that is a lot faster then the normal pyls, but it is not fully open-source.
A better alternative is =jedi=
Python debugger is set to =debugpy= (don't forget to pip install =debugpy= - alternative to "ptvsd>=4.2"), because it is recommended over the default ptsd
#+begin_src emacs-lisp
  ;; Set Default Indentation for Python
  (setq-default python-indent-offset 4)

	;;;; Customize Python Mode for emacs, add lsp
  ;;(add-hook 'python-mode-hook 'lsp-deferred)
  ;;  :custom
  ;;  (python-shell-interpreter "python")
  ;;  (dab-python-executable "python")
  ;;  (dab-python-debugger 'debugpy)
  ;;  :config
  ;;  (require 'dab-python)
  ;;  )

  ;; ;; Enable Virtual Environment Support
  ;; (use-package pyvenv
  ;; 	:config
  ;; 	(pyvenv-mode 1))

#+end_src
***** Rust
Add [[https://github.com/rust-lang/rust-mode][Rust Mode]] to support the [[id:a3286d40-db6c-4757-a586-bcfbedd7afa2][Rust Programming Language]]
#+begin_src emacs-lisp
  ;; Add Support for Rust
  (use-package rust-mode)

#+end_src
***** PHP
~Documentation~ can be found here: [[https://github.com/emacs-php/php-mode][GitHub.com: PHP Mode]]
#+begin_src emacs-lisp
  ;; Load PHP Package
  (use-package php-mode)

  ;; Load Org PHP Support
  ;; (use-package ob-php)

#+end_src
***** Lua
#+begin_src emacs-lisp
  ;; Add Mode for Lua
  (use-package lua-mode)

#+end_src
***** Julia
Add [[https://github.com/JuliaEditorSupport/julia-emacs][Julia Mode]] to support the [[id:156ecd0f-2d32-48e4-8e8e-132831dae624][Julia Programming Language]]
#+begin_src emacs-lisp
  ;; Add Support for the Julia Programming Language
  (use-package julia-mode)

#+end_src
***** Zig
Add [[https://github.com/ziglang/zig-mode][Zig-Mode]] to support the [[https://ziglang.org/][Zig Programming Language]], a modern ~system's~ [[id:8b26358a-672f-43c1-8507-1b388b3a31cd][programming language]]
#+begin_src emacs-lisp
  ;; Add Support for Nix Language and Nix Configurations
  (use-package zig-mode
	:mode ("\\.zig\\'"))

#+end_src
***** Nix
Add [[https://github.com/NixOS/nix-mode][Nix-Mode]] to support the [[https://nixos.org/][Nix Language]] for the ~customization~ of [[id:2a8642c6-544c-4ffc-bb95-348bd5a24ee5][NixOS]]
#+begin_src emacs-lisp
  ;; Add Support for Nix Language and Nix Configurations
  (use-package nix-mode
	:mode ("\\.nix\\'" "\\.nix.in\\'"))
  ;; Viewing Nix .drv Files
  (use-package nix-drv-mode
	:straight nil ;; already loaded with nix-mode
	:ensure nix-mode
	:mode "\\.drv\\'")
  ;; Viewing Nix .drv Files
  (use-package nix-flake
	:straight nil ;; already loaded with nix-mode
	:ensure nix-mode)
  ;; Provides Interactive Shell to call nix functions
  (use-package nix-shell
	:straight nil ;; already loaded with nix-mode
	:ensure nix-mode
	:commands (nix-shell-unpack nix-shell-configure nix-shell-build))
  ;; Adds a REPL for Nix (plus interface for company)
  (use-package nix-repl
	:straight nil ;; already loaded with nix-mode
	:ensure nix-mode
	:commands (nix-repl))

#+end_src
***** Web Mode
~Web-Mode~ is an *alternative* [[id:127b78f9-ac8e-4ce0-a316-0850559c44e4][Mode]] for editing [[id:df751d5b-04e3-4cb2-83de-76a6e39943d6][HTML]] Documents in [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]
~Documentation~ can be found here: [[https://web-mode.org/][Web-Mode.org]]
#+begin_src emacs-lisp :tangle no
  ;; Add alternative Mode for HTML Developement
  (use-package web-mode
    :init
    (setq-default web-mode-code-indent-offset 2)
    ;; (setq web-mode-engines-alist '(("django" . "\\.html\\'")))

    ;; :hook (web-mode . (lambda ()
    ;;                     (highlight-indentation-mode -1)
    ;;                     (electric-pair-local-mode -1)))
    :custom
    (web-mode-script-padding 0)
    (web-mode-enable-current-element-highlight t)
    (web-mode-enable-current-column-highlight t)
    (web-mode-markup-indent-offset 2)
    (web-mode-css-indent-offset 2)
    (web-mode-sql-indent-offset 2)
    :mode (("\\.vue\\'" . web-mode)
  		 ("\\.html\\'" . web-mode)))

#+end_src
***** ESS Mode
[[https://ess.r-project.org/][ESS Mode]] (~Emacs Speaks Statistics~) is an [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] [[id:127b78f9-ac8e-4ce0-a316-0850559c44e4][Mode]] meant for ~Programming~ with [[id:8b26358a-672f-43c1-8507-1b388b3a31cd][Languages]] meant for ~statistical Computation~ like [[id:c64bc74b-bc42-4208-bf36-3c6832392de9][R]], ~S~, ~SAS~, ~SPSS~
#+begin_src emacs-lisp
  ;; Load Support for statistical Computation
  (use-package ess)

#+end_src
****** ESS Smart Equals

=ess-smart-equals= is a ~package extension~ for ~ESS Mode~ to make some ~Quality of Life adjustments~ like *automatic* ~closing braces~, inserting =<-= for ='='= and more.
~Documentation~ can be found here: [[https://github.com/genovese/ess-smart-equals][GitHub.com: ess-smart-equals]]
#+begin_src emacs-lisp
  ;; Helper Package for assignment operators and more in ESS
  (use-package ess-smart-equals
    ;; Add additional support (automatic pared braces etc..)
    :init   (setq ess-smart-equals-extra-ops '(brace paren percent))
    ;; Load moade with ESS
    :after  (:any ess-r-mode inferior-ess-r-mode ess-r-transcript-mode)
    ;; Activate modoe
    :config (ess-smart-equals-activate))

#+end_src
****** ESS R Insert Obj
=ess-r-insert-obj= is a ~package extension~ for ~ESS Mode~ to improve the interaction with the ~completion framework~ provided by the [[id:c64bc74b-bc42-4208-bf36-3c6832392de9][R]] [[id:c7d7135a-3f11-4fea-8bcf-e3e83318f453][Package]] =tidyverse=
~Documentation~ can be found here: [[https://github.com/ShuguangSun/ess-r-insert-obj][GitHub.com: ess-r-insert-obj]]
#+begin_src emacs-lisp
  ;; improve interaction between ESS and R Package 'tidyverse'
  (use-package ess-r-insert-obj)

#+end_src
****** ESS View Data

=ess-view-data= is a ~package extension~ for ~ESS Mode~ to do data views and manipulation similar to the [[id:c64bc74b-bc42-4208-bf36-3c6832392de9][R]] [[id:c7d7135a-3f11-4fea-8bcf-e3e83318f453][Package]] =tidyverse=
~Documentation~ can be found here: [[https://github.com/ShuguangSun/ess-view-data][GitHub.com: ess-view-data]]
#+begin_src emacs-lisp
  ;; Tidyverse-like data views and manipulations
  (use-package ess-view-data)

#+end_src
***** CSV

Add support for ~CSV-like~ files in [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]
~Repository~ can be found here: [[https://git.savannah.gnu.org/cgit/emacs/elpa.git/?h=externals/csv-mode][Git.Savannah.GNU.org: csv-mode]]
#+begin_src emacs-lisp
  ;; Major mode for editing comma/char separated values
  (use-package csv-mode)

#+end_src
***** YAML

Add support for [[id:cf227bfa-d401-4f12-b0ad-2fd1a233f206][YAML]] ~Files~
#+begin_src emacs-lisp
  ;; Add support for YAML files
  (use-package yaml-mode
    :mode "\\.ya?ml\\'")

#+end_src
***** Gnuplot Mode

~Gnuplot Mode~ adds support for ~Gnuplot~ to [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]
~Documentation~ can be found here: [[https://github.com/mkmcc/gnuplot-mode][GitHub.com: Gnuplot-Mode]]
#+begin_src emacs-lisp
  ;; Add Gnuplot Support
  (use-package gnuplot-mode
	:config
	;; Use this if gnuplot is not /usr/bin/gnuplot
	(setq gnuplot-program "/usr/bin/gnuplot")

	;; automatically enter gnuplot mode
	(setq auto-mode-alist
		  (append '(("\\.\\(gp\\|gnuplot\\)$" . gnuplot-mode)) auto-mode-alist)))

#+end_src
