000_OrgFiles/EmacsConfig.org
***** PlantUML

You can find the ~Documentation~ here: [[https://github.com/skuro/plantuml-mode][GitHub.com: PlantUML-Mode]]
#+begin_src emacs-lisp
  ;; Add PlantUML Support
  (use-package plantuml-mode
    :config
    ;; Set Execution Mode to Render with Local Binary
    (setq plantuml-executable-path "/usr/bin/plantuml")
    (setq plantuml-default-exec-mode 'executable)
    ;; Set load path condition
    :mode "\\.pl?a?n?t?uml\\'")

#+end_src
**** Treesitter Language Modes
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/language_ts_modes_config.el :mkdirp yes
:END:

[[https://github.com/tree-sitter/tree-sitter][Tree-sitter]] is a library that transforms structured texts like source code and markdown into a ~concrete syntax tree~.
It basically replaces [[id:26419d86-c777-4765-9dd1-9353f17a0716][RegExp]] based ~code parsers~ in most modern ~IDEs~.
Mastering Emacs has written pretty good guides that go into more detail about it:
- [[https://www.masteringemacs.org/article/tree-sitter-complications-of-parsing-languages][MasteringEmacs.org: Tree-Sitter Complications of Parsing Languages]]
- [[https://www.masteringemacs.org/article/how-to-get-started-tree-sitter][MasteringEmacs.org: How to get Started with Tree-Sitter]]

[[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] supports ~tree-sitter~ out of the box since ~Version 29~.
If you are on an older version, look into using [[https://emacs-tree-sitter.github.io/][Emacs-Tree-Sitter]]


***** Language Mode Sources List

The list below specifies a ~source repositories~ for various languages.
You can add them by typing =M-x treesit-install-language-grammar=

Alternatively you can download a precompiled list of language grammars here:
+ [[https://github.com/emacs-tree-sitter/tree-sitter-langs][GitHub.com: Emacs-Tree-Sitter - Tree-Sitter Language Grammars]]

:NOTE:
This is not a complete list of languages, nor does it aim to be.
You can probably find a more up-to-date list of language modules here:
[[https://tree-sitter.github.io/tree-sitter/][GitHub.io: Tree-Sitter]]
:END:
#+begin_src emacs-lisp
  (setq treesit-language-source-alist
        '((bash "https://github.com/tree-sitter/tree-sitter-bash")
        (c "https://github.com/tree-sitter/tree-sitter-c")
        (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
        (c-sharp "https://github.com/tree-sitter/tree-sitter-c-sharp")
        (commonlisp "https://github.com/theHamsta/tree-sitter-commonlisp")
        (cmake "https://github.com/uyha/tree-sitter-cmake")
        (css "https://github.com/tree-sitter/tree-sitter-css")
        (dockerfile "https://github.com/camdencheek/tree-sitter-dockerfile")
        (elisp "https://github.com/Wilfred/tree-sitter-elisp")
        (erlang "https://github.com/WhatsApp/tree-sitter-erlang/")
        (go "https://github.com/tree-sitter/tree-sitter-go")
        (gitignore "https://github.com/shunsambongi/tree-sitter-gitignore")
        (graphql "https://github.com/bkegley/tree-sitter-graphql")
        (haskell "https://github.com/tree-sitter/tree-sitter-haskell")
        (html "https://github.com/tree-sitter/tree-sitter-html")
        (java "https://github.com/tree-sitter/tree-sitter-java")
        (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
        (jq "https://github.com/flurie/tree-sitter-jq")
        (json "https://github.com/tree-sitter/tree-sitter-json")
        (json5 "https://github.com/Joakker/tree-sitter-json5")
        (julia "https://github.com/tree-sitter/tree-sitter-julia")
        (latex "https://github.com/latex-lsp/tree-sitter-latex")
        (llvm "https://github.com/benwilliamgraham/tree-sitter-llvm")
        (lua "https://github.com/Azganoth/tree-sitter-lua")
        (make "https://github.com/alemuller/tree-sitter-make")
        (markdown "https://github.com/ikatyang/tree-sitter-markdown")
        (meson "https://github.com/staysail/tree-sitter-meson")  ;; There is an alternative which supposedly heavily diverges from the official tree-sitter grammer: https://github.com/Decodetalkers/tree-sitter-meson
        (kotlin "https://github.com/fwcd/tree-sitter-kotlin")
        (nix "https://github.com/nix-community/tree-sitter-nix")
        (objc "https://github.com/jiyee/tree-sitter-objc")
        (ocaml "https://github.com/tree-sitter/tree-sitter-ocaml")
        (org "https://github.com/milisims/tree-sitter-org")
        (perl "https://github.com/tree-sitter-perl/tree-sitter-perl") ;; Another option is: https://github.com/ganezdragon/tree-sitter-perl
        (python "https://github.com/tree-sitter/tree-sitter-python")
        (php "https://github.com/tree-sitter/tree-sitter-php")
        (r "https://github.com/r-lib/tree-sitter-r")
        (regex "https://github.com/tree-sitter/tree-sitter-regex")
        (ruby "https://github.com/tree-sitter/tree-sitter-ruby")
        (rust "https://github.com/tree-sitter/tree-sitter-rust")
        (scheme "https://github.com/6cdh/tree-sitter-scheme")
        (sexp "https://github.com/AbstractMachinesLab/tree-sitter-sexp")
        (sql "https://github.com/m-novikov/tree-sitter-sql")   ;; Focus on PostgreSQL Syntax
        (sqlite "https://github.com/dhcmrlchtdj/tree-sitter-sqlite")
        (toml "https://github.com/tree-sitter/tree-sitter-toml")
        (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
        (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
        (yaml "https://github.com/ikatyang/tree-sitter-yaml")
        (zig "https://github.com/maxxnino/tree-sitter-zig")))

#+end_src

***** Remap Major Modes

Remaps old ~regexp-based~ [[id:127b78f9-ac8e-4ce0-a316-0850559c44e4][Major Modes]] to their =-ts-= counterpart.
This is a little hacky, but does the trick for now.
Once these modes work sufficiently enough, the old modes will be swapped over.
#+begin_src emacs-lisp
  ;; Remap Major modes to TS Counterpars
  (setq major-mode-remap-alist
        '((yaml-mode . yaml-ts-mode)
  		(c-mode . c-ts-mode)
  		(go-mode . go-ts-mode)
  		(bash-mode . bash-ts-mode)
  		(nix-mode . nix-ts-mode)
  		(js2-mode . js-ts-mode)
  		(html-mode . html-ts-mode)
  		(typescript-mode . typescript-ts-mode)
  		(json-mode . json-ts-mode)
  		(css-mode . css-ts-mode)
  		(rust-mode . rust-ts-mode)
  		;; (zig-mode . zig-ts-mode)
  		(python-mode . python-ts-mode)))

#+end_src
***** Nix TS Mode
#+begin_src emacs-lisp
  ;; Add Nix support to tree-sitter
  (use-package nix-ts-mode
    :mode "\\.nix\\'")

#+end_src
***** Zig TS Mode
#+begin_src emacs-lisp
  ;; Add Nix support to tree-sitter
  (use-package zig-ts-mode
    :mode "\\.zig\\'")

#+end_src
*** Language Servers
**** LSP Mode
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/lsp_mode_config.el :mkdirp yes
:END:
***** Setup
We use the [[ https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable ~IDE-like functionality~ for many different programming languages via “language servers” that speak the *Language Server Protocol*.
Before trying to set up =lsp-mode= for a particular language, check out the documentation for your language so that you can learn which [[https://emacs-lsp.github.io/lsp-mode/page/languages/][language servers are available]] and how to install them.

The lsp-keymap-prefix setting enables you to define a prefix for where lsp-mode’s default keybindings will be added. I highly recommend using the prefix to find out what you can do with lsp-mode in a buffer.

The which-key integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing C-c s in a lsp-mode buffer and trying different things that you find there.

#+begin_src emacs-lisp
  ;; Add Language Server Support
  (use-package lsp-mode
    ;; :hook ((c-mode          ;; clangd
    ;;         c++-mode        ;; clangd
    ;;         c-or-c++-mode   ;; clangd
    ;;         python-mode     ;; pyright
    ;;         typescript-mode ;; ts-ls (tsserver wrapper)
    ;;         js-mode         ;; ts-ls (tsserver wrapper)
    ;;         web-mode        ;; ts-ls/HTML/CSS
    ;;         ) . lsp-deferred)
    :commands (lsp lsp-deferred)
    :bind (:map lsp-mode-map
        ("M-TAB" . completion-at-point))
    :custom (lsp-headerline-breadcrumb-enable nil)
    :config (lsp-enable-which-key-integration t)
    ;; automatically set project root as determined by projectile
    ;; (setq lsp-auto-guess-root t)
    ;; Disable logging of all language server message for performance
    (setq lsp-log-io nil)
    ;; Set LSP Restart to auto (interactive by default)
    ;; (setq lsp-restart 'auto-restart)
    ;; disable symbol references
    (setq lsp-enable-symbol-highlighting nil)
    ;; disable on type formatting
    (setq lsp-enable-on-type-formatting nil)
    ;; disable signature conditions and documentation
    (setq lsp-signature-auto-activate nil)
    (setq lsp-signature-render-documentation nil)
    ;; disable eldoc hook
    (setq lsp-eldoc-hook nil)
    ;; disable modeline informations
    (setq lsp-modeline-code-actions-enable nil)
    (setq lsp-modeline-diagnostics-enable nil)
    ;; disable breadcrumb/headerline
    (setq lsp-headerline-breadcrumb-enable nil)
    ;; disable semantic tokens
    (setq lsp-semantic-tokens-enable nil)
    ;; disable code folding
    (setq lsp-enable-folding nil)
    ;; dont enable imenu automatically
    (setq lsp-enable-imenu nil)
    ;; disable snippet completion
    (setq lsp-enable-snippet nil)
    ;; Set delay (0.5 is default)
    (setq lsp-idle-delay 0.5)
    ;; Increase amount of data read from process for lsp (1MB)
    (setq read-process-output-max (* 1024 1024))

    ;; Add Lsp Functions to Leader Keys
    (pet/leader-keys
      "tld" 'xref-find-definitions
      "tlr" 'xref-find-references
      ;; "tln" 'lsp-ui-find-next-reference
      ;; "tlp" 'lsp-ui-find-prev-reference
      "tls" 'counsel-imenu
      ;; "tle" 'lsp-ui-flycheck-list
      ;; "tlS" 'lsp-ui-sideline-mode
      "tlX" 'lsp-execute-code-action)

#+end_src
***** Consult LSP
[[https://github.com/gagbo/consult-lsp][Consult-LSP]] adds ~LSP Mode~ support to ~Consult~
***** lsp-ui

=lsp-ui= is a set of UI enhancements built on top of lsp-mode which make Emacs feel even more like an IDE. Check out the screenshots on the [[https://emacs-lsp.github.io/lsp-ui/][lsp-ui homepage]] to see examples of what it can do.

#+begin_src emacs-lisp :tangle no
  ;; Add lsp ui for higher level ui options
  (use-package lsp-ui
   :commands lsp-ui-mode
   ;; :hook (lsp-mode . lsp-ui-mode)
   ;; Show lsp info on sideline
   :config
   (setq lsp-ui-doc-enable nil)
   (setq lsp-ui-doc-header t)
   (setq lsp-ui-doc-include-signature t)
   (setq lsp-ui-doc-border (face-foreground 'default))
   (setq lsp-ui-sideline-show-code-actions t)
   ;; (setq lsp-ui-sideline-enable t)
   ;; (setq lsp-ui-sideline-show-hover nil)
   ;; (setq lsp-ui-doc-position 'bottom)
   (setq lsp-ui-sideline-delay 0.05))

#+end_src
***** lsp-treemacs

+ =lsp-treemacs= provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

 - =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
 - =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
 - =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the =treemacs= ~package~ which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+begin_src emacs-lisp
  ;; Extend lsp and treemacs integration
  (use-package lsp-treemacs
    :after (lsp treemacs))

#+end_src
***** Debugging

There's a companion mode for =lps-mode= specifically for debugging
Dap stands for Debug Adapter
#+begin_src emacs-lisp
  (use-package dap-mode
    :after lsp-mode
    :config (dap-auto-configure-mode))
  ;;(use-package dap-mode
  ;;  :after lsp-mode
  ;;  :custom
  ;;  (lsp-enable-dap-auto-configure nil)
  ;;  :config
  ;;  (dap-ui-mode 1)
  ;;  (dap-tooltip-mode 1)
  ;;  (require 'dap-node)
  ;;  (dap-node-setup))

#+end_src
***** LSP-Mode Languages
