C01_EmacsConfiguration/.emacs.d/package_configs/language_modes_config.el

;; Add PlantUML Support
(use-package plantuml-mode
  :config
  ;; Set Execution Mode to Render with Local Binary
  (setq plantuml-executable-path "/usr/bin/plantuml")
  (setq plantuml-default-exec-mode 'executable)
  ;; Set load path condition
  :mode "\\.pl?a?n?t?uml\\'")
