000_OrgFiles/EmacsConfig.org
****** Python
#+begin_src emacs-lisp
  ;; Setup lsp-pyright Server
  (use-package lsp-pyright
	:hook (python-mode . (lambda () (require 'lsp-pyright)))
	;; Use Python 3 in case Python 2 is installed as well
	:init (when (executable-find "python3")
			(setq lsp-pyright-python-executable-cmd "python3"))
	)



#+end_src
****** LaTeX
~LSP Options~ for [[id:62eadd2d-023b-4d03-8eb0-527528f6e224][LaTeX]]:
+ [[https://github.com/latex-lsp/texlab][GitHub: LaTeX-LSP - texlab]]
+ [[https://github.com/astoff/digestif][GitHub.com: Astoff - digestif]]
#+begin_src emacs-lisp
  ;; Lsp-Mode Settings for LaTeX
  (setq lsp-tex-server 'digestif) ;; Use Digestif
  ;; (setq lsp-tex-server 'texlab) ;; Use texlab instead

#+end_src
**** Eglot
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/eglot_config.el :mkdirp yes
:END:
***** Setup
[[https://github.com/joaotavora/eglot][Eglot]] comes preconfigured with [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] since Version 29
#+begin_src emacs-lisp
  ;; add language-servers
  (with-eval-after-load 'eglot
    (add-to-list 'eglot-server-programs
                 '((rust-mode rust-ts-mode) . ("rust-analyzer" ))))

#+end_src
***** Consult Eglot
[[https://github.com/gagbo/consult-lsp][Consult-Eglot]] adds ~Eglot~ support to ~Consult~
***** Eglot Languages
#+begin_src emacs-lisp
  ;; Automatically start eglot for listed languages
  (cl-loop for lang in
           '(;; Python
             python-mode-hook
             python-ts-mode-hook

  		   ;; C Lang
  		   c-mode-hook
  		   c-ts-mode-hook

  		   ;; C++ Lang
  		   c++-mode-hook
  		   c++-ts-mode-hook
  		   c-or-c++-mode-hook
  		   c-or-c++-ts-mode-hook

  		   ;; Rust
  		   rust-ts-mode

  		   ;; Go
  		   go-ts-mode

  		   ;; Lua
  		   lua-ts-mode

  		   ;; HTML
  		   html-mode
  		   html-ts-mode

  		   ;; CSS
  		   css-mode
  		   css-ts-mode

  		   ;; JSON
  		   json-ts-mode

  		   ;; YAML
             yaml-ts-mode)
           do
           (add-hook lang 'eglot-ensure))

#+end_src
*** Language Servers
**** LSP Mode
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/lsp_mode_config.el :mkdirp yes
:END:
***** Setup
We use the [[ https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable ~IDE-like functionality~ for many different programming languages via “language servers” that speak the *Language Server Protocol*.
Before trying to set up =lsp-mode= for a particular language, check out the documentation for your language so that you can learn which [[https://emacs-lsp.github.io/lsp-mode/page/languages/][language servers are available]] and how to install them.

The lsp-keymap-prefix setting enables you to define a prefix for where lsp-mode’s default keybindings will be added. I highly recommend using the prefix to find out what you can do with lsp-mode in a buffer.

The which-key integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing C-c s in a lsp-mode buffer and trying different things that you find there.

#+begin_src emacs-lisp
  ;; Add Language Server Support
  (use-package lsp-mode
    ;; :hook ((c-mode          ;; clangd
    ;;         c++-mode        ;; clangd
    ;;         c-or-c++-mode   ;; clangd
    ;;         python-mode     ;; pyright
    ;;         typescript-mode ;; ts-ls (tsserver wrapper)
    ;;         js-mode         ;; ts-ls (tsserver wrapper)
    ;;         web-mode        ;; ts-ls/HTML/CSS
    ;;         ) . lsp-deferred)
    :commands (lsp lsp-deferred)
    :bind (:map lsp-mode-map
        ("M-TAB" . completion-at-point))
    :custom (lsp-headerline-breadcrumb-enable nil)
    :config (lsp-enable-which-key-integration t)
    ;; automatically set project root as determined by projectile
    ;; (setq lsp-auto-guess-root t)
    ;; Disable logging of all language server message for performance
    (setq lsp-log-io nil)
    ;; Set LSP Restart to auto (interactive by default)
    ;; (setq lsp-restart 'auto-restart)
    ;; disable symbol references
    (setq lsp-enable-symbol-highlighting nil)
    ;; disable on type formatting
    (setq lsp-enable-on-type-formatting nil)
    ;; disable signature conditions and documentation
    (setq lsp-signature-auto-activate nil)
    (setq lsp-signature-render-documentation nil)
    ;; disable eldoc hook
    (setq lsp-eldoc-hook nil)
    ;; disable modeline informations
    (setq lsp-modeline-code-actions-enable nil)
    (setq lsp-modeline-diagnostics-enable nil)
    ;; disable breadcrumb/headerline
    (setq lsp-headerline-breadcrumb-enable nil)
    ;; disable semantic tokens
    (setq lsp-semantic-tokens-enable nil)
    ;; disable code folding
    (setq lsp-enable-folding nil)
    ;; dont enable imenu automatically
    (setq lsp-enable-imenu nil)
    ;; disable snippet completion
    (setq lsp-enable-snippet nil)
    ;; Set delay (0.5 is default)
    (setq lsp-idle-delay 0.5)
    ;; Increase amount of data read from process for lsp (1MB)
    (setq read-process-output-max (* 1024 1024))

    ;; Add Lsp Functions to Leader Keys
    (pet/leader-keys
      "tld" 'xref-find-definitions
      "tlr" 'xref-find-references
      ;; "tln" 'lsp-ui-find-next-reference
      ;; "tlp" 'lsp-ui-find-prev-reference
      "tls" 'counsel-imenu
      ;; "tle" 'lsp-ui-flycheck-list
      ;; "tlS" 'lsp-ui-sideline-mode
      "tlX" 'lsp-execute-code-action)

#+end_src
***** Consult LSP
[[https://github.com/gagbo/consult-lsp][Consult-LSP]] adds ~LSP Mode~ support to ~Consult~
***** lsp-ui

=lsp-ui= is a set of UI enhancements built on top of lsp-mode which make Emacs feel even more like an IDE. Check out the screenshots on the [[https://emacs-lsp.github.io/lsp-ui/][lsp-ui homepage]] to see examples of what it can do.

#+begin_src emacs-lisp :tangle no
  ;; Add lsp ui for higher level ui options
  (use-package lsp-ui
   :commands lsp-ui-mode
   ;; :hook (lsp-mode . lsp-ui-mode)
   ;; Show lsp info on sideline
   :config
   (setq lsp-ui-doc-enable nil)
   (setq lsp-ui-doc-header t)
   (setq lsp-ui-doc-include-signature t)
   (setq lsp-ui-doc-border (face-foreground 'default))
   (setq lsp-ui-sideline-show-code-actions t)
   ;; (setq lsp-ui-sideline-enable t)
   ;; (setq lsp-ui-sideline-show-hover nil)
   ;; (setq lsp-ui-doc-position 'bottom)
   (setq lsp-ui-sideline-delay 0.05))

#+end_src
***** lsp-treemacs

+ =lsp-treemacs= provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

 - =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
 - =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
 - =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the =treemacs= ~package~ which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+begin_src emacs-lisp
  ;; Extend lsp and treemacs integration
  (use-package lsp-treemacs
    :after (lsp treemacs))

#+end_src
***** Debugging

There's a companion mode for =lps-mode= specifically for debugging
Dap stands for Debug Adapter
#+begin_src emacs-lisp
  (use-package dap-mode
    :after lsp-mode
    :config (dap-auto-configure-mode))
  ;;(use-package dap-mode
  ;;  :after lsp-mode
  ;;  :custom
  ;;  (lsp-enable-dap-auto-configure nil)
  ;;  :config
  ;;  (dap-ui-mode 1)
  ;;  (dap-tooltip-mode 1)
  ;;  (require 'dap-node)
  ;;  (dap-node-setup))

#+end_src
***** LSP-Mode Languages
****** Python
#+begin_src emacs-lisp
  ;; Setup lsp-pyright Server
  (use-package lsp-pyright
	:hook (python-mode . (lambda () (require 'lsp-pyright)))
	;; Use Python 3 in case Python 2 is installed as well
	:init (when (executable-find "python3")
			(setq lsp-pyright-python-executable-cmd "python3"))
	)



#+end_src
****** LaTeX
~LSP Options~ for [[id:62eadd2d-023b-4d03-8eb0-527528f6e224][LaTeX]]:
+ [[https://github.com/latex-lsp/texlab][GitHub: LaTeX-LSP - texlab]]
+ [[https://github.com/astoff/digestif][GitHub.com: Astoff - digestif]]
#+begin_src emacs-lisp
  ;; Lsp-Mode Settings for LaTeX
  (setq lsp-tex-server 'digestif) ;; Use Digestif
  ;; (setq lsp-tex-server 'texlab) ;; Use texlab instead

#+end_src
**** Eglot
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/eglot_config.el :mkdirp yes
:END:
***** Setup
[[https://github.com/joaotavora/eglot][Eglot]] comes preconfigured with [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] since Version 29
#+begin_src emacs-lisp
  ;; add language-servers
  (with-eval-after-load 'eglot
    (add-to-list 'eglot-server-programs
                 '((rust-mode rust-ts-mode) . ("rust-analyzer" ))))

#+end_src
***** Consult Eglot
[[https://github.com/gagbo/consult-lsp][Consult-Eglot]] adds ~Eglot~ support to ~Consult~
***** Eglot Languages
#+begin_src emacs-lisp
  ;; Automatically start eglot for listed languages
  (cl-loop for lang in
           '(;; Python
             python-mode-hook
             python-ts-mode-hook

  		   ;; C Lang
  		   c-mode-hook
  		   c-ts-mode-hook

  		   ;; C++ Lang
  		   c++-mode-hook
  		   c++-ts-mode-hook
  		   c-or-c++-mode-hook
  		   c-or-c++-ts-mode-hook

  		   ;; Rust
  		   rust-ts-mode

  		   ;; Go
  		   go-ts-mode

  		   ;; Lua
  		   lua-ts-mode

  		   ;; HTML
  		   html-mode
  		   html-ts-mode

  		   ;; CSS
  		   css-mode
  		   css-ts-mode

  		   ;; JSON
  		   json-ts-mode

  		   ;; YAML
             yaml-ts-mode)
           do
           (add-hook lang 'eglot-ensure))

#+end_src
* Terminal Modes
** Vterm
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/vterm_config.el :mkdirp yes
:END:
*** Load Vterm
~vterm~ is a terminal emulater that is written in C and handles the shell, meaning that Emacs is just a wrapper handling formatting of its output. It's normally a lot faster than the normal term mode

You can find the documentation here: [[https://github.com/akermu/emacs-libvterm]]

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :config
    ;; uncomment this line if you want to use zsh
    ;; (setq vterm-shell "zsh")
    ;; set maximum lines of output to be stored in RAM
    (setq vterm-max-scrollback 10000)
    ;; Adjust vterm window management
    (add-to-list 'display-buffer-alist
  			   '("\\*vterm\\*" display-buffer-reuse-mode-window
  				 ;; change to `t' to not reuse same window
  				 (inhibit-same-window . nil)
  				 (mode vterm-mode vterm-copy-mode))))

#+end_src
*** Vterm-Toggle

[[https://github.com/jixiuf/vterm-toggle][vterm-toggle]] toggles between the ~vterm buffer~ and whatever buffer you are editing.
#+begin_src emacs-lisp
  (use-package vterm-toggle
    :after vterm
    :config
    ;; When running programs in Vterm and in 'normal' mode, make sure that ESC
    ;; kills the program as it would in most standard terminal programs.
    (evil-define-key 'normal vterm-mode-map (kbd "<escape>") 'vterm--self-insert)
    (setq vterm-toggle-fullscreen-p nil)
    (setq vterm-toggle-scope 'project)
    (add-to-list 'display-buffer-alist
                 '((lambda (buffer-or-name _)
                     (let ((buffer (get-buffer buffer-or-name)))
                       (with-current-buffer buffer
                         (or (equal major-mode 'vterm-mode)
                             (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
                   (display-buffer-reuse-window display-buffer-at-bottom)
                   ;;(display-buffer-reuse-window display-buffer-in-direction)
                   ;;display-buffer-in-direction/direction/dedicated is added in emacs27
                   ;;(direction . bottom)
                   ;;(dedicated . t) ;dedicated is supported in emacs27
                   (reusable-frames . visible)
                   (window-height . 0.4))))

#+end_src
** Eshell
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/eshell_config.el :mkdirp yes
:END:

~Eshell~ is a variation of the normal "shell" mode and is a lot more customizable.
Looking at current developement, it might also be a lot more relevant in the future, as a "emacs-friendly" alternative to "vterm"

#+begin_src emacs-lisp

  ;; adds git related prompt elements to eshell
  (use-package eshell-git-prompt)

  (use-package eshell
    :config
    ;; Set the prompt theme to powerline
    (eshell-git-prompt-use-theme 'powerline))

#+end_src

For documentation on *eshell-git-prompt* look here: [[https://github.com/xuchunyang/eshell-git-prompt]]

* Org Mode
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/org_config.el :mkdirp yes
:END:
[[id:8510330a-9746-4684-ba60-04255df37924][Org Mode]] is one of *THE* killer-features of [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]].  It is a rich document editor, project planner, task and time tracker, blogging engine, and literate coding utility all wrapped up in one package.
