C01_EmacsConfiguration/.emacs.d/package_configs/org_config.el
;; Helper Functions for Org
(defun pet/org-font-setup ()
      ;; Set faces for heading levels
      (dolist (face '((org-level-1 . 1.2)
		      (org-level-2 . 1.15)
		      (org-level-3 . 1.1)
		      (org-level-4 . 1.05)
		      (org-level-5 . 1.02)
		      (org-level-6 . 1.0)
		      (org-level-7 . 1.0)
		      (org-level-8 . 1.0)))
	(set-face-attribute
	 (car face)
	 nil
	 :font "Cantarell"
	 :weight 'regular
	 :height (cdr face)))

      ;; Ensure that anything that should be
      ;; fixed-pitch in Org files appears that way
      (set-face-attribute 'org-block nil
		      :foreground nil
		      :inherit 'fixed-pitch)
      (set-face-attribute 'org-code nil
		      :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-table nil
		      :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-verbatim nil
		      :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-special-keyword nil
		      :inherit '(font-lock-comment-face
				 fixed-pitch))
      (set-face-attribute 'org-meta-line nil
		      :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-checkbox nil
		      :inherit 'fixed-pitch))

;; Replace list hyphen with dot
(defun pet/org-replace-hyphen ()
      (font-lock-add-keywords
       'org-mode '(("^ *\\([-]\\) "
		(0 (prog1 () (compose-region
			      (match-beginning 1)
			      (match-end 1) "•"))))))
      )

;; Helper Function to quickly toggle Babel Confirm Evaluation
(defun pet/org-toggle-babel-confirm-evaluate ()
(interactive)
"Toogle org-babel-confirm-evaluate on/ff"
(if org-confirm-babel-evaluate
	(setq org-confirm-babel-evaluate nil)
      (setq org-confirm-babel-evaluate t))
(print (concat "Org Babel Confirm State: "
	       (format "%s" org-confirm-babel-evaluate))))

;; Add Org Contrib Packages
(use-package org-contrib)

;; Setting Up Org Mode
(use-package org
:ensure org-plus-contrib
:straight nil
:bind (("C-c l" . org-store-link))
:hook (org-mode . org-indent-mode)
:custom
(org-cite-export-processors
 '((md . (csl "chicago-fullnote-bibliography.csl"))   ; Footnote reliant
   (latex . biblatex)                                 ; For humanities
   (odt . (csl "chicago-fullnote-bibliography.csl"))  ; Footnote reliant
   (t . (csl "modern-language-association.csl"))      ; Fallback
   ))
;; Add Citation Directory
(org-cite-csl-styles-dir
 (concat pet/temp-dir "X6_Citation_Styles/"))
:custom-face
;; Have citation link faces look closer to as they were for `org-ref'
(org-cite ((t (:foreground "DarkSeaGreen4"))))
(org-cite-key ((t (:foreground "forest green" :slant italic))))
)

;; Add additional Export Options
(require 'ox-beamer)       ;; LaTeX beamer
(require 'ox-koma-letter)  ;; LaTeX KOMA Script
(require 'ox-md)           ;; Markdown
(require 'ox-texinfo)      ;; Texinfo
(require 'ox-man)          ;; Man Page
(require 'ox-org)          ;; Org Format

;; Add additional Babel Support
(require 'ob-ledger)       ;; Ledger

;; Add additional Citation Support
(require 'oc-basic)        ;; Basic
(require 'oc-bibtex)       ;; Bibtex
(require 'oc-biblatex)     ;; Biblatex
(require 'oc-csl)          ;; CSL

(setq org-ellipsis " ▾")

;; Default directory for Org Files for Captures and Agenda
(setq org-directory pet/org-dir)

;; Set Org Clock Sound File
(setq org-clock-sound (concat pet/org-dir "sounds/Erfolg.wav"))
;; (setq org-clock-sound t)

;; Startup with inline images displayed
(setq org-startup-with-inline-images t)

;; Enable helper function replacing hyphen
(pet/org-replace-hyphen)

;; The default here is 999, which is a little to constricting for SQL and such
(setq org-table-convert-region-max-lines 9999)

;; The following prevents <> from auto-pairing when electric-pair-mode is on.
;; Otherwise, org-tempo is broken when you try to <s TAB...
(add-hook 'org-mode-hook
          (lambda ()
            (setq-local electric-pair-inhibit-predicate
                        `(lambda (c)
                           (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

;; ;; Set src block automatic indent to 0 instead of 2.
;; (setq org-edit-src-content-indentation 0)

;; Specify Agenda Files
(setq org-agenda-files
  ;;(cons (concat pet/org-dir "journal")
      ;; Add Files a starting with "personal-"
      (directory-files pet/org-dir t
  		       "personal-\\(tasks\\|mail\\|chores\\|contracts\\)-?[A-Za-z]*.org")
      ;;)
)

(setq org-agenda-start-with-log-mode t)

;; Use Drawer to store Information aboutTodo State Changes
(setq org-log-done 'time)
(setq org-log-into-drawer t)

;; Add Custom TODO Keywords - in 2 seperate Sequences
(setq org-todo-keywords
      ;; Sequence 1 
      '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
    	  ;; Sequence 2
    	  (sequence "MEET(m)")
    	  ;; Sequence 3
    	  (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)"
    		        "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)"
    		        "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

;; Customize Apps for Filelinks
(cl-loop for type in
  	       '(;; Open PDFs with Zathura
  		 ;; ("\\.pdf\\'" . "zathura %s") ;
  		 ;; Open PDFs with PDF Tools
  		 ("\\.pdf\\'" . "pdf-tools %s")			   
  		 ;; Open Pictures with sxiv 
  		 ("\\.png\\'" . "sxiv %s")
  		 ("\\.jpg\\'" . "sxiv %s")
  		 ("\\.jpeg\\'" . "sxiv %s")
  		 ("\\.svg\\'" . "sxiv %s")
  		 ;; Open Youtube links with freetube
  		 ("\\.\\*youtu\\.\\*" . "freetube %s"))
  	       do
  	       (add-to-list 'org-file-apps type))

;; Set Keywords with shortcuts
(setq org-tag-alist
  '((:startgroup)
      ;; Put mutually exclusive tags here
      (:endgroup)
      ("@errand" . ?E)
      ("@home" . ?H)
      ("@work" . ?W)
      ("@study" . ?S)
      ("agenda" . ?a)
      ("planning" . ?p)
      ("publish" . ?P)
      ("batch" . ?b)
      ("note" . ?n)
      ("idea" . ?i)))

;; Set Refile Targets to be considered, Emphasis on Archive 
(setq org-refile-targets
  '((nil :maxlevel . 9)
      ("~/Org/personal-archive.org" :maxlevel . 1)
      ("~/Org/personal-tasks.org" :maxlevel . 1)
      ("~/Org/personal-sources.org" :maxlevel . 1)
      ("~/Backup/Web-Bookmarks/1-bookmarks-import.org" :maxlevel . 9)
      ("~/Backup/Web-Bookmarks/2-bookmarks-export.org" :maxlevel . 9)))

;; Allow Creation of Parent nodes but ask for confirmation
(setq org-refile-allow-creating-parent-nodes 'confirm)

;; Save Org buffers after refiling!
(advice-add 'org-refile :after 'org-save-all-org-buffers)

(pet/leader-keys
