C01_EmacsConfiguration/.emacs.d/package_configs/org_config.el
  "ot" '(:ignore t :which-key "Toggle")
  "otb" '(pet/org-toggle-babel-confirm-evaluate
  	:which-key "Babel Confirm Evaluation")
  "otc" '(org-cdlatex-mode
  	:which-key "Org CDLaTeX Minor Mode")
  "oti" '(org-toggle-inline-images
  	:which-key "Inline Images")
  "otp" '(org-toggle-pretty-entities
  	:which-key "Pretty entities")
  "oi" '(:ignore t :which-key "Import")
  "oit" '(org-table-import
  	:which-key "Table")
  "oa"  '(org-agenda :which-key "Org Agenda"))

;; Setup inline previewing of latex fragments
(setq org-latex-create-formula-image-program
  'imagemagick)

;; Set Latex PDF Export Process
(setq org-latex-pdf-process
  	(list
  	 "latexmk -shell-escape -bibtex -f -pdf -%latex -interaction=nonstopmode -output-directory=%o %f"
  	 "latexmk -f -pdf -%latex -interaction=nonstopmode -output-directory=%o %f"))

;; Add global Bibliography Source
(setq org-cite-global-bibliography
  	(list
  	 pet/main-bib))

;; Bigger LaTeX Previews
(plist-put org-format-latex-options :scale 1.5)

;; Load language packages for pdflatex of lualatex / xelatex compilers
(add-to-list 'org-latex-packages-alist
    		       ;; Language Support
    		       '("AUTO" "babel" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Language Support
    		       '("AUTO" "polyglossia" t ("xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; For Modern Fonts, Vektorschrift
    		       '("" "lmodern" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Tabellen mit variabler Breite
    		       '("" "tabularx" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Source Code Lists
    		       '("" "listings" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Support for more file names for graphics package
    		       '("" "grffile" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Mathematical Enhancer
    		       '("" "amsmath" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Mathematical Enhancer
    		       '("" "amsthm" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Mathematical Enhancer
    		       '("" "amssymb" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Allows adjusting of counter in enumerate environment
    		       '("" "enumerate" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; For Modern Fonts, Vektorschrift
    		       '("" "lmodern" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Fix typessetting in amsmath, extend amsmath 
    		       '("fixamsmath, dissallowspace" "mathtools" t
    			 ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; More Symbols
    		       '("" "marvosym" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Even More Math Symbols
    		       '("" "esint" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Color Support and Adjustment functionality
    		       '("" "color" t ("pdflatex" "xelatex" "lualatex")))
(add-to-list 'org-latex-packages-alist
    		       ;; Adds more color variations, more options for color specification
    		       '("svgnames, dvipsnames" "xcolor" t ("pdflatex" "xelatex" "lualatex")))

;; Org LaTeX Setup
(eval-after-load 'ox-latex
'(progn
   ;; Plain Article Class
   (add-to-list 'org-latex-classes
  			      '("plain-article"
  				"\\documentclass{article}
  		      [NO-DEFAULT-PACKAGES]
  		      [PACKAGES]
  		      [EXTRA]"
  				("\\section{%s}" . "\\section*{%s}")
  				("\\subsection{%s}" . "\\subsection*{%s}")
  				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				("\\paragraph{%s}" . "\\paragraph*{%s}")
  				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

   ;; CV Class
   (add-to-list 'org-latex-classes
  			      '("moderncv"
  				"\\documentclass[11pt,
  				a4paper,
  				sans, 
  				]{moderncv}
  		 [NO-DEFAULT-PACKAGES]
  		 [PACKAGES]
  		 [EXTRA]"
  				("\\section{%s}" . "\\section*{%s}")
  				("\\subsection{%s}" . "\\subsection*{%s}")
  				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				("\\paragraph{%s}" . "\\paragraph*{%s}")
  				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))))

;; Org LaTeX Setup
(eval-after-load 'ox-latex
'(progn
