000_OrgFiles/EmacsConfig.org
**** Koma Classes
#+begin_src emacs-lisp
  ;; Org LaTeX Setup
  (eval-after-load 'ox-latex
  '(progn
     ;; Add Koma Article
     (add-to-list 'org-latex-classes
  				'("scrartcl"
  				  "\\documentclass[a4paper,
  			parskip=half,%
  			fromalign=right,
  			fromrule=false,
  			11pt
  			]{scrartcl}
  	   [DEFAULT-PACKAGES]
  	   [PACKAGES]
  	   [EXTRA]"
  				  ("\\section{%s}" . "\\section*{%s}")
  				  ("\\subsection{%s}" . "\\subsection*{%s}")
  				  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				  ("\\paragraph{%s}" . "\\paragraph*{%s}")
  				  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
     ;; Alternative Koma Article Name
     (add-to-list 'org-latex-classes
  				'("koma-article"
  				  "\\documentclass[a4paper,
  			parskip=half,%
  			fromalign=right,
  			fromrule=false,
  			11pt
  			]{scrartcl}
  	   [DEFAULT-PACKAGES]
  	   [NO-PACKAGES]
  	   [EXTRA]"
  				  ("\\section{%s}" . "\\section*{%s}")
  				  ("\\subsection{%s}" . "\\subsection*{%s}")
  				  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				  ("\\paragraph{%s}" . "\\paragraph*{%s}")
  				  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

     ;; Add Koma Report
     (add-to-list 'org-latex-classes
  				'("scrreprt"
  				  "\\documentclass[a4paper,
  			parskip=half,%
  			fromalign=right,
  			fromrule=false,
  			11pt
  			]{scrreprt}
  	   [DEFAULT-PACKAGES]
  	   [PACKAGES]
  	   [EXTRA]"
  				  ("\\part{%s}" . "\\part*{%s}")
  				  ("\\chapter{%s}" . "\\chapter*{%s}")
  				  ("\\section{%s}" . "\\section*{%s}")
  				  ("\\subsection{%s}" . "\\subsection*{%s}")
  				  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				  ("\\paragraph{%s}" . "\\paragraph*{%s}")
  				  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
     ;; Alternative Koma Report name
     (add-to-list 'org-latex-classes
  				'("koma-report"
  				  "\\documentclass[a4paper,
  			parskip=half,%
  			fromalign=right,
  			fromrule=false,
  			11pt
  			]{scrreprt}
  	   [DEFAULT-PACKAGES]
  	   [NO-PACKAGES]
  	   [EXTRA]"
  				  ("\\part{%s}" . "\\part*{%s}")
  				  ("\\chapter{%s}" . "\\chapter*{%s}")
  				  ("\\section{%s}" . "\\section*{%s}")
  				  ("\\subsection{%s}" . "\\subsection*{%s}")
  				  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				  ("\\paragraph{%s}" . "\\paragraph*{%s}")
  				  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
     ;; Alternative Koma Report Structure
     (add-to-list 'org-latex-classes
  				'("koma-report-shortened"
  				  "\\documentclass[a4paper,
  			parskip=half,%
  			fromalign=right,
  			fromrule=false,
  			11pt
  			]{scrreprt}
  	   [DEFAULT-PACKAGES]
  	   [NO-PACKAGES]
  	   [EXTRA]"
  				  ("\\chapter{%s}" . "\\chapter*{%s}")
  				  ("\\section{%s}" . "\\section*{%s}")
  				  ("\\subsection{%s}" . "\\subsection*{%s}")
  				  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				  ("\\paragraph{%s}" . "\\paragraph*{%s}")
  				  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))


     ;; Add Koma Book
     (add-to-list 'org-latex-classes
  				'("scrbook"
  				  "\\documentclass[a4paper,
  			parskip=half,%
  			fromalign=right,
  			fromrule=false,
  			11pt
  			]{scrbook}
  	   [DEFAULT-PACKAGES]
  	   [PACKAGES]
  	   [EXTRA]"
  				  ("\\part{%s}" . "\\part*{%s}")
  				  ("\\chapter{%s}" . "\\chapter*{%s}")
  				  ("\\section{%s}" . "\\section*{%s}")
  				  ("\\subsection{%s}" . "\\subsection*{%s}")
  				  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				  ("\\paragraph{%s}" . "\\paragraph*{%s}")
  				  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
     ;; Alternative Koma Book name
     (add-to-list 'org-latex-classes
  				'("koma-book"
  				  "\\documentclass[a4paper,
  			parskip=half,%
  			fromalign=right,
  			fromrule=false,
  			11pt
  			]{scrbook}
  	   [DEFAULT-PACKAGES]
  	   [NO-PACKAGES]
  	   [EXTRA]"
  				  ("\\part{%s}" . "\\part*{%s}")
  				  ("\\chapter{%s}" . "\\chapter*{%s}")
  				  ("\\section{%s}" . "\\section*{%s}")
  				  ("\\subsection{%s}" . "\\subsection*{%s}")
  				  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				  ("\\paragraph{%s}" . "\\paragraph*{%s}")
  				  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))))

#+end_src
**** Koma Letter
#+begin_src emacs-lisp
  ;; Koma Letter Export Classes
  (eval-after-load 'ox-koma-letter
    '(progn
       (add-to-list 'org-latex-classes
    				'("scrlttr2"
    				  "\\documentclass\{scrlttr2\}
     \[DEFAULT-PACKAGES]
     \[PACKAGES]
     \[EXTRA]"))
       (add-to-list 'org-latex-classes
    				'("scrlttr2-german"
    				  "\\documentclass[a4paper,
    			parskip=half,%
    			fromalign=right,
    			fromrule=false,
    			11pt,
    			ngerman]{scrlttr2}
    	   [NO-DEFAULT-PACKAGES]
    	   [PACKAGES]
    	   [EXTRA]"
    				  ("\\section{%s}" . "\\section*{%s}")
    				  ("\\subsection{%s}" . "\\subsection*{%s}")
    				  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
    				  ("\\paragraph{%s}" . "\\paragraph*{%s}")
    				  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
       (add-to-list 'org-latex-classes
    				'("koma-letter"
    				  "\\documentclass[a4paper,
    			parskip=half,
    			fromalign=right,
    			fromrule=true,
    			11pt,
    			ngerman
    			]{scrlttr2}
    	   [NO-DEFAULT-PACKAGES]
    	   [PACKAGES]
    	   [EXTRA]"
    				  ("\\section{%s}" . "\\section*{%s}")
    				  ("\\subsection{%s}" . "\\subsection*{%s}")
    				  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
    				  ("\\paragraph{%s}" . "\\paragraph*{%s}")
    				  ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

       ;; Set Default Letter Class
       (setq org-koma-letter-default-class "scrlttr2")
       ;; Use Backaddress by default
       (setq org-koma-letter-use-backaddress t)))

#+end_src
** Org Babel Languages
*** Additional Org Babel Language Support
**** Org Babel Rust
Load [[https://github.com/micanzhang/ob-rust/tree/be059d231fafeb24a658db212a55ccdc55c0c500][GitHub.com: MicanzHang - ob-rust]]
:NOTE:
This Package currently requires =rust-script= to be installed.
To add it run (asuming =rust= or =rustup= are installed):
#+begin_src shell
  cargo install rust-script
#+end_src
:END:
#+begin_src emacs-lisp
  ;; Load Rust Support for Org Mode
  (use-package ob-rust)

#+end_src
**** Org Babel Nix
Load [[https://codeberg.org/theesm/ob-nix][CodeBerg.org: Theesm - ob-nix]]
#+begin_src emacs-lisp
  ;; Load Nix Support for Org Mode
  (use-package ob-nix)

#+end_src
**** Use Ipython with Org
The package [[https://github.com/gregsexton/ob-ipython][ob-ipython]] is require get [[id:5fe7783f-d441-40a9-983c-7f671966c6e1][ipython]]-like functionality in [[id:8510330a-9746-4684-ba60-04255df37924][Org Mode]] WIP

#+begin_src emacs-lisp :tangle no
  ;; (use-package ob-ipython)

#+end_src
*** Org Babel Language Configuration
To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use. [[file:~/Projects/InfoFiles/Emacs/Worg/org-contrib/babel/languages/index.org][Org Babel Supported Languages]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp
  ;; (require 'ob-ledger)
  ;; (require-package 'ob-ipython)

  ;; enable/disable languages for org-babel
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)    ;; Elisp
      (lisp . t)          ;; Lisp
      (clojure . t)       ;; Clojure
      (scheme . t)        ;; Scheme
      (python . t)        ;; Python
      ;; (ipython . t)       ;; IPython

      ;;  the following two require ob-c
      (C . t)             ;; C

      (perl . t)          ;; Perl
      ;; (php . t)           ;; PHP
      (R . t)             ;; R
      ;; (Ruby . t)          ;; Ruby
      (rust . t)          ;; Rust
      (julia . t)         ;; Julia Programmin Language
      (lua . t)           ;; Lua Programming Language
      (shell . t)         ;; Command Line Programs
      (latex . t)         ;; LaTeX
      (nix . t)           ;; Nix
      (sql . t)           ;; SQL
      (sqlite . t)        ;; SQLite
      (octave . t)        ;; Octave
      (makefile . t)          ;; GNU Make
      (gnuplot . t)       ;; Gnuplot
      (awk . t)           ;; awk
      (sed . t)           ;; GNUsed
      (css . t)           ;; CSS
      (plantuml . t)      ;; PlantUML
      (ledger . t)        ;; Ledger CLI
      ))

  ;; Add conf-unix to be recognized
  (push '("conf-unix" . conf-unix) org-src-lang-modes)

#+end_src
