C01_EmacsConfiguration/.emacs.d/package_configs/org_config.el
   ;; Add Koma Article
   (add-to-list 'org-latex-classes
  			      '("scrartcl"
  				"\\documentclass[a4paper, 
  		      parskip=half,%
  		      fromalign=right, 
  		      fromrule=false, 
  		      11pt
  		      ]{scrartcl}
  	 [DEFAULT-PACKAGES]
  	 [PACKAGES]
  	 [EXTRA]"
  				("\\section{%s}" . "\\section*{%s}")
  				("\\subsection{%s}" . "\\subsection*{%s}")
  				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				("\\paragraph{%s}" . "\\paragraph*{%s}")
  				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
   ;; Alternative Koma Article Name
   (add-to-list 'org-latex-classes
  			      '("koma-article"
  				"\\documentclass[a4paper, 
  		      parskip=half,%
  		      fromalign=right, 
  		      fromrule=false, 
  		      11pt
  		      ]{scrartcl}
  	 [DEFAULT-PACKAGES]
  	 [NO-PACKAGES]
  	 [EXTRA]"
  				("\\section{%s}" . "\\section*{%s}")
  				("\\subsection{%s}" . "\\subsection*{%s}")
  				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				("\\paragraph{%s}" . "\\paragraph*{%s}")
  				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

   ;; Add Koma Report
   (add-to-list 'org-latex-classes
  			      '("scrreprt"
  				"\\documentclass[a4paper, 
  		      parskip=half,%
  		      fromalign=right, 
  		      fromrule=false, 
  		      11pt
  		      ]{scrreprt}
  	 [DEFAULT-PACKAGES]
  	 [PACKAGES]
  	 [EXTRA]"
  				("\\part{%s}" . "\\part*{%s}")
  				("\\chapter{%s}" . "\\chapter*{%s}")
  				("\\section{%s}" . "\\section*{%s}")
  				("\\subsection{%s}" . "\\subsection*{%s}")
  				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				("\\paragraph{%s}" . "\\paragraph*{%s}")
  				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
   ;; Alternative Koma Report name
   (add-to-list 'org-latex-classes
  			      '("koma-report"
  				"\\documentclass[a4paper, 
  		      parskip=half,%
  		      fromalign=right, 
  		      fromrule=false, 
  		      11pt
  		      ]{scrreprt}
  	 [DEFAULT-PACKAGES]
  	 [NO-PACKAGES]
  	 [EXTRA]"
  				("\\part{%s}" . "\\part*{%s}")
  				("\\chapter{%s}" . "\\chapter*{%s}")
  				("\\section{%s}" . "\\section*{%s}")
  				("\\subsection{%s}" . "\\subsection*{%s}")
  				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				("\\paragraph{%s}" . "\\paragraph*{%s}")
  				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
   ;; Alternative Koma Report Structure
   (add-to-list 'org-latex-classes
  			      '("koma-report-shortened"
  				"\\documentclass[a4paper, 
  		      parskip=half,%
  		      fromalign=right, 
  		      fromrule=false, 
  		      11pt
  		      ]{scrreprt}
  	 [DEFAULT-PACKAGES]
  	 [NO-PACKAGES]
  	 [EXTRA]"
  				("\\chapter{%s}" . "\\chapter*{%s}")
  				("\\section{%s}" . "\\section*{%s}")
  				("\\subsection{%s}" . "\\subsection*{%s}")
  				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				("\\paragraph{%s}" . "\\paragraph*{%s}")
  				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))


   ;; Add Koma Book
   (add-to-list 'org-latex-classes
  			      '("scrbook"
  				"\\documentclass[a4paper, 
  		      parskip=half,%
  		      fromalign=right, 
  		      fromrule=false, 
  		      11pt
  		      ]{scrbook}
  	 [DEFAULT-PACKAGES]
  	 [PACKAGES]
  	 [EXTRA]"
  				("\\part{%s}" . "\\part*{%s}")
  				("\\chapter{%s}" . "\\chapter*{%s}")
  				("\\section{%s}" . "\\section*{%s}")
  				("\\subsection{%s}" . "\\subsection*{%s}")
  				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				("\\paragraph{%s}" . "\\paragraph*{%s}")
  				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
   ;; Alternative Koma Book name
   (add-to-list 'org-latex-classes
  			      '("koma-book"
  				"\\documentclass[a4paper, 
  		      parskip=half,%
  		      fromalign=right, 
  		      fromrule=false, 
  		      11pt
  		      ]{scrbook}
  	 [DEFAULT-PACKAGES]
  	 [NO-PACKAGES]
  	 [EXTRA]"
  				("\\part{%s}" . "\\part*{%s}")
  				("\\chapter{%s}" . "\\chapter*{%s}")
  				("\\section{%s}" . "\\section*{%s}")
  				("\\subsection{%s}" . "\\subsection*{%s}")
  				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  				("\\paragraph{%s}" . "\\paragraph*{%s}")
  				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))))

;; Koma Letter Export Classes
(eval-after-load 'ox-koma-letter
  '(progn
     (add-to-list 'org-latex-classes
    			      '("scrlttr2"
    				"\\documentclass\{scrlttr2\}
   \[DEFAULT-PACKAGES]
   \[PACKAGES]
   \[EXTRA]"))
     (add-to-list 'org-latex-classes
    			      '("scrlttr2-german"
    				"\\documentclass[a4paper, 
    		      parskip=half,%
    		      fromalign=right, 
    		      fromrule=false, 
    		      11pt, 
    		      ngerman]{scrlttr2}
    	 [NO-DEFAULT-PACKAGES]
    	 [PACKAGES]
    	 [EXTRA]"
    				("\\section{%s}" . "\\section*{%s}")
    				("\\subsection{%s}" . "\\subsection*{%s}")
    				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
    				("\\paragraph{%s}" . "\\paragraph*{%s}")
    				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
     (add-to-list 'org-latex-classes
    			      '("koma-letter"
    				"\\documentclass[a4paper,
    		      parskip=half,
    		      fromalign=right,
    		      fromrule=true,
    		      11pt,
    		      ngerman
    		      ]{scrlttr2}
    	 [NO-DEFAULT-PACKAGES]
    	 [PACKAGES]
    	 [EXTRA]"
    				("\\section{%s}" . "\\section*{%s}")
    				("\\subsection{%s}" . "\\subsection*{%s}")
    				("\\subsubsection{%s}" . "\\subsubsection*{%s}")
    				("\\paragraph{%s}" . "\\paragraph*{%s}")
    				("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

     ;; Set Default Letter Class
     (setq org-koma-letter-default-class "scrlttr2")
     ;; Use Backaddress by default
     (setq org-koma-letter-use-backaddress t)))

;; Load Rust Support for Org Mode
(use-package ob-rust)

;; Load Nix Support for Org Mode
(use-package ob-nix)

;; (require 'ob-ledger)
;; (require-package 'ob-ipython)

;; enable/disable languages for org-babel
(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)    ;; Elisp
    (lisp . t)          ;; Lisp
    (clojure . t)       ;; Clojure     
    (scheme . t)        ;; Scheme
    (python . t)        ;; Python
    ;; (ipython . t)       ;; IPython

    ;;  the following two require ob-c
    (C . t)             ;; C 

    (perl . t)          ;; Perl
    ;; (php . t)           ;; PHP
    (R . t)             ;; R
    ;; (Ruby . t)          ;; Ruby
    (rust . t)          ;; Rust
    (julia . t)         ;; Julia Programmin Language
    (lua . t)           ;; Lua Programming Language
    (shell . t)         ;; Command Line Programs 
    (latex . t)         ;; LaTeX  
    (nix . t)           ;; Nix
    (sql . t)           ;; SQL
    (sqlite . t)        ;; SQLite
    (octave . t)        ;; Octave
    (makefile . t)          ;; GNU Make
    (gnuplot . t)       ;; Gnuplot
    (awk . t)           ;; awk
    (sed . t)           ;; GNUsed
    (css . t)           ;; CSS
    (plantuml . t)      ;; PlantUML
    (ledger . t)        ;; Ledger CLI
    ))

;; Add conf-unix to be recognized
(push '("conf-unix" . conf-unix) org-src-lang-modes)
