000_OrgFiles/EmacsConfig.org
** Structure Templates

[[id:8510330a-9746-4684-ba60-04255df37924][Org Mode]]’s =structure templates= feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing =<= followed by the template name like el or py and then press TAB. For example, to insert an empty ~emacs-lisp~ block below, you can type =<se= and press TAB to expand into such a block.

The second part to the [[id:59b9aa51-d637-43f5-b4c6-645bc7be0bc9][cons cell]] to contain the *name* of the ~language~ as it is known by [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][Org Babel]]. (see =org-src-lang-modes=)

~Org-tempo~ is not a separate package but a module within ~org-mode~ that can be enabled.
~Org-tempo~ allows for =‘<s’= followed by =TAB= to expand to a =begin_src=-~tag~.

+ Other ~expansions~ available include (Typing the below + =TAB=):

|-------+-----------------------------------------|
| Short | Expands to …                            |
|-------+-----------------------------------------|
| <a    | ’#+BEGIN_EXPORT ascii’ … ‘#+END_EXPORT  |
| <c    | ’#+BEGIN_CENTER’ … ‘#+END_CENTER’       |
| <C    | ’#+BEGIN_COMMENT’ … ‘#+END_COMMENT’     |
| <e    | ’#+BEGIN_EXAMPLE’ … ‘#+END_EXAMPLE’     |
| <E    | ’#+BEGIN_EXPORT’ … ‘#+END_EXPORT’       |
| <h    | ’#+BEGIN_EXPORT html’ … ‘#+END_EXPORT’  |
| <l    | ’#+BEGIN_EXPORT latex’ … ‘#+END_EXPORT’ |
| <q    | ’#+BEGIN_QUOTE’ … ‘#+END_QUOTE’         |
| <s    | ’#+BEGIN_SRC’ … ‘#+END_SRC’             |
| <v    | ’#+BEGIN_VERSE’ … ‘#+END_VERSE’         |
|-------+-----------------------------------------|

#+begin_src emacs-lisp
  ;; Load Org-Tempo Module (needed as of Org 9.2)
  (require 'org-tempo)

  ;; Setup Source Block Templates
  (cl-loop for block in
		   '(;; AWK
			 ("aw"   . "src awk")
			 ;; C and Cpp
			 ("cs"   . "src C")
			 ("cp"   . "src C++")
			 ;; Emacs-Lisp
			 ("el"   . "src emacs-lisp")
			 ;; JSON
			 ("json" . "src json")
			 ;; Lua
			 ("lua"  . "src lua")
			 ;; Ledger
			 ("ldg"  . "src ledger :noweb yes")
			 ;; LaTeX
			 ("ltx"   . "src latex")
			 ;; Nix
			 ("nix"   . "src nix")
			 ;; Makefile
			 ("mf"   . "src makefile")
			 ;; Octave
			 ("oc"   . "src octave")
			 ;; Perl
			 ("perl" . "src perl")
			 ;; PHP
			 ("ph"   . "src php")
			 ;; Python
			 ("py"   . "src python")
			 ;; Scheme
			 ("sc"   . "src scheme")
			 ;; Shell
			 ("sh"   . "src shell")
			 ;; SQL
			 ("sql"   . "src sql")
			 ;; YAML
			 ("yaml" . "src yaml")
			 ;; R
			 ("rp"   . "src R")                                  ;; pure R
			 ("rr"   . "src R :results both output")             ;; R with output
			 ("rs"   . "src R :session :results both output")    ;; R with output
			 ;; Rust
			 ("ru"   . "src rust ")    ;; pure rust

			 ;; ("go" . "src go")
			 ;; ("ip" . "src ipython :session :async :exports both :results raw drawer")
			 ;; ("ts" . "src typescript"))
			 ;; This is an alternative Block
			 ;; For IPython
			 ;; ("si" . "src ipython :session :async :results output")
			 )
		   do
		   (add-to-list
			'org-structure-template-alist block))

#+end_src
