C01_EmacsConfiguration/.emacs.d/package_configs/org_config.el

;; Load Org-Tempo Module (needed as of Org 9.2)
(require 'org-tempo)

;; Setup Source Block Templates
(cl-loop for block in
		 '(;; AWK
		       ("aw"   . "src awk")
		       ;; C and Cpp
		       ("cs"   . "src C")
		       ("cp"   . "src C++")
		       ;; Emacs-Lisp
		       ("el"   . "src emacs-lisp")
		       ;; JSON
		       ("json" . "src json")
		       ;; Lua
		       ("lua"  . "src lua")
		       ;; Ledger
		       ("ldg"  . "src ledger :noweb yes")
		       ;; LaTeX
		       ("ltx"   . "src latex")
		       ;; Nix
		       ("nix"   . "src nix")
		       ;; Makefile
		       ("mf"   . "src makefile")
		       ;; Octave
		       ("oc"   . "src octave")
		       ;; Perl
		       ("perl" . "src perl")
		       ;; PHP
		       ("ph"   . "src php")
		       ;; Python
		       ("py"   . "src python")
		       ;; Scheme
		       ("sc"   . "src scheme")
		       ;; Shell
		       ("sh"   . "src shell")
		       ;; SQL
		       ("sql"   . "src sql")
		       ;; YAML
		       ("yaml" . "src yaml")
		       ;; R
		       ("rp"   . "src R")                                  ;; pure R             
		       ("rr"   . "src R :results both output")             ;; R with output
		       ("rs"   . "src R :session :results both output")    ;; R with output
		       ;; Rust
		       ("ru"   . "src rust ")    ;; pure rust

		       ;; ("go" . "src go")
		       ;; ("ip" . "src ipython :session :async :exports both :results raw drawer")
		       ;; ("ts" . "src typescript"))
		       ;; This is an alternative Block
		       ;; For IPython
		       ;; ("si" . "src ipython :session :async :results output")
		       )
		 do
		 (add-to-list
		      'org-structure-template-alist block))

;; Org-Capture
