C01_EmacsConfiguration/.emacs.d/package_configs/org_config.el
(use-package org-capture
  :straight nil
  :init

  ;; Org Capture helper Variables

  ;; Save default Org Capture Template Dir
  (setq pet/org-cap-temp-dir
        (concat pet/temp-dir
                (convert-standard-filename
                 "X1_Emacs_Templates/Org_Capture_Templates/"
                 )))

  ;; Org Capture helper Function

  ;; Get filename and store at current directory
  (defun pet/get-file-name-without-extension ()
    "Ask user for filename"
    (interactive)
    (let ((name (read-string "Filename: ")))
      (expand-file-name name))
    )
  ;; Get filename with ".org" and store at current directory
  (defun pet/get-org-file-name ()
    "Ask user for filename"
    (interactive)
    (let ((name (read-string "Filename: ")))
      (expand-file-name
       (format "%s.org" name)))
    )

  :config
  ;; Set default file for capture if not specified
  (setq org-default-notes-file
        (concat pet/home-dir "Projects/Notes/notes.org"))

  (setq org-capture-templates
        ;; Acronym captures
        `(("a" "Acronyms" table-line
           (file+headline "~/Org/acronyms.org" "Inbox")
           "| %^{ACRONYM} | %^{DEFINITION} | %^{DESCRIPTION}|")

          ;; Documents
          ("d" "Documents")
          ("dl" "Letter")
          ("dlf" "Letter Form" plain (file pet/get-org-file-name)
           "%[~/.dotfiles/00_OrgFiles/Templates/Capture-LetterTemp.org]"
           :if-new (file "${slug}.org" "#+TITLE: ${title}\n")
           :unnarrowed t
           )
          ("dlh" "Letter Home" plain (file pet/get-org-file-name)
           "%[~/Templates/X1_Emacs_Templates/Capture-LetterTemp-Filled-Home-Real.org]"
           :if-new (file "${slug}.org" "#+TITLE: ${title}\n")
           :unnarrowed t
           )
          ("do" "Org File")
          ("dod" "Default Org File"
           plain
           (file pet/get-org-writing-file-name)
           "#+TITLE: ${title}\n%[~/Templates/X1_Emacs_Templates/Org_Capture_Templates/default-org-file.orgctemp]"
           :unnarrowed t
           )


          ;; Email captures
          ("e" "Email")
          ("em" "Make email note" entry
           (file+headline "~/Org/personal-tasks.org" "Mail correspondence")
           ,(concat "* TODO [#A] %:subject :mail:\n"
                    "SCHEDULED: %t\n:"
                    "PROPERTIES:\n:CONTEXT: %a\n:END:\n\n"
                    "%i%?"))
          ("ef" "Follow Up" entry (file+olp "~/Org/personal-mail.org" "Follow Up")
           "* TODO Follow up with %:fromname on %a\nSCHEDULED:%t\nDEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))\n\n%i \n\n" :immediate-finish t)
          ("er" "Read Later" entry (file+olp "~/Org/personal-mail.org" "Read Later")
           "* TODO Read %:subject %a\nSCHEDULED:%t\nDEADLINE: %(org-insert-time-stamp (org-read-date nil t \"+2d\"))\n\n%i \n\n" :immediate-finish t)


       ;; Journal captures
          ("j" "Journal Entries")
          ("jj" "Journal" entry
           (file+olp+datetree "~/Org/journal/journal.org")
           "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
           ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
           :clock-in :clock-resume
           :empty-lines 1)
          ("jm" "Meeting" entry
           (file+olp+datetree "~/Org/journal/journal.org")
           "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
           :clock-in :clock-resume
           :empty-lines 1)

          ;; Checklist captures
          ("l" "Lists")

          ("ls" "Shopping List" checkitem
           (file+olp "~/Org/lists-shopping.org" "Inbox")
           "[ ] %^{Itemname}")

          ("ll" "Literature" checkitem
           (file+olp "~/Org/lists-literature.org" "Inbox")
           "[ ] %^{Author} - %^{Titel}")

          ("lm" "Music" checkitem
           (file+olp "~/Org/lists-music.org" "Inbox")
           "[ ] %^{Interpret} - %^{Title}")

          ("q" "Quotes" entry
           (file+olp "~/Org/quotes.org" "Inbox")
           "* %^{Originator}\n\n#+begin_quote\n%?\n#+end_quote")

          ("t" "Tasks / Projects")
          ("tt" "TODO Task" entry (file+olp
                                   "~/Org/personal-tasks.org" "Inbox")
           "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)  
          ("tb" "Basic task for future review" entry
           (file+headline "~/Org/personal-tasks.org" "Inbox")
           ,(concat "* %^{Title}\n"
                    ":PROPERTIES:\n"
                    ":CAPTURED: %U\n"
                    ":END:\n\n"
                    "%i%l"))
          ("ts" "Task with a due date (scheduled)" entry
           (file+headline "~/Org/personal-tasks.org" "Inbox")
           ,(concat "* %^{Scope of task||TODO|STUDY|MEET} %^{Title} %^g\n"
                    "SCHEDULED: %^t\n"
                    ":PROPERTIES:\n:CAPTURED: %U\n:END:\n\n"
                    "%i%?"))
          ("td" "Task with a due date (deadline)" entry
           (file+headline "~/Org/personal-tasks.org" "Inbox")
           ,(concat "* %^{Scope of task||TODO|STUDY|MEET} %^{Title} %^g\n"
                    "DEADLINE: %^t\n"
                    ":PROPERTIES:\n:CAPTURED: %U\n:END:\n\n"
                    "%i%?"))

          ("w" "Workflows")
          ("we" "Checking Email" entry (file+olp+datetree "~/Org/journal/Journal.org")
           "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)))

  ;; Activate Context Templates for Email 
  (setq org-capture-templates-contexts
    '(("e" ((in-mode . "notmuch-search-mode")
            (in-mode . "notmuch-show-mode")
            (in-mode . "notmuch-tree-mode")
            (in-mode . "mu4e-headers-mode")))))
  :bind
  ("C-c c" . org-capture))

;; Setup Org Bullets
(use-package org-bullets
      :after org)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

;; Automatically create ToCs
(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
