000_OrgFiles/EmacsConfig.org
*** Org Roam
[[https://www.orgroam.com/][Org Roam]] is a very handy extension that enables you to fulfill your own personal ~Zettelkasten~ in [[id:8510330a-9746-4684-ba60-04255df37924][Org]]

  #+begin_src emacs-lisp
    ;; Org Roam is very handy to create a 'second brain'
    (use-package org-roam
      :init
      (setq org-roam-v2-ack t)
      :custom
      (org-roam-directory pet/org-dir)
      (org-roam-dailies-directory "journal/")

      (org-roam-completion-everywhere t)

      :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n I" . org-roam-node-insert-immediate)
         :map org-mode-map
         ("C-M-i"    . completion-at-point)
         :map org-roam-dailies-map
         ("Y" . org-roam-dailies-capture-yesterday)
         ("T" . org-roam-dailies-capture-tomorrow))
      :bind-keymap
      ("C-c n d" . org-roam-dailies-map)
      :config
      ;; org roam capture templates
      (setq org-roam-capture-templates
        `(("d" "default" plain
           "%?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n#+DATE: %U\n")
           :unnarrowed t)
          ("w" "wiki")
          ("wn" "wiki node" plain
           "\n* ${title}\n\n%?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                  "\n#+filetags: :%^{filetag}:\n#+TITLE: ${title}\n#+AUTHOR: %^{author}\n#+DATE: %U\n\n")
           :unnarrowed t)
          ("wi" "wiki index node" plain
           "\n* ${title} Kompendium Index\n\n%?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                      "\n#+filetags: :index:%^{filetag}:\n#+TITLE: ${title}\n#+AUTHOR: %^{author}\n#+DATE: %U\n\n")
           :unnarrowed t)
          ("wr" "wiki references node" plain
           "\n* References\n%?\n** Websites\n\n** Literature"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                      "\n#+filetags: :%^{filetag}:references:\n#+TITLE: ${title}\n#+AUTHOR: %^{author}\n#+DATE: %U\n\n")
           :unnarrowed t)
          ("l" "programming language" plain
           "* Characteristics\n\n- Family: %?\n- Inspired by: \n\n* Reference:\n\n"
           :if-new (file+head "${slug}.org" "#+TITLE: ${title}\n")
           :unnarrowed t)
          ("b" "book notes" plain (file "~/.dotfiles/00_OrgFiles/Templates/RoamCapture-BookNoteTemp.org")
           :if-new (file+head "${slug}.org" "#+TITLE: ${title}\n")
           :unnarrowed t)
          ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
           :if-new (file+head "${slug}.org" "#+TITLE: ${title}\n#+filetags: Project")
           :unnarrowed t)
          ))


       ;; dailies capture template
      (setq org-roam-dailies-capture-templates
        `(("d" "default" entry "* %<%I:%M %p>: %?"
           :if-new (file+head "%<%Y-%m-%d>.org" "#+TITLE: %<%Y-%m-%d>\n"))))

      (org-roam-setup)
      ;; Ensure the keymap is available
      (require 'org-roam-dailies)
      (org-roam-db-autosync-mode)

      (pet/leader-keys
        "or"  '(:ignore t :which-key "Org Roam")
        "ort" 'org-roam-tag-add
        "ora" 'org-roam-alias-add
        "ord" 'org-roam-diagnostics
        "oru" 'org-roam-ui-open
        )
      )

  #+end_src
*** Org Roam Extensions
**** Org Roam Helper Functions
#+begin_src emacs-lisp
  ;; Helper Function to insert org note immediately
  (defun org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (push arg args))
      (org-roam-capture-templates
       (list (append (car org-roam-capture-templates)
    		 '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))

#+end_src
**** Org Roam UI

[[https://github.com/org-roam/org-roam-ui][Org Roam UI]] is a super neat extension that visualizes your ~Org Roam~ ~Note Node Structure~.
It uses a websocket to display that visualization in a webbrowser.
The webserver started will run here: http://127.0.0.1:35901/
#+begin_src emacs-lisp
  ;; A Visualization of your org roam node structure
  (use-package org-roam-ui
    :straight
    (:host github :repo "org-roam/org-roam-ui"
       :branch "main" :files ("*.el" "out"))
    :after org-roam
    ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
    ;;         a hookable mode anymore, you're advised to pick something yourself
    ;;         if you don't care about startup time, use
    ;;  :hook (after-init . org-roam-ui-mode)
   :config
   (setq org-roam-ui-sync-theme t
    org-roam-ui-follow t
    org-roam-ui-update-on-save t
    org-roam-ui-open-on-start t))

#+end_src
*** Org Super Agenda

[[https://github.com/alphapapa/org-super-agenda][Org-Super-Agenda]] enhances the [[id:8510330a-9746-4684-ba60-04255df37924][Org Agenda View]] quite drastically based on group views and more
#+begin_src emacs-lisp
  ;; Rice up the agenda
  (use-package org-super-agenda
    :config
    ;; Specify the groups displayed in the agenda view
    (setq org-super-agenda-groups
   		'(;; The groups have an implicit boolean OR separator between their selectors
  		  (:name "❗ Overdue "  ;
  				 :scheduled past
  				 :order 2
  				 :face 'error)

  		  (:name "Personal "
  				 :and(:file-path "Personal" :not (:tag "event"))
  				 :order 3)

  		  (:name "Family "
  				 :and(:file-path "Family" :not (:tag "event"))
  				 :order 3)

  		  (:name "Studies "
  				 :and(:file-path "Studies " :not (:tag "event"))
  				 :order 3)

  		  (:name "🗓 Today "
  				 :time-grid t
  				 :date today
  				 :scheduled today
  				 :order 1
  				 :face 'warning)))

    ;; Activate org super agenda
    (org-super-agenda-mode t)

    ;; Add Keybindings
    :general
    (:keymaps 'org-super-agenda-header-map
  		"j" '(org-agenda-next-line :wk "Next Agenda Line")
  		"k" '(org-agenda-previous-line :wk "Previous Agenda Line")))

#+end_src
*** Org Ref
Add [[https://github.com/jkitchin/org-ref][Org Ref]] for easier and more streamlined ~Citations~ and ~Cross-References~
#+begin_src emacs-lisp
  ;; Load Org Ref
  (use-package org-ref
	:config
	;; Bibtex Hydra
	;; (define-key bibtex-mode-map (kbd "H-b") 'org-ref-bibtex-hydra/body)
	)

#+end_src
*** Org Drill
~Org Drill~ is a ~spaced repetition program~ (like ~Anki~)  built to work with [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]

The ~Hint-Separator~ is set to =||= from =|=
The ~Left and Right Clozer~-delimiters are set to =<[= and =]>= respectively from the default =[= and =]=.
This is done to better fit in with the [[id:62eadd2d-023b-4d03-8eb0-527528f6e224][LaTeX]]-~Syntax~ used in some notes.
You can find an example file here: [[id:a5bb4b50-f15b-49c5-b2cb-bc80a65c14d6][spanish.org]]

#+begin_src emacs-lisp
  ;; Add Org Drill to use Org as a Anki Backup
  (use-package org-drill
	:config
	(progn
	  (add-to-list 'org-modules 'org-drill)
	  (setq org-drill-add-random-noise-to-intervals-p t)
	  (setq org-drill-hint-separator "||")
	  (setq org-drill-left-cloze-delimiter "<[")
	  (setq org-drill-right-cloze-delimiter "]>")
	  (setq org-drill-learn-fraction 1.0)))

#+end_src
*** Org Auto Tangle
This safes the need for the ~Helper Functions~ below that I used previously
:NOTE:
You need to add =#+auto_tangle: t= to the files you want to use this feature
:END:
#+begin_src emacs-lisp
  ;; Org AddOn Auto Tangle Org Files
  ;; Add '#+auto_tangle: t' to files
  (use-package org-auto-tangle
    :defer t
    :hook (org-mode . org-auto-tangle-mode)
    :config
    (setq org-auto-tangle-default nil))

#+end_src
*** Org Crypt

~Org Crypt~ *encrypts* the *text of an entry*, but *not* the ~headline~, or ~properties~.
Behind the scene, it uses the (=epa=)~Emacs EasyPG Library~ to encrypt and decrypt files, and ~EasyPG~ needs a correct (=gnupg=)[[id:5dc04892-9105-45aa-845a-01b89448d753][GnuPG]] setup.

Any text below a headline that has a =‘crypt’= ~tag~ is automatically encrypted when the file is saved.
To use a *different tag*, customize the =org-crypt-tag-matcher= setting.

Excluding the =‘crypt’= ~tag~ from ~inheritance~ prevents already *encrypted text* from being *encrypted again*.

It’s possible to use ~different keys~ for different headings by specifying the respective key as property =‘CRYPTKEY’=, e.g.:

#+begin_example
  * Totally secret :crypt:
    :PROPERTIES:
    :CRYPTKEY: 0x0123456789012345678901234567890123456789
    :END:
#+end_example

To turn ~auto-save~ off *only locally*, you can insert this:
#+begin_example
# -*- buffer-auto-save-file-name: nil; -*-
#+end_example

#+begin_src emacs-lisp
  (require 'org-crypt)
  (org-crypt-use-before-save-magic)
  (setq org-tags-exclude-from-inheritance '("crypt"))

  (setq org-crypt-key nil)
  ;; GPG key to use for encryption
  ;; Either the Key ID or set to nil to use symmetric encryption.

  ;; (setq auto-save-default nil)
  ;; Auto-saving does not cooperate with org-crypt.el: so you need to
  ;; turn it off if you plan to use org-crypt.el quite often.  Otherwise,
  ;; you'll get an (annoying) message each time you start Org.

  ;; To turn it off only locally, you can insert this:
  ;;
  ;; # -*- buffer-auto-save-file-name: nil; -*-
#+end_src
*** Org Contacts
#+begin_src emacs-lisp :tangle no
  ;; Load Org Contacts as a substitute for EBDB
  (use-package org-contacts
    :after org
    ;; Set Contacts File
    :custom (org-contacts-files (concat pet/org-dir "personal-contacts.org")))

#+end_src
*** Org Modern
#+begin_src emacs-lisp
  ;; Make org look a lot nicer
  (use-package org-modern
    :defer
    :after org
    :hook ((org-mode . org-modern-mode)
           (org-agenda-finalize . org-modern-agenda)))

#+end_src
* Legder Mode
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/ledger_mode_config.el :mkdirp yes
:END:
~Ledger Mode~ is an [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] [[id:1c44cf3c-6549-4e70-a3fd-491df7996dd5][Packages]] that builds on top of the [[id:dec94196-4859-4fe6-be58-4237c61d9fad][CLI Tool]] [[https://www.ledger-cli.org/][Ledger]] for ~Plaintext Accounting~
#+begin_src emacs-lisp
  ;; Add Ledger Mode from Melpa
  ;; (Alternatively include the installation path of ledger to load-path)
  (use-package ledger-mode
    :config
    ;; Add mode Toggle to Keyspace
    (pet/leader-keys
      "tml"   '(ledger-mode :which-key "Ledger Mode"))

    ;; Load mode on .dat files
    :mode "\\.dat\\'")

#+end_src
