C01_EmacsConfiguration/.emacs.d/package_configs/org_config.el

;; Org Roam is very handy to create a 'second brain'
(use-package org-roam
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory pet/org-dir)
  (org-roam-dailies-directory "journal/")

  (org-roam-completion-everywhere t)

  :bind (("C-c n l" . org-roam-buffer-toggle)
     ("C-c n f" . org-roam-node-find)
     ("C-c n i" . org-roam-node-insert)
     ("C-c n I" . org-roam-node-insert-immediate)
     :map org-mode-map
     ("C-M-i"    . completion-at-point)
     :map org-roam-dailies-map
     ("Y" . org-roam-dailies-capture-yesterday)
     ("T" . org-roam-dailies-capture-tomorrow))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  :config
  ;; org roam capture templates
  (setq org-roam-capture-templates
    `(("d" "default" plain
       "%?"
       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n#+DATE: %U\n")
       :unnarrowed t)
      ("w" "wiki")
      ("wn" "wiki node" plain
       "\n* ${title}\n\n%?" 
       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
              "\n#+filetags: :%^{filetag}:\n#+TITLE: ${title}\n#+AUTHOR: %^{author}\n#+DATE: %U\n\n")
       :unnarrowed t)
      ("wi" "wiki index node" plain
       "\n* ${title} Kompendium Index\n\n%?" 
       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                  "\n#+filetags: :index:%^{filetag}:\n#+TITLE: ${title}\n#+AUTHOR: %^{author}\n#+DATE: %U\n\n")
       :unnarrowed t)
      ("wr" "wiki references node" plain
       "\n* References\n%?\n** Websites\n\n** Literature" 
       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                  "\n#+filetags: :%^{filetag}:references:\n#+TITLE: ${title}\n#+AUTHOR: %^{author}\n#+DATE: %U\n\n")
       :unnarrowed t)
      ("l" "programming language" plain
       "* Characteristics\n\n- Family: %?\n- Inspired by: \n\n* Reference:\n\n"
       :if-new (file+head "${slug}.org" "#+TITLE: ${title}\n")
       :unnarrowed t)  
      ("b" "book notes" plain (file "~/.dotfiles/00_OrgFiles/Templates/RoamCapture-BookNoteTemp.org")
       :if-new (file+head "${slug}.org" "#+TITLE: ${title}\n")
       :unnarrowed t)
      ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
       :if-new (file+head "${slug}.org" "#+TITLE: ${title}\n#+filetags: Project")
       :unnarrowed t)
      ))


   ;; dailies capture template
  (setq org-roam-dailies-capture-templates
    `(("d" "default" entry "* %<%I:%M %p>: %?"
       :if-new (file+head "%<%Y-%m-%d>.org" "#+TITLE: %<%Y-%m-%d>\n"))))

  (org-roam-setup)
  ;; Ensure the keymap is available
  (require 'org-roam-dailies)
  (org-roam-db-autosync-mode)

  (pet/leader-keys
    "or"  '(:ignore t :which-key "Org Roam")
    "ort" 'org-roam-tag-add
    "ora" 'org-roam-alias-add
    "ord" 'org-roam-diagnostics
    "oru" 'org-roam-ui-open
    )
  )

;; Helper Function to insert org note immediately
(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (push arg args))
    (org-roam-capture-templates
     (list (append (car org-roam-capture-templates)
    	       '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))

;; A Visualization of your org roam node structure
(use-package org-roam-ui
  :straight
  (:host github :repo "org-roam/org-roam-ui"
     :branch "main" :files ("*.el" "out"))
  :after org-roam
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  ;;  :hook (after-init . org-roam-ui-mode)
 :config
 (setq org-roam-ui-sync-theme t
  org-roam-ui-follow t
  org-roam-ui-update-on-save t
  org-roam-ui-open-on-start t))

;; Load Org Ref
(use-package org-ref
      :config
      ;; Bibtex Hydra
      ;; (define-key bibtex-mode-map (kbd "H-b") 'org-ref-bibtex-hydra/body)
      )

;; Add Org Drill to use Org as a Anki Backup
(use-package org-drill
      :config
      (progn
	(add-to-list 'org-modules 'org-drill)
	(setq org-drill-add-random-noise-to-intervals-p t)
	(setq org-drill-hint-separator "||")
	(setq org-drill-left-cloze-delimiter "<[")
	(setq org-drill-right-cloze-delimiter "]>")
	(setq org-drill-learn-fraction 1.0)))

;; Org AddOn Auto Tangle Org Files
;; Add '#+auto_tangle: t' to files 
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default nil))

(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance '("crypt"))

(setq org-crypt-key nil)
;; GPG key to use for encryption
;; Either the Key ID or set to nil to use symmetric encryption.

;; (setq auto-save-default nil)
;; Auto-saving does not cooperate with org-crypt.el: so you need to
;; turn it off if you plan to use org-crypt.el quite often.  Otherwise,
;; you'll get an (annoying) message each time you start Org.

;; To turn it off only locally, you can insert this:
;;
;; # -*- buffer-auto-save-file-name: nil; -*-

;; Make org look a lot nicer
(use-package org-modern
  :defer
  :after org
  :hook ((org-mode . org-modern-mode)
         (org-agenda-finalize . org-modern-agenda)))
