000_OrgFiles/EmacsConfig.org
* Citeproc
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/citeproc_config.el :mkdirp yes
:END:
[[https://github.com/andras-simonyi/citeproc-el][Citeproc]] is needed for [[https://citationstyles.org/][CSL]] ~Citation styles~
#+begin_src emacs-lisp
  ;; Add Citeproc for CSL style Citations
  (use-package citeproc)

#+end_src
* Mail
** mu4e
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/mu4e_config.el :mkdirp yes
:END:

[[id:6cdf0fb1-747c-44b6-9135-41c191bfcf34][mu4e]] (~mu-for-emacs~) is an e-mail client for [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][GNU Emacs]] built on top of the =mu= ~e-mail search engine~ for the [[id:bf9b9431-2e38-411a-904f-c5b0c913520d][Command Line]].
Documentation can be found here: [[https://www.djcbsoftware.nl/code/mu/mu4e/][DJCBSoftware: mu4e]]
#+begin_src emacs-lisp
  ;; Store Location of Account Settings
  (setq pet/mail-accounts-config
  		(concat pet/home-dir
  				(convert-standard-filename
  				 ".dotfiles-private/Configurations/C2-Emacs/MailAccounts.el")))

  ;; Load mu4e as a Mail Interface for mu
  (use-package mu4e
    :straight nil
    :defer 20 ; Wait until 20 seconds after startup
    :config

    ;; Load org-mode integration
    (require 'mu4e-org)

    ;; Refresh mail using isync/mbsync every 10 minutes
    (setq mu4e-update-interval (* 10 60))
    (setq mu4e-get-mail-command "mbsync --all")
    (setq mu4e-maildir (concat pet/home-dir "Mail"))

    ;; Sets the standard download directory for attachments
    ;; (default: '~/')
    (setq mu4e-attachment-dir (concat pet/home-dir "Downloads"))

    ;; Use Ivy for mu4e completions (maildir folders, etc)
    (setq mu4e-completing-read-function #'ivy-completing-read)

    ;; Make sure that moving a message (like to Trash) causes the
    ;; message to get a new file name.  This helps to avoid the
    ;; dreaded "UID is N beyond highest assigned" error.
    ;; See this link for more info: https://stackoverflow.com/a/43461973
    (setq mu4e-change-filenames-when-moving t)

    ;; don't keep message buffers around
    (setq message-kill-buffer-on-exit t)

    ;; Load external file with Account information
    (pet/load-file pet/mail-accounts-config)

    ;; Sets the first context (specified in file above)
    ;; to be loaded by default
    ;; (Options: pick-first, ask, ask-if-none, always-ask)
    (setq mu4e-context-policy 'pick-first)

    ;; Don't ask to quit
    (setq mu4e-confirm-quit nil)

    ;; Set Contacts file for Org Contacts interaction
    (setq mu4e-org-contacts-file
  		(concat pet/org-dir "personal-contacts.org"))

    ;; COMPOSING MAIL

    ;; Don't include oneself in reply by default
    (setq mu4e-compose-dont-reply-to-self t)

    ;; ISO(ish) format date-time stamps in the header list
    ;; default is "%x" (locale appropriate)
    (setq  mu4e-headers-date-format "%Y-%m-%d %H:%M")

    ;; customize the reply-quote-string
    (setq message-citation-line-format
  		"On %Y-%m-%d %H:%M %Z %N wrote:\n")
    ;; Replace 'message-insert-citation-line' with
    ;; 'message-insert-formatted-citation-line'
    (setq message-citation-line-function
  		'message-insert-formatted-citation-line)

    ;; HELPER FUNCTIONS

    ;; Function to store header queries to reuse them later
    (defun pet/store-link-to-mu4e-query()
  	(interactive)
  	(let ((mu4e-org-link-query-in-headers-mode t))
  	  (call-interactively 'org-store-link)))

    ;; Functions to automatically call Org Capture Templates on certain actions
    ;; Follow up messages
    (defun pet/capture-mail-follow-up (msg)
  	(interactive)
  	(call-interactively 'org-store-link)
  	(org-capture nil "ef"))
    ;; Read later messages
    (defun pet/capture-mail-read-later (msg)
  	(interactive)
  	(call-interactively 'org-store-link)
  	(org-capture nil "er"))

    ;; Add custom actions for our capture templates
    (add-to-list 'mu4e-headers-actions
  			   '("follow up" . pet/capture-mail-follow-up) t)
    (add-to-list 'mu4e-view-actions
  			   '("follow up" . pet/capture-mail-follow-up) t)
    (add-to-list 'mu4e-headers-actions
  			   '("read later" . pet/capture-mail-read-later) t)
    (add-to-list 'mu4e-view-actions
  			   '("read later" . pet/capture-mail-read-later) t)

    (bind-keys
     :map mu4e-headers-mode-map

     ("{" . mu4e-headers-query-prev)             ; differs from built-in
     ("}" . mu4e-headers-query-next)             ; differs from built-in

     ("´" . mu4e-update-mail-and-index)          ; differs from built-in
     ("|" . mu4e-view-pipe)               	     ; does not seem to be built in any longer
     ("." . hydra-mu4e-headers/body))

    ;; Expand personal Keyspace
    (pet/leader-keys
  	"m"  '(:ignore t :which-key "Mail")
  	"mm" 'mu4e
  	"mc" 'mu4e-compose-new
  	"ms" 'mu4e-update-mail-and-index))

#+end_src
*** mu4e-alert

[[https://github.com/iqbalansari/mu4e-alert][mu4e-alert]] sends ~Notifications~ to your ~notifications daemon/window manager~
#+begin_src emacs-lisp
  ;; Sent alerts for received
  (use-package mu4e-alert
    :after mu4e
    :config
    ;; Show unread emails from all inboxes
    (when (boundp 'pet/mu4e-inbox-query-new)
      (setq mu4e-alert-interesting-mail-query
            pet/mu4e-inbox-query-new))

    ;; Show notifications for mails already notified
    (setq mu4e-alert-notify-repeated-mails nil)

    ;; Display symbol for received mails on mode line
    (mu4e-alert-enable-mode-line-display)
    ;; Enalbe Notifications
    (mu4e-alert-enable-notifications))

#+end_src
* Password Management
** Password Store
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/password_store_config.el :mkdirp yes
:END:
#+begin_src emacs-lisp
  ;; Add wrapper for the command line tool 'pass'
  (use-package password-store
  	:config
  	;; If you want to adjust the default password length
  	;; (setq password-store-password-length 12)

  	;; Use Password Store as Source for Auth-Sources
  	(setq auth-sources '(password-store))

  	;; Add Functions to Leader Keys
  	(pet/leader-keys
  	  "ap"  '(:ignore t :which-key "Password Store")
  	  "app" 'password-store-copy
  	  "api" 'password-store-insert
  	  "apg" 'password-store-generate))

#+end_src
** Emacs TOTP
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/totp_config.el :mkdirp yes
:END:

[[https://codeberg.org/RastiGiG/emacs-totp][Emacs-totp]] is my personal version of [[https://github.com/juergenhoetzel/emacs-totp][GitHub.com: JuergenHoetzel - emacs-totp]]
#+begin_src emacs-lisp
  ;; Load TOTP Functionality
  (straight-use-package
   '(emacs-totp :type git :host codeberg :repo "RastiGiG/emacs-totp"))

  (pet/load-file "emacs-totp.el")

#+end_src
* Contact Management
** EBDB
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/ebdb_config.el :mkdirp yes
:END:

[[https://github.com/girzel/ebdb/blob/master/ebdb.org][EBDB]] is an [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]] [[id:1c44cf3c-6549-4e70-a3fd-491df7996dd5][Package]] meant to replace ~BBDB~ (~"Big Brother Data Base"~) as a tool for Contact Management.
In contrast to ~BBDB~ it is very well documented.

DISABLED FOR NOW
:NOTE:
~'E'~ stands for ~'EIEIO'~, which in turn means ~'Enhanced Implementation of Emacs Interpreted Objects'~ - a fancy way of saying ~Object Oriented Elisp~
:END:
#+begin_src emacs-lisp
  ;; Use EBDB for contact management
  (use-package ebdb
    :config
    ;; Set the source files for Contact DBs
    (setq ebdb-sources (list
  					  (concat pet/home-dir "Contacts/default-contacts.db")
  					  (concat pet/home-dir "Contacts/family.db")
  					  (concat pet/home-dir "Contacts/work.db")
  					  (concat pet/home-dir "Contacts/organizations.db")
  					  (concat pet/home-dir "Contacts/mailing-lists.db")))

    ;; Access Menu through '.' in EBDB Buffer
    ;; (define-key ebdb-mode-map
    ;;		  "." 'hydra-ebdb-menu/body)

    ;; Specify the Display Format for Month and Day on Anniversaries
    ;; (setq ebdb-anniversary-md-format "%B %d")
    ;; Specify the Display Format for Year, Month and Day on Anniversaries
    ;; (setq ebdb-anniversary-ymd-format "%B %d, %Y")

    ;; Set Keybindings
    (pet/leader-keys
  	"c"  '(:ignore t :which-key "Contacts")
  	"co" '(ebdb-open :which-key "Open Contact Database")))

#+end_src
