000_OrgFiles/EmacsConfig.org
* ERC
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/erc_config.el :mkdirp yes
:END:

~IRC Server~ lists:
+ [[https://hackint.org/servers][HackInt.org: Server]]
#+begin_src emacs-lisp
  ;; Define Servers
  (defun pet/irc-libera-server
  	  (interactive)
  	(erc-tls :server "irc.libera.chat"
  			 :port   "6697"))

  (defun pet/irc-hackint-server
  	  (interactive)
  	(erc-tls :server "irc.hackint.org"
  			 :port   "6697"))

  (defun pet/irc-hackint-de-server
  	  (interactive)
  	(erc-tls :server "irc.hackint.org"
  			 :port   "6697"))

  (defun pet/irc-oftc-server
  	  (interactive)
  	(erc-tls :server "irc.oftc.net"
  			 :port   "6697"))

  ;; Setup ERC Chat Client
  ;; Set the Prompt to represent the the buffer-name
  (setq erc-prompt (lambda () (concat "[" (buffer-name) "]"))

  	  ;; Basic Account Config
  	  ;; Default Server
  	  erc-server "irc.libera.chat"
  	  erc-nick "sailti"

  	  ;; More info on the modeline
  	  erc-track-shorten-start 8

  	  ;; cleanup buffers
  	  erc-kill-buffer-on-part t

  	  ;; channel list
  	  erc-autojoin-channel-alist
  	  '(("irc.libera.chat"
  		 "#systemcrafters"
  		 "#emacs"))

  	  ;; bury private messages in buffer list
  	  erc-auto-query 'bury

  	  ;; Autofill nickname column to 20 chars for better formatting
  	  erc-fill-function 'erc-fill-static
  	  erc-fill-static-center 30)

  ;; Set Keyboard to be accessable by 'C-c i'
  (global-set-key (kbd "C-c i") 'erc-tls)

  (pet/leader-keys
  	"i"  '(:ignore t :which-key "IRC")
  	"mi" 'erc-tls
  	"ml" '(pet/irc-libera-server :which-key "Libera Chat")
  	"mh" '(pet/irc-hackint-server :which-key "Hack Int")
  	"mo" '(pet/irc-oftc-server :which-key "Open and Free Technology Community"))

#+end_src
* ERadio
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/eradio_config.el :mkdirp yes
:END:

[[https://github.com/olavfosse/eradio][eradio]] is a simple ~Internet radio player~ for [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]].
It uses =‘vlc’= as its backend by default, but you can change the =eradio-player= ~variable~ to use another ~multimedia player~.
This config sets ~eradio~ to use =‘mpv’= instead of =‘vlc’= because it supports more types of ~Internet radio streams~.
#+begin_src emacs-lisp
  ;; Add Radio to Emacs and load Internet Radio Streams
  (use-package eradio
    :init
    (setq eradio-player '("mpv" "--no-video" "--no-terminal"))
    :config
    (setq eradio-channels '(("Totally 80s FM" . "https://zeno.fm/radio/totally-80s-fm/")
                            ("Oldies Radio 50s-60s" . "https://zeno.fm/radio/oldies-radio-50s-60s/")
                            ("Oldies Radio 70s" . "https://zeno.fm/radio/oldies-radio-70s/")
                            ("Unlimited 80s" . "https://zeno.fm/radio/unlimited80s/")
                            ("80s Hits" . "https://zeno.fm/radio/80shits/")
                            ("90s Hits" . "https://zeno.fm/radio/90s_HITS/")
                            ("2000s Pop" . "https://zeno.fm/radio/2000s-pop/")
                            ("The 2000s" . "https://zeno.fm/radio/the-2000s/")
                            ("Hits 2010s" . "https://zeno.fm/radio/helia-hits-2010/")
                            ("Classical Radio" . "https://zeno.fm/radio/classical-radio/")
                            ("Classical Relaxation" . "https://zeno.fm/radio/radio-christmas-non-stop-classical/")
                            ("Classic Rock" . "https://zeno.fm/radio/classic-rockdnb2sav8qs8uv/")
                            ("Gangsta49" . "https://zeno.fm/radio/gangsta49/")
                            ("HipHop49" . "https://zeno.fm/radio/hiphop49/")
                            ("Madhouse Country Radio" . "https://zeno.fm/radio/madhouse-country-radio/")
                            ("PopMusic" . "https://zeno.fm/radio/popmusic74vyurvmug0uv/")
                            ("PopStars" . "https://zeno.fm/radio/popstars/")
                            ("RadioMetal" . "https://zeno.fm/radio/radio-metal/")
                            ("RocknRoll Radio" . "https://zeno.fm/radio/rocknroll-radio994c7517qs8uv/"))))

#+end_src
* Elfeed - Emacs RSS Feed
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../C01_EmacsConfiguration/.emacs.d/package_configs/elfeed_config.el :mkdirp yes
:END:
** Load Elfeed

~Elfeed~ is a package, that enables you to see your ~RSS Feed~ in [[id:3cf0fa83-18b3-4206-a109-f4606a94b8c1][Emacs]]. We also set up ~elfeed-score~
Great inspirations for ~Elfeed~ Configurations can be found here:
- [[https://protesilaos.com/emacs/dotemacs#h:0cd8ddab-55d1-40df-b3db-1234850792ba][Protesilaos.com]]
- [[https://github.com/jkitchin/scimax/blob/master/scimax-elfeed.el][GitHub.com: John Kitchin - Scimax-Elfeed]]
#+begin_src emacs-lisp
  ;; Load Elfeed
  (use-package elfeed
    :bind (("C-c f" . elfeed)
  		 :map elfeed-search-mode-map
  		 ("n" . (lambda () (interactive)
  				  (next-line) (call-interactively
  					   'elfeed-search-show-entry)))
  		 ("p" . (lambda () (interactive)
  				  (previous-line) (call-interactively
  						   'elfeed-search-show-entry)))
  		 ("m" . (lambda () (interactive)
  				  (apply 'elfeed-search-toggle-all '(star))))
  		 ("g" . elfeed-update)
  		 ("G" . elfeed-search-update--force))
  		 ;;:map elfeed-show-mode-map
  		 ;;("w" . elfeed-show-yank))
    :config
    (setq elfeed-show-entry-switch 'display-buffer)
    (setq elfeed-search-remain-on-entry t)
    ;; Various Necessary/Helpful Settings
    (setq elfeed-use-curl t)
    (setq elfeed-curl-max-connections 10)
    (setq elfeed-db-directory
  		(concat pet/dotfiles-emacsconfig-dir "elfeed/"))
    (setq elfeed-enclosure-default-dir
  		"~/Downloads/")
    (setq elfeed-search-filter
  		"@4-months-ago +unread")
    (setq elfeed-sort-order 'descending)
    (setq elfeed-search-clipboard-type 'CLIPBOARD)
    (setq elfeed-search-title-max-width 150)
    (setq elfeed-search-title-min-width 30)
    (setq elfeed-search-trailing-width 25)
    (setq elfeed-show-truncate-long-urls t)
    (setq elfeed-show-unique-buffers t)
    (setq elfeed-search-date-format
  		'("%F %R" 16 :left))

    ;; Snippet for periodic update for feeds
    ;; (add-to-list 'elfeed-update-hooks 'elfeed-update)
    ;; (run-with-timer 0 (* 60 60 4) 'elfeed-update)

    ;; Load Feeds and Feed Settings
    (pet/load-file (concat pet/dotfiles-emacsconfig-dir
  						 "EmacsRSSFeed.el")))

#+end_src
** Elfeed-Score

~Elfeed-Score~ is a ~package~ that applies [[https://www.gnu.org/software/emacs/manual/html_node/gnus/Scoring.html#Scoring][Gnu-Style Scoring]] to [[id:211d12c6-29db-4550-bd06-ef6f8b32640c][Elfeed]]

#+begin_src emacs-lisp
  ;; Load Elfeed Score
  (use-package elfeed-score
    :config
    (progn
      (elfeed-score-enable)
      (define-key elfeed-search-mode-map "="
                  elfeed-score-map))
    (setq elfeed-search-print-entry-function
          #'elfeed-score-print-entry)
    (setq elfeed-score-serde-score-file
          (concat pet/dotfiles-emacsconfig-dir
           "elfeed.score"))
    (setq elfeed-score-rule-stats-file
          (concat pet/dotfiles-emacsconfig-dir
                  "elfeed.stats")))
#+end_src
** Elfeed-Org

[[https://github.com/remyhonig/elfeed-org][Elfeed-Org]] allows you to configure [[id:211d12c6-29db-4550-bd06-ef6f8b32640c][Elfeed]] with [[id:8510330a-9746-4684-ba60-04255df37924][Org Mode]]
#+begin_src emacs-lisp
  ;; Configure Elfeed with Org Mode
  (use-package elfeed-org
    :config
    ;; Default Elfeed config can be found under "~/.emacs.d/elfeed.org"
    (setq rmh-elfeed-org-files (list "~/Org/elfeed.org"))
    ;; Automatically set ignore tag for feeds with errors
    (setq rmh-elfeed-org-auto-ignore-invalid-feeds t)
    ;; Hook elfeed-org up to elfeed
    (elfeed-org))

#+end_src
** Elfeed-Dashboard

[[https://github.com/manojm321/elfeed-dashboard][Elfeed-Dashboard]] adds a [[id:43c5ff9c-3392-4b4a-ace7-f2a0af5f13b1][mu4e]]-like ~Dashboard~ to [[id:211d12c6-29db-4550-bd06-ef6f8b32640c][Elfeed]]
#+begin_src emacs-lisp
  ;; Add Dashboard to Elfeed
  (straight-use-package
    '(elfeed-dashboard
      :type git
      :host github
      :repo "Manoj321/elfeed-dashboard"))

  ;; Configure Dashboard
  (setq elfeed-dashboard-file "~/Org/elfeed-dashboard.org")
  (advice-add 'elfeed-search-quit-window
              :after #'elfeed-dashboard-update-links)

#+end_src

* Automatically Tangle Files
:NOTE:
This Section is ~deprecated~ since the ~Org Auto Tangle~ was added
:END:
** Emacs
*** Config File
#+begin_src emacs-lisp :tangle no
  ;; Setup Automatic Tangling of Files

  ;; Automatically tangle config file
  ;; Helper Function to that does the tangling
  (defun pet/org-babel-tangle-emacs-config ()
	(when (string-equal
		   (buffer-file-name)
		   (concat pet/dotfiles-dir
				   "000_OrgFiles/EmacsConfig.org"))
	  ;; Have the user confirm tangle
	  (let ((org-confirm-babel-evaluate t))
		(org-babel-tangle))))

  ;; This hook automatically evaluates the helper
  ;; function after saving the buffer
  (add-hook 'org-mode-hook
			(lambda ()
			  (add-hook
			   'after-save-hook
			   #'pet/org-babel-tangle-emacs-config)))

#+end_src
